{
  "url": "https://about.gitlab.com/direction/gitlab_dedicated",
  "title": "Category Direction - GitLab Dedicated\n|\nGitLab",
  "headings": [
    "Category Direction - GitLab Dedicated",
    "Overview",
    "Why is this important?",
    "Positioning",
    "Where we are Headed",
    "Roadmap",
    "Go-to-market plans",
    "User success metrics",
    "Competitive Landscape"
  ],
  "text": "Category Direction - GitLab Dedicated\n|\nGitLab\nCategory Direction - GitLab Dedicated\nMaintained by\n:\nContribute to this page\nEdit this page\nYou are here:\nGitLab Direction\nCategory Direction - GitLab Dedicated\nThe following page may contain information related to upcoming products, features and functionality. It is important to note that the information presented is for informational purposes only, so please do not rely on the information for purchasing or planning purposes. Just like with all projects, the items mentioned on the page are subject to change or delay, and the development, release, and timing of any products, features or functionality remain at the sole discretion of GitLab Inc.\nOverview\nSolution\nBackground\nWhy is this important?\nChallenges to address\nMigration\nSecurity and Compliance\nObservability\nScalability\nAvailability\nPerformance\nPositioning\nTarget Customer\nTarget User Persona\nTarget Buyer\nShared Responsibility\nComparison to other Deployment Options\nWhere we are Headed\nPrioritization Framework\nCurrently Available Features\nWhat is Not Planned Right Now\nRoadmap\nFY25\nQ1\nQ2\nQ3\nQ4\nFuture\nTheme: Disaster Recovery\nTheme: Feature Parity\nTheme: Global availability\nTheme: Customer experience\nHosted runners for GitLab Dedicated\nSupporting AI Features on GitLab Dedicated\nParity between self-managed, multi-tenant SaaS and Dedicated\nGo-to-market plans\nGuidelines for Engaging Customers at GA\nQualify the customer:\nCreate the opportunity in Salesforce:\nWhen to engage the Dedicated team\nAdditional public-facing GitLab Dedicated materials:\nChannel Partner Role in GitLab Dedicated\nPricing\nMore details on pricing\nUser success metrics\nCompetitive Landscape\nFootnotes\nThis page outlines the Direction for the GitLab Dedicated category and belongs to the\nGitLab Dedicated\ngroup. To provide feedback or ask questions about this product category, reach out to the\nProduct Manager\n.\nThis document and linked pages contain information related to upcoming products, features, and functionality. It is important to note that the information presented is for informational purposes only. Please do not rely on this information for purchasing or planning purposes. As with all projects, the items mentioned in this document and linked pages are subject to change or delay. The development, release, and timing of any products, features, or functionality remain at the sole discretion of GitLab Inc.\nYou can contribute to this category by:\nCommenting on a relevant epic or issue in\nour project\n(GitLab internal), or opening a new issue in the\nGitLab Dedicated issue tracker\n.\nJoining the discussion in the\n#f_gitlab_dedicated\nSlack channel\nOverview\nSolution\nGitLab Dedicated combines the low overhead and efficiency of a SaaS platform with the flexibility and privacy benefits of self hosting. A single-tenant SaaS instance, fully managed and hosted by GitLab in any cloud region, is updated regularly to give you access to our latest product improvements — without the need to manage security, scalability, availability, and performance on your own. It's the offering of choice for enterprises and organizations in highly regulated industries that have complex regulatory, compliance, and data residency requirements. If you're a customer that's interested in Dedicated, make sure to also check-out\nthe website for Dedicated\n.\nBackground\nGitLab Dedicated's objective is to provide a GitLab SaaS offering to large enterprises and customers in industries with strict security and compliance requirements. When adopting DevOps tools, customers\nincreasingly prefer SaaS\nto reduce operational cost, but customers in highly-regulated industries (e.g. Healthcare, Finance, and Public sectors) can't compromise on their security and compliance requirements when moving to SaaS. These requirements (e.g. isolated storage of source code IP) often dictate the need to be on separate Cloud Infrastructure from other tenants. This makes it challenging for these customers to adopt a shared-tenancy SaaS solution like GitLab.com.\nAdditionally, customers in regulated industries often require the ability to connect users or services running in their corporate network to their source code repositories running in the cloud via a private network connection. As a public-facing SaaS service, GitLab.com can't support this type of private connectivity easily by default. Finally, large, globally-distributed enterprises need the ability to control the location and number of Geo Replica sites to reduce latency for their workforce around the world. Some of our Self-Managed customers have 5+ Geo sites, and for them to consume SaaS they may need more global coverage than\nwhat we offer on GitLab.com today\n.\nFor these customers, a higher level of tenant isolation and deployment customization is required. While some customers may be satisfied leveraging a\npartner MSP\n, customers may prefer to consume the service directly from GitLab so that they have a single-point of contact for operational accountability.\nGitLab Dedicated will solve these needs by offering a fully isolated, private GitLab instance, deployed in the customer's cloud regions of choice. The instance is fully hosted and managed by GitLab Inc., enabling customers to offload operational overhead and focus on more business-critical tasks. GitLab Dedicated tenant operators (e.g. a system administrator) will retain the ability to quickly make changes to their Dedicated tenant's configurations in the course of their daily work using the\nSwitchboard\nportal.\nIn addition to delivering customer value, GitLab Dedicated will also benefit internal GitLab teams. We envision the tooling we build for Dedicated being used as the single method going forward for running all of GitLab Inc.'s SaaS services. This will allow us to achieve even greater returns on our initial investment by enabling any future SaaS services to quickly get started with a robust and standardized foundation.\nWhy is this important?\nThere are two major trends emerging when it comes to the delivery of Cloud based solutions:\nMove to SaaS\nas detailed in the .com strategy\n(IDC predicts that the market for SaaS-based DevOps tools (52% of the market in 2021) will continue to accelerate and account for\n$20.0B in revenue\n(or 61% of DevOps software tools market) by 2026).\n1\nAdoption of Private Cloud, which makes it easier for enterprises to meet their security and compliance needs. Increasing fragmentation of global policy\nregarding data protection\ndrives new compliance requirements, which can be better met with Private Cloud deployments. 16% of cloud services are expected to be delivered as a hosted private cloud offering\nby 2025\n.\nGitLab Dedicated is for organizations that want to benefit from both SaaS and Private Cloud. By delivering this offering we will set ourselves up to achieve customer success as these two trends further accelerate in 2025.\nChallenges to address\nOverall, the main challenge our target customer has is maintaining an up-to-date GitLab instance that fulfills their security and compliance requirements. More granular customer needs are documented in the sections below.\nNote, this section does not reflect the list of currently available features within the GitLab Dedicated offering; rather, it contains the needs we're hearing from our customer base. The list of currently supported features in GitLab Dedicated is documented here:\nhttps://docs.gitlab.com/ee/subscriptions/gitlab_dedicated/#available-features\n.\nMigration\nUsers want to seamlessly migrate their data, which can exceed many TBs in size, to GitLab Dedicated in a timely and reliable fashion from their existing DevOps solution, whether it's a third-party offering like BitBucket, a self-managed GitLab instance, or GitLab.com.\nSecurity and Compliance\nOur\ntarget customer base\n, large enterprises and customers in highly-regulated industries, expect the offering to implement security best practices including encryption of data at rest and in transit, periodic encryption key rotation, ability to specify their own encryption key, integration with their own identity management systems, protection against DDoS attacks, intrusion detection, role-based access control for operators, segregation of duties with least privilege access configured among operator accounts, and approved escalation in order to access customer environments during break-glass scenarios.\nUpgrades: Customers want regular, zero-downtime upgrades to their instance along with timely security patches for high-sev issues when necessary.\nData residency/data sovereignty: Customers want their Dedicated instance and data (including logs and backups) to be hosted in their cloud region of choice to help meet their security and compliance requirements.\nPrivate Networking: Customers want to be able to securely connect applications running in their VPC including their Runner pool to GitLab Dedicated via a private connection without the traffic leaving the Cloud Provider backbone.\nPublic Networking: Some customers work with third-parties (e.g. contractors), who do not authenticate through their main network and thus need to access the GitLab Dedicated instance over the public internet. In this scenario, customers need the ability to restrict access to their instance based on an allowlist of trusted IP ranges.\nObservability\nCustomer admins want to access telemetry data including health metrics and application/system logs so that they can monitor their instance and keep their internal teams informed regarding an outage or performance degradations with their DevOps environment. Users also want access to audit logs to achieve compliance requirements and the ability to monitor network flow (e.g. VPC flow logs) to ensure outbound connections are made to only known/trusted hosts.\nScalability\nLarge enterprises want their chosen DevOps solution to automatically scale based on their number of users and usage patterns.\nAvailability\nLarge enterprises demand strict uptime SLAs (at least 'three-nines') and expect the following capabilities related to system availability:\nHigh Availability Deployment (especially their code repositories) including leveraging multiple availability zones within a region to mitigate against an AZ outage.\nDisaster Recovery: Failovers to the included secondary site in case the primary instance experiences an unrecoverable outage and guaranteed recovery times.\nBackups: customers expect their data to be backed up on a regular basis in case of a data loss event and to meet committed recovery point and time objectives during restoration.\nPerformance\nCustomers want replicas of their instance to be deployed in multiple regions around the globe to reduce latency for their global user base.\nPositioning\nTarget Customer\nCustomer Requirements\nTo be a good fit for Dedicated a customer\nmust\nhave the characteristics below:\nRequire at least 1000 seats. Note: 500 seat opportunities will be considered on a case-by-case basis.\nRequire the security and compliance features offered in the Ultimate tier.\nRequire a single-tenant solution or has compliance requirements around data residency.\nIn addition to customers looking to solve the above\nchallenges\n, below are some additional characteristics of customers we are targeting with this offering:\nTarget Customer Characteristics\nIndustries\n- Regulated industries with complex security and compliance requirements like:\nHealthcare\nFinance (Banking and Insurance)\nPublic sectors\nPublic Utility\nTransportation\nManufacturing\nGood fit characteristics\nLooking for Ultimate tier features and is comfortable with 500 Ultimate seat minimum order — plus an\nadditional fee\n- otherwise GitLab Dedicated is cost prohibitive.\nHighly value a secure SCM foundation; have concerns around leaks and the inability to isolate repositories within the enterprise.\nAim to improve developer productivity and user experience translating to unparalleled collaboration with observability.\nWant SaaS but object to GitLab.com. The customer would prefer single-tenant SaaS due to strict security and compliance requirements\nHave data residency compliance requirements where instance and data (including logs and backups) need to be hosted in customer's cloud region of choice.\nIs looking for all the benefits of SaaS with the security/compliance rigor of self-managed.\nLooking for savings on costs and operational efficiencies; do not want to manage the DevSecOps platform. The customer sees the benefit of regular updates and infrastructure maintenance are managed by GitLab.\n8.Looking for an isolated, single tenant deployment\nLooking for a proven product with\nhigh availability\n- GitLab has multiple large customers that have been using Dedicated for over a year (ie:\nNatWest\nWant replicas of their instance to be deployed in multiple regions around the globe to meet disaster recovery requirements.\nRequire access to logs and backups.\nRequire advanced scale of GitLab’s distributed architecture, managed by subject matter experts.\nCompanies that want options for deploying GitLab without sacrificing feature parity.\nMay not be a good fit\nOpen to (or required to) undertaking the operational costs and management of a fully self-managed solution and related infrastructure.\nWould like more control over upgrades - e.g. needing to review and approve ahead of time.\nDo not\nhave a need for:\nUltimate OR\nA single tenant SaaS offering OR\nStrict data residency, compliance and heightened security requirements OR\nThe minimum 1,000 User count threshold\nTarget User Persona\nSidney (Systems Administrator)\nTarget Buyer\nCTO/CIO - Goals (Minimize OpEx while enhancing compliance & security, with near zero downtime)\nVP of Application Development - Goals (Shifting security left and focus on development vs. hosting, upgrading, securing, patching, etc. GitLab)\nCISO - Goals (Embedding application security early in the SDLC, while minimizing risk & cost from infrastructure security & compliance)\nTech Exec Tristan\n- CIO/ CTO\nPlatform Perry\n- Typical roles - Infrastructure Engineering, Platform Engineering\nBack Office Blake\n- Typical roles - Head of Procurement\nShared Responsibility\nAs a SaaS solution, our customers should not have to worry about the details of operating GitLab. The goal is for them to have minimal management overhead. Having said that, the successful operation of GitLab Dedicated still requires a shared responsibility.\nGitLab Dedicated Responsibility\nManaging updates of underlying software such as PostgreSQL, Kubernetes, Redis, OpenSearch, and GitLab itself\nInfrastructure operational monitoring and incident response\nCapacity planning based on historical trends\nEnsuring the Security of the Infrastructure and Network layer\nCustomer Responsibility\nAdhering to performance GitLab practices, including but not limited to:\nOnly storing\nlarge blobs\nwith\nLarge File Storage (LFS) objects\nFor large\nmonorepos\n(larger than several gigabytes), reducing concurrent clones wherever possible, especially in CI/CD pipelines, to avoid potential bandwidth saturation\nAvoiding large spikes in concurrent CI jobs (e.g. hundreds launching at the same time of day)\nLimiting hundreds of concurrent CI jobs for\nlarge repositories\nOptimizing custom scripts that run at high frequency\nManaging\nintegrations\nin many large projects\nProperly configuring\nserver hooks\nCarefully implementing\nsystem hooks\nImplementing best practices for Security at the\napplication layer\nsuch as least privilege access\nComparison to other Deployment Options\nOn GitLab Dedicated, customers are the administrators of their instance with full access to the\nAdmin area\nof their tenant. This is different from GitLab.com, where administration is owned by the GitLab Infrastructure team.\nAvailability will not be a point of differentiation between GitLab Dedicated and GitLab.com as both offerings target a 99.95% Availability SLA.\nSee below for a comparison of the different ways to deploy GitLab:\nWhere we are Headed\nNow that GitLab Dedicated has graduated from Limited Availability to General Availability, it can scale to meet the expected customer demand of the service. Customers who want a production-quality GitLab Dedicated instance and are willing to pay for it can now get one.\nNext, we plan to focus on improving the onboarding and configuration management experiences by delivering the Switchboard management console. Additionally, we plan to add several highly requested features that were deferred in the lead up to GA. See the roadmap section below for more details.\nPrioritization Framework\nBecause Dedicated is a SaaS offering, we prioritize \"Keep the lights on\" activities (e.g. operating customer environments, tech debt, and corrective actions) above all else to ensure we provide customers a high level of service that continually meets our\nplatform SL0\n.\nWhen it comes to customer feature requests, we prioritize features that\nwill benefit the most customers\n. As a result, we will not build any custom capabilities or one-off features for individual customers. This includes not making modifications to individual tenants. Feature requests that meet our prioritization criteria but are not currently on the roadmap will be slotted in\nafter other committed roadmap items\nhave been delivered. For more information about feature requests for Dedicated, see the\nfeature request tracking issue\n.\nPriority\nCategory\nDescription\n1\nKTLO - On Call\nOperating Tenant Production Environments, Handling new tenant onboarding and config change requests\n2\nSecurity, Reliability, Performance\nInitiatives tied to increasing overall security (e.g. third party compliance certifications and addressing security findings), reliability (including improvements to Availability SLAs and disaster recovery procedures and targets), and scalability (ability to better scale underlying tenant infrastructure to support new customers as well as existing tenants ad their workloads and usage patterns increase)\n3\nAutomation\nReduce toil required to operate the GitLab Dedicated platform and improve internal developer experience\n4\nCustomer Feature Requests\nDelivering new customer-facing platform capabilities as well as enabling GitLab functionality such as Pages, advanced search, reply-by email, service desk\n5\nTechnical Debt\nInitiatives tied to increasing speed of development, overall efficiency\nCurrently Available Features\nPlease see list of\nAvailable Features\nin our documentation.\nWhat is Not Planned Right Now\nPlease see list of\nFeatures that are not available\nin our documentation. While the most requested of these have been incorporated into the\nroadmap\nbelow, we are not currently focused on delivering the other features mentioned in that list. These will be considered for next year based on customer demand.\nRoadmap\nThe key capabilities we plan to deliver in Environment Automation for the first half of FY25 are summarized below. The roadmap for Switchboard can be found on the\nSwitchboard Direction Page\n.\nFY25\nQ1\nRTO and RPO improvements\n- Complete\nNext Iteration of Dedicated Runners Beta\n- Complete\nSupport Bring your own Domain on Tenant Instances\n- Complete\nQ2\nNext Iteration of Dedicated Runners Beta\n(continued)\nRTO and RPO improvements\n(continued) - Complete\nGitLab 17.0 upgrade - Complete\nQ3\nRTO and RPO improvements - Will continue\nOIDC Auth when using IP AllowLists - Complete\nMultiple SAML providers - Complete\nQ4\nWeb application firewall MVC - Complete\nSCIM Auth when using IP AllowLists - Complete\nOpenSSL v3 preparation - Complete\nFuture\nTheme: Disaster Recovery\nPoint in time restore\nRTO and RPO improvements\nTheme: Feature Parity\nMultiple login providers\nTheme: Global availability\nAdditional region support\nGeo for global acceleration\nTheme: Customer experience\nPre-production instances\n(pricing and packaging, version n)\nLog sharing notifications for customers\nImproved SLAs\nMake Dedicated Repos Public\nHosted runners for GitLab Dedicated\nThe following features are currently planned for FY26\nHosted runners on Linux - General Availability\nHosted runners outbound network control\nHosted runners on macOS - Beta\nHosted runners on Windows - Beta\nSupporting AI Features on GitLab Dedicated\nGitLab\nAI features\nimprove DevSecOps workflow efficiency and velocity by applying AI assisted workflows to all teams involved in delivering software value.\nAs a cloud-based Saas service, GitLab Dedicated is a natural fit to deliver cloud-based AI services to customers. However, as a single-tenant service we need to design a solution that maintains single-tenancy and does not compromise on customer compliance requirements like data residency and isolation, and predictability.\nShort term, our goal is to bring AI features to GitLab Dedicated starting with Code Suggestions, followed by Suggested Reviewers. That effort can be tracked\nvia this epic\n.\nLong term, our vision is to design native AI capbilities for single-tenant SaaS deployments. This may include training models inside tenant environments to generate tailored insights and suggestions while keeping data private. This will allow enterprises and regulated industries to more easily adopt AI-assisted workflows while maintaining compliance requirements around data residency, privacy, and isolation.\nWhile we don't have any specific timelines to share for bringing all AI features to GitLab Dedicated at this time, as these features become Generally Available, we will be working on a plan to enable them in GitLab Dedicated.\nParity between self-managed, multi-tenant SaaS and Dedicated\nGitLab strives to maintain\nparity between self-managed and SaaS\n. This can be challenging for certain features, like AI. From a Dedicated perspective, we adhere to the following principles:\nWe intend to make all AI features available to all platforms. We want to solve customer problems on all platforms.\nIn line, with our\nSaaS First\nprinciple, GitLab Dedicated may support certain features before self-managed.\nGitLab Dedicated may offer additional features if there are technical or other limitiations that don't allow us to release them for self-managed customers.\nGo-to-market plans\nGuidelines for Engaging Customers at GA\nQualify the customer:\nReview the\ntarget customer profile\nto ensure it is a good fit\nEnsure that the customer meets the minimum seat count of 1000\nReview the\nTechnical Qualification guidelines\nto ensure there is a technical fit.\nReview\npricing\n, as this will cost more than our other offerings\nCreate the opportunity in Salesforce:\nIn your SFDC opportunity, set the Intended Product Tier to Dedicated Ultimate OR include Dedicated in the Opportunity name. This is the most important step to ensure we have visibility into the Dedicated pipeline.\nInclude number of Ultimate seats somewhere easily referenceable in your SFDC opportunity (such as the opportunity title) to make it clear that the deal is\nqualified\n.\nWhen to engage the Dedicated team\nAccount teams (Sales leads and SAs) should give the initial pitch of Dedicated to their customers using the materials on the\nDedicated Page in Highspot\n. This allows the Product team to spend more time supporting Dedicated deals that are further along in the sales cycle.\nTechnical questions and unique customer requirements\nAfter the account team gives the initial pitch, if the opportunity progresses and the customer has technical questions or requirements for the service that cannot be answered by\nthe documentation\nor the\ntechnical qualification guidelines\n, please reach out to the Dedicated team in the\n#f_gitlab_dedicated\nchannel so that they can help answer these questions. After that, if the questions are still not resolved and a sync meeting is needed, please open an issue in the\nDedicated issue tracker\nusing the\nCustomer Meeting Template\nto request a call with the Dedicated team.\nPricing Calculator Review\nOnce the customer has been\nqualified\nand they have expressed interest in moving forward with pricing, please use the\npricing calculator\n(internal only) to come up with a pricing estimate for the customer. Once you have completed the steps in the pricing calculator, reach out to the Dedicated Product team in the\n#f_gitlab_dedicated\nchannel requesting a review. Also provide the\nSFDC link\nfor this opportunity.\nNote:\nyou must receive approval from the Dedicated Product team before sharing any pricing numbers with the customer and before creating a formal quote via Salesforce\nAdditional public-facing GitLab Dedicated materials:\nWe have the following public facing pages available for those interested in learning more:\nDocumentation:\nhttps://docs.gitlab.com/ee/subscriptions/gitlab_dedicated/\nBlog post:\nhttps://about.gitlab.com/blog/introducing-gitlab-dedicated/\nGitLab Dedicated webpage (and waitlist signup):\nhttps://about.gitlab.com/dedicated/\nChannel Partner Role in GitLab Dedicated\nGitLab Dedicated creates a business opportunity for both GitLab and GitLab channel partners who offer hosted GitLab services. We are creating this offering to meet the needs of customers who want to consume hosted solutions directly from the DevOps vendor (in this case GitLab, Inc.) to more closely align operational and DevOps application needs. Customers who are interested in purchasing hosting services that include value-add managed services (for example, helping meet industry-specific specific requirements like HIPAA) would benefit from working with a Managed Service Provider (MSP)\nPartner\nAdditionally, many customers have existing relationships with Channel Partners. Per the\nservices ROE\n, these customers should continue consuming GitLab through their Channel Partner. By following the segmentation laid out above, we can minimize any disruption to existing\nchannel-sourced ARR\n(GitLab internal).\nWith this effort, we also see an opportunity to grow the overall market for GitLab-hosted services through collaboration with partners. In the short-term we plan to enable MSP partners with\ndesign guidance and certifications\n(GitLab Internal) so that they can offer better hosted GitLab solutions for their customers. We will work with the GitLab Channel Partner team to create a partner certification that will provide MSP partners with technical certifications, training, deployment and maintenance guidelines, and access to some of the same underlying tooling that powers GitLab Dedicated (e.g. GitLab Environment Toolkit and official Reference Architectures). We plan to keep the other underlying services (e.g. Switchboard and Amp) as well as the\nGitLab Dedicated\nbranding proprietary to GitLab, Inc. Longer-term opportunities for consideration include enabling partners\nto resell GitLab Dedicated\n(GitLab internal). These partners would provide customers value-added services or integrated vendor stacks while the GitLab Dedicated team would still host the GitLab instance on behalf of the partner.\nPricing\nThe pricing for GitLab Dedicated is comprised of the following components:\nUltimate licenses (1000 seat minimum)\nInfrastructure & Management fee (which covers our costs of operating and hosting the service)\nFixed fee that varies based on the Infrastructure Size (e.g. S, M, L, XL, XXL, XXXL)\nThe Infrastructure & Management fee covers the following costs:\nThe cloud provider costs incurred when deploying the selected Infrastructure Size to two sites (the primary and secondary regions)\nEngineering costs needed to operate the environment (e.g. perform ongoing tasks such as upgrading the instance, applying security patches, and achieving the stated SLAs)\nCustomer Support costs\nAnnual pentests, audits, and security software costs\nStorage\nAmount of GB the customer wants to buy for their projects.\nFree storage quota\napplies.\nThe storage fee covers the following costs:\nCloud provider storage costs for all data stored in object storage and on disk\nNetworking costs\nCost of the data stored in the Geo secondary\nMore details on pricing\nWe've priced GitLab Dedicated to align with likely buyers based on minimums and the complexities of their deployments. As mentioned above, the pricing for GitLab Dedicated is comprised of the following components: the\ncost for Ultimate Licenses\n, plus additional fees for instance infrastructure & management, the amount of storage needed, and the customer's infrastructure size (e.g. S, M, L, XL, XXL). As we scale and introduce GitLab Dedicated to more and more customer cohorts we'll share further details on pricing options.\nUser success metrics\nPrimary Performance Indicator\nPaid GMAU\nSecondary Indicators\nCustomer Satisfaction\nUplift revenue: defined as revenue the offerings contributes beyond licenses. This includes the infra+management fee plus revenue from consumption pricing.\nGross Margin\nCompetitive Landscape\nThe main competitor to GitLab Dedicated is\nGitHub AE\n, which offers a fully-managed GitHub Enterprise instance in the customer's desired region on Azure. Other competitors offering single-tenant, fully-managed devops solutions include AWS CodeCommit, Azure Devops, and GitLab Host.\nFootnotes\nIDC, Worldwide DevOps Software Tools Forecast, 2022–2026, Doc # US48599322, July 2022\nEdit this page\nView source",
  "html_file": "105a65a8652da170.html"
}