{
  "url": "https://about.gitlab.com/company",
  "title": "About GitLab",
  "headings": [
    "About GitLab",
    "What we do",
    "GitLab by the numbers",
    "4,600+",
    "0",
    "162",
    "2,300+",
    "Over 50 million",
    "GitLab's mission",
    "GitLab's values",
    "GitLab over the years",
    "Working at GitLab",
    "Learn more",
    "Start shipping better software faster"
  ],
  "text": "About GitLab\nPlatform\nThe most comprehensive AI-powered DevSecOps Platform\nExplore our Platform\nBuild software faster with AI at every stage of development\nMeet GitLab Duo\n10 reasons why Enterprises choose GitLab\nLearn more\nPlatform Engineering\nDeveloper Experience\nMLOps\nProduct\nCI/CD\nAI-Assisted Development\nSource Code Management\nAutomated Software Delivery\nSecurity & Compliance\nSoftware Supply Chain Security\nCompliance & Governance\nVisibility & Measurement\nValue Stream Management\nAnalytics & Insights\nView all Solutions\nEnterprise\nSmall Business\nPublic Sector\nPricing\nResources\nInstall\nQuick start guides\nLearn\nProduct documentation\nBest practice videos\nIntegrations\nCustomer success stories\nBlog\nRemote\nTeamOps\nGitLab Services\nCommunity\nForum\nEvents\nPartners\nView all resources\nInsights for the future of software development\nRead the latest\nCompany\nAbout\nJobs\nEvents\nLeadership\nTeam\nHandbook\nInvestor relations\nTrust Center\nAI Transparency Center\nNewsletter\nPress\nContact us\nTalk to sales\nGet help\nCustomer portal\nTalk to sales\nGet free trial\nSign in\nClose\nTo search repositories and projects, login to\ngitlab.com\n.\nSuggestions\nGitLab Duo (AI)\nCode Suggestions (AI)\nCI/CD\nGitLab on AWS\nGitLab on Google Cloud\nWhy GitLab?\nTalk to sales\nGet free trial\nGet free trial\nAbout GitLab\nBehind the scenes of The DevSecOps Platform\nWhat we do\nWe're the company behind GitLab, the most comprehensive DevSecOps platform.\nWhat started in 2011 as an open source project to help one team of programmers collaborate is now the platform millions of people use to deliver software faster, more efficiently, while strengthening security and compliance.\nSince the beginning, we've been firm believers in remote work, open source, DevSecOps, and iteration. We get up and log on in the morning (or whenever we choose to start our days) to work alongside the GitLab community to deliver new innovations every month that help teams focus on shipping great code faster, not their toolchain.\nLearn more about GitLab\nGitLab by the numbers\nNumbers as of March 2025\nCode\ncontributors\n4,600+\nOffices\nAll-remote since inception\n0\nConsecutive monthly releases\n162\nTeam members\nin 60+ countries\n2,300+\nEstimated registered users\nOver 50 million\nFrom planning to production,\nbring teams together in one application\nGet free trial\nGitLab's mission\nOur mission is to enable everyone to contribute to and co-create the software that powers our world.\nLearn more\nGitLab's values\nCollaboration\nWe prioritize things that help us work together effectively, such as assuming positive intent, saying “thanks” and “sorry,” and giving timely feedback.\nResults for Customers\nWe operate with a sense of urgency and bias for action and we do what we promise because we exist to help our customers achieve more.\nEfficiency\nFrom choosing boring solutions to documenting everything and being managers of one, we strive to make fast progress on the right things.\nDiversity, Inclusion, & Belonging\nWe work to ensure GitLab is a place where people from every background and circumstance feel like they belong and can thrive.\nIteration\nWe aim to do the smallest viable and valuable thing, and get it out quickly for feedback.\nTransparency\nEverything we do is public by default, from our company handbook to the issue trackers for our product.\nGitLab over the years\n2011\nThe GitLab project began with a commit\nWe started releasing a new version of GitLab on the 22nd of every month\n2012\nThe first version of GitLab CI is created\n2014\nGitLab is incorporated\n2015\nJoined Y Combinator and published the GitLab Handbook to our website repository\n2016\nAnnounced our master plan and raised $20 million in B round financing\n2021\nGitLab Inc. became a publicly traded company on the Nasdaq Global Market (NASDAQ: GTLB)\nWorking at GitLab\nWe strive to create an all-remote environment where all team members around the world can show up as their full selves, contribute their best, feel their voices are heard and welcomed, and truly prioritize work-life balance.\nIf you're interested in being a part of the team, we invite you to\nlearn more about working at GitLab\nand apply to any open positions that look like a good fit.\nView all open roles\nBetter teams. Faster progress. Better world.\nTeamOps is GitLab's unique people practice which makes teamwork an objective discipline. It's how GitLab scaled from a startup to a global public company in a decade. Through a free and accessible practitioner certification, other organizations can leverage TeamOps to make better decisions, deliver results, and move our world forward.\nLearn more about TeamOps\nGet certified\nLearn more\nBlog\nSee what's new with GitLab, DevOps, security, and more.\nVisit the blog\nPress room\nGitLab news, press releases, logos and brand assets\nLearn more\nInvestor relations\nThe latest stock and financial information for investors.\nLearn more\n50%+ of the Fortune 100 trust GitLab\nStart shipping better software faster\nSee what your team can do with the intelligent\nDevSecOps platform.\nGet free trial\nTalk to sales",
  "html_file": "1512cbe40766e8a4.html"
}