{
  "url": "https://about.gitlab.com/direction/modelops/ai_assisted",
  "title": "Stage Direction - AI-powered\n|\nGitLab",
  "headings": [
    "Stage Direction - AI-powered",
    "On this page",
    "Overview",
    "Groups",
    "What's Next & Why",
    "What we've recently completed",
    "Analyst Landscape"
  ],
  "text": "Stage Direction - AI-powered\n|\nGitLab\nStage Direction - AI-powered\nMaintained by\n:\nG\nContribute to this page\nEdit this page\nYou are here:\nGitLab Direction\nStage Direction - AI-powered\nThe following page may contain information related to upcoming products, features and functionality. It is important to note that the information presented is for informational purposes only, so please do not rely on the information for purchasing or planning purposes. Just like with all projects, the items mentioned on the page are subject to change or delay, and the development, release, and timing of any products, features or functionality remain at the sole discretion of GitLab Inc.\nOn this page\nOverview\nGoal\nOmniscient\nEver Present\nPrivate & Secure\nGroups\nWhat's Next & Why\nWhat we've recently completed\n2024\n2023\n2022\n2021\nSmarter Code Reviewer suggestions\nAutomatic Issue Labeling\nAnalyst Landscape\nInternal resources\nOverview\nGitLab is embracing AI/ML technologies within the software development lifecycle, as the most comprehensive AI-powered DevSecOps platform. Since mid 2021, We've been leveraging AI/ML technologies to enrich features on our platform. We're calling these AI-powered capabilities,\nGitLab Duo\n.\nThe name GitLab Duo is rooted in You + GitLab AI = the AI dynamic duo. GitLab Duo goes beyond just being an AI pair programmer: It is an expanding toolbox of features integrated into the DevSecOps Platform to help teams across the entire software development environment become more efficient.\nDuo improves team collaboration and reduces the security and compliance risks of AI adoption by bringing the entire software development lifecycle into a single AI-powered application. At GitLab, we believe everyone can contribute. By bringing GitLab Duo capabilities to every persona who uses GitLab, everyone can benefit from AI-powered workflows and organizations can ship secure software faster.\nGoal\nAs we continue building GitLab Duo, there are some high level goals that drive our development process.\nAI-powered workflows\nHarness the power of AI to enhance and boost efficiency to reduce cycle times in\nevery phase of the software development lifecycle\n.\nPrivacy-first\nGitLab\nwe ensures AI model vendors don't use customer data to train their models\n.\nTransparent\nOur\npublicly available documentation\ndescribes all AI models used by GitLab Duo and understand exactly how your code base is utilized.\nBest AI Model powering each capability\nWe aren't in exclusive agreements with any one AI vendor. We use the best AI model for each task.\nAI in all distributions\nWhile we innovate with AI first on GitLab.com, our multitenant SaaS platform; we're committed to bringing Duo capabilities to\nall GitLab distributions\nincluding self-managed, Dedicated instances, and even air-gapped environments.\nOmniscient\nWe want GitLab Duo to be as knowledgeable as your most seasoned and tenured employee. That person who you can ask anything to and they are an encyclopedia of knowledge. We don't want to replace that person, but instead help scale them, to every employee in your organization. GitLab Duo will help everyone answer their own questions, learn on the fly, and become more efficient.\nGitLab can't do this on our own. While we are working to allow Duo to access data and information across the software development lifecycle, we also rely on our third-party AI model vendors to provide widely knowledgeable foundation models. Together general knowledge and GitLab specific data about your software creates an AI-assistant that truly knows all.\nEver Present\nWhat's an assistant, if not always at your side, ready to help at a moments notice. We're building GitLab Duo to meet you wherever you work: the GitLab web UI, the WebIDE, your local IDE, and even your CLI. Infusing the software development lifecycle with AI-powered features means Duo is primed and ready to help, from summarizing content, generating code, reviewing your code, troubleshooting failed CI jobs, or even resolving vulnerabilities. You can do more, faster, with Duo at your side wherever your software development journey takes you.\nPrivate & Secure\nIt's amazing to have a helpful assistant, but not if they are going to tell everyone all your deep dark secrets. GitLab Duo is designed to be private by default and secure. Leveraging modern security techniques, all data in encrypted in transit and at rest with GitLab Duo. Further we have worked with our third-party AI vendors to ensure\nthey do not retain your data nor use it to train AI models\n. Your data is yours. Period.\nWe take Duo a step further than most other AI assistant solutions, Duo can function in an offline/air-gapped environment with Duo Enterprise, allowing organizations to host their own models within their own networks to power Duo functionality. Learn more about\nself-hosted models\n.\nLearn more about\nDuo data privacy\nGroups\nThe AI-powered stage consists of the following product led groups:\nDuo Workflow\n: GitLab's autonomous AI agent .\nDuo Chat\n: GitLab's AI-powered DevSecOps assistant.\nCustom Models\n: Dedicated to empowering GitLab users with the flexibility to deploy and customize GitLab Duo Features within their local networks.\nAI Framework\n: Building common tools to support GitLab teams integrating AI/ML technologies into GitLab features.\nAI Model Validation\n: Research and Evaluate AI/ML models for use to enrich the GitLab product with Generative AI.\nWhat's Next & Why\nWe're actively building many AI-powered features into GitLab Duo, some of our upcoming milestones include:\nMaturing Duo Enterprise features\nensuring that all our AI-powered features across the software development lifecycle are available to all our customers regardless of their deployment type.\nDuo Workflow experiment\nintroducing our vision for the future of software development with automonous AI Agents\nExpanded and Additional context\nto enrich the data that Duo can access and improve it's holistic knowledge of your software projects.\nSelf Hosted Models\nto power GitLab Duo in the most restrictive and controlled environments like airgaps and private networks.\nInline-chat\nfor improved user experience while using Duo Chat in code files.\nWhat we've recently completed\nThe wider AI industry is moving at light speed, and so are we. We are quickly building to keep up with the rapid innovations in the wider AI/ML market improving our existing Duo capabilities but also introducing new ones.\nYou can keep up with our latest releases by following our\nAI Features documentation\n2024\nMajor achievements include:\nDuo Pro GA\nDuo Chat GA\nDuo Enterprise GA\nSelf-hosted Models Beta\nAnnounced GitLab Workflow\n2023\nMajor achievements include:\nCode Suggestions Experimental, Beta, and GA release\nExperimental and Beta release of\nDuo Chat\nExperimental and Beta release of 15 Generative AI capabilities that we're calling\nGitLab Duo\n. Read about these capabilities in our\nApril AI Fireside chat\nInitial design and implementation of our\nAI Architecture\nto support Generative AI use cases.\n2022\nGA of Suggested Reviewers\nExperimental Code Suggestions\n2021\nEstablished the ModelOps stage (later split to create the AI-powered stage)\nAcquisition of UnReview\nInternal beta of\nAutomatic Issue Labeling\nSmarter Code Reviewer suggestions\nGitLab acquires UnReview as it looks to bring more ML tools to its platform\nIntegrating\nUnReview’s technology\ninto the GitLab platform marks our first step in building GitLab’s AI Assisted features for DevOps.\nAutomatic Issue Labeling\nWe are currently actively working on an ML model that automatically labels GitLab internal issues based on issue content.\nYou'll see GitLab issues\nwith the\nautomation:ml\nlabel that have been automatically labeled by our model. You can also provide training feedback to the model if it is incorrect by applying the\nautomation:ml wrong\nlabel. GitLab team members can view a feed of these issues with probability data in Slack in the\n#feed-tanuki-stan\nchannel.\nWe pursued this feature first as a way to get a data science workload working within GitLab's existing CI/CD as well as running on top of production GitLab data and interacting with the GitLab data model. This will set the foundation for work in our MLOps group and our other AI Assisted categories listed above.\nAnalyst Landscape\nBased on\nGitLab’s 2023 What's Next in DevSecOps survey,\nAI is becoming more and more embedded in software development.\nThe vast majority (83%) of respondents agreed that it is essential to implement AI in their software development processes to avoid falling behind, and this was consistent across development, operations, and security\nOrganizations are using AI across the software development lifecycle — and that means more than code generation.\nDevelopers spend 25% of their time writing new code. That means three quarters of developers’ time is taken up with other tasks beyond code generation.\nRespondents expressed concerns around data privacy, intellectual property, and security.\nThere is concern around introducing AI into the software development lifecycle, but it’s not extreme: 32% of respondents were “very” or “extremely” concerned about AI being introduced into the software development lifecycle, while 23% were “not very” or “not at all” concerned. The largest proportion, 45%, were “somewhat concerned”\nThese statistics validate the importance of GitLab’s AI Assisted features for DevOps, and integrating automation and machine learning technology like UnReview into the GitLab platform.\nIndustry analyst research into successful operationalization of machine learning outlines the many challenges organizations face by adopting point solution technologies. This is contrasted with the business value provided by integrating AI Assisted features, DataOps, MLOps, and ModelOps into existing DevOps processes.\n\"With the rapid increase in cloud adoption, spurred by the COVID-19 pandemic, we’re seeing increased demand for cloud-enabled DevOps solutions,\" said Jim Mercer, research director DevOps and DevSecOps at IDC. \"DevOps teams who can capitalize on cloud solutions that provide innovative technologies, such as machine learning, to remove friction from the DevOps pipeline while optimizing developer productivity are better positioned to improve code quality and security driving improved business outcomes.\"\nForrester - [State of TuringBots, 2023](https://www.forrester.com/report/the-state-of-turingbots-2023/RES179746\nAccompanying blog post: []\"AI And Generative AI For The Software Development Lifecycle\"](https://www.forrester.com/blogs/ai-and-generative-ai-in-the-software-development-lifecycle/)\nForrester -\nFuture of TuringBots, 2023\nGartner -\nWhat is Generative AI\nGartner -\nTackling Trust, Risk and Security in AI Models\nMcKinsey -\nThe economic potential of generative AI: The next productivity frontier\nRetool's 2023 State of AI in Production\nInternal resources\nGitLab team members can learn more in our internal handbook:\nSlack: #ai_strategy\nAI Strategy\nLast Reviewed: 2024-10-05\nLast Updated: 2024-10-05\nEdit this page\nView source",
  "html_file": "1fca078ddd82a850.html"
}