{
  "url": "https://about.gitlab.com/direction/monitor/analytics-instrumentation",
  "title": "Product Direction - Analytics Instrumentation\n|\nGitLab",
  "headings": [
    "Product Direction - Analytics Instrumentation",
    "On this page",
    "Vision",
    "Guiding principles",
    "Roadmap (As of 2025-06-30)",
    "Evolution of analytics instrumentation",
    "Personas that we work with",
    "Challenges we face in Analytics Instrumentation",
    "Our opinion on automated tracking",
    "How We Work",
    "Working Groups and Cross-Functional Initiatives",
    "Quick Links"
  ],
  "text": "Product Direction - Analytics Instrumentation\n|\nGitLab\nProduct Direction - Analytics Instrumentation\nMaintained by\n:\nContribute to this page\nEdit this page\nYou are here:\nGitLab Direction\nStage Direction - Monitor\nProduct Direction - Analytics Instrumentation\nThe following page may contain information related to upcoming products, features and functionality. It is important to note that the information presented is for informational purposes only, so please do not rely on the information for purchasing or planning purposes. Just like with all projects, the items mentioned on the page are subject to change or delay, and the development, release, and timing of any products, features or functionality remain at the sole discretion of GitLab Inc.\nOn this page\nVision\nGuiding principles\nRoadmap (As of 2025-06-30)\nEvolution of analytics instrumentation\nPersonas that we work with\nProduct groups within GitLab\nProduct Manager personas\nEngineer personas\nGitLab Data program\nCustomer success\nExternal GitLab users\nChallenges we face in Analytics Instrumentation\nOur opinion on automated tracking\nHow We Work\nWorking Groups and Cross-Functional Initiatives\nQuick Links\nVision\nWe provide intuitive instrumentation tools that capture essential product usage data throughout the product lifecycle,\nenabling evidence-based decisions with minimal friction. These tools help teams derive actionable insights on feature\nusage to build better features and increase adoption.\nThrough collaboration across Product, Engineering, Customer Success, and Data teams, we're building a culture where customer usage data drives growth. This directly supports customer-focused innovation (\nObjective 3\n) by providing visibility into actual feature usage, helping teams identify pain points and prioritize development based on user behavior rather than assumptions. Our instrumentation creates a continuous feedback loop between customer usage and product development.\nGuiding principles\nThe key thesis of our group is that providing more visibility into how GitLab is used allows us to make better decisions which lead to better business outcomes for ourselves and our customers. In order to build the best DevOps product we can and provide the most value for our customers, we need to collect and analyze usage data across the entire platform to investigate trends, patterns, and opportunities. Insights generated from instrumentation enable GitLab to identify the best place to invest time and resources, which categories to push to maturity faster, where our UI experience can be improved, and how product changes effect the business.\nWe understand that usage tracking is a sensitive subject, and we respect and acknowledge our customers' concerns around what we track, how we track it, and what we use it for. We will always be transparent about what we track and how we track it. In line with our company's value of\ntransparency\n, and our\ncommitment to individual user privacy\n, our tracking source code and documentation will always be public.\nAs we build solutions for GitLab and our users to instrument their apps, aspects we will focus on are:\nProviding infrastructure and tools that enable teams to efficiently instrument with minimal support.\nEnsuring that the infrastructure we provide covers all relevant use cases across GitLab.\nEnsuring high instrumentation coverage across features to enable comprehensive insights.\nEnsuring the accuracy and reliability of the data we collect, so it can be trusted for decision-making.\nAdhering to legal and privacy policies to ensure compliance and protect user privacy.\nEnsuring that the data we collect can be transformed into actionable insights, enabling meaningful outcomes. This includes supporting data unification efforts, ensuring compatibility with downstream systems, and finding ways to directly report on the collected data.\nRoadmap (As of 2025-06-30)\nð´\nNot Started\nâ Work has not yet begun on this goal or initiative.\nð\nIn Progress\nâ Work is actively being done on this goal or initiative, but it's not yet complete.\nð¡\nUnder Review\nâ Work is complete or near completion, and is currently being evaluated for quality, impact, or alignment with goals.\nðµ\nImplemented\nâ The solution or feature has been developed and deployed, but it may still need further improvements or refinements.\nð¢\nAdopted\nâ The solution or approach has been implemented successfully and is now being used by the team or organization.\nâ¤ï¸\nOptimized\nâ The solution has been fully integrated, refined, and optimized for maximum efficiency and effectiveness.\nTop Goals\nEpic\nCurrent Status\nFY26 Target\nMid Term Target\nBroaden instrumentation support/Cover all use cases:\nteams within GitLab are able to instrument using internal events irrespective of their use case\nhttps://gitlab.com/groups/gitlab-org/-/epics/18240\nðµ Implemented\nð¢ Adopted\nâ¤ï¸ Optimized\nData quality:\nEnsure the accuracy and reliability of the data we collect for trusted decision-making. Adhering to legal and privacy policies to ensure compliance and protect user privacy\nhttps://gitlab.com/groups/gitlab-org/-/epics/18243\nð  In Progress\nðµ Implemented\nð¢ Adopted\nDeepen Instrumentation adoption/Instrumentation coverage:\nEnsure all our categories have instrumentation\nhttps://gitlab.com/groups/gitlab-org/analytics-section/analytics-instrumentation/-/epics/6\nð\nIn Progress\nð¡\nUnder Review\nð¢\nAdopted\nEasy instrumentation:\nProviding infrastructure and tools that enable teams to efficiently instrument with minimal support\nhttps://gitlab.com/groups/gitlab-org/-/epics/10700\nð¢ Adopted\nð¢ Adopted\nâ¤ï¸ Optimized\nData to Insights:\nEnsure the data we collect can be effectively transformed into actionable insights by our internal teams and customers\nÂ\nðµ Implemented\nð¢ Adopted\nâ¤ï¸ Optimized\nEvolution of analytics instrumentation\nIn this\nGitLab Unfiltered video\nNiko is talking about the groups's approach to Analytics Instrumentation tools improvements and evolution\nPersonas that we work with\nA key aspect of aligning on our direction is understanding who we are building for. This allows us to best understand the problems they may have and the context that they will be approaching our offerings with.\nProduct groups within GitLab\nProduct\ngroups\nwithin GitLab consist of a Product Manager, Engineering Manager, engineers, and other stable counterparts. These groups implement new features in GitLab and want to understand how users interact with those features.\nThese teams have understanding of how the GitLab code base works as it relates to their features, but not necessarily how the instrumentation APIs and architecture work. They are not necessarily aware of the end-to-end story about how information flows from when a user clicks a button to a result being shown in Sisense or a report.\nThese product groups are our primary customer that we are serving and developing solutions for.\nProduct Manager personas\nConsider reading more about\nParker\n, our Product Manager persona.\nProduct Managers within these groups will have an understanding of how their group's features work from a user perspective, the problem those features solve, and what sorts of actions result in a user \"succeeding\" at the\njob to be done\n, and have growth and usage goals for that feature. They will be able to describe a user journey and key points that should be instrumented along that journey to measure success or need for improvement. They will not necessarily understand what the underlying code for the feature looks like or how all the technology pieces fit together. They need to be able to easily understand which kinds of tracking are available and how they are differentiated to be able to understand the resulting data.\nIf they find it difficult to add the instrumentation they want, they will instead rely solely on qualitiative analysis, such as direct user conversations, rather than a blend of both qualititative and quantitative analysis.\nEngineer personas\nConsider reading more about\nSasha\n, our Software Developer persona.\nEngineers within these groups will have an understanding of how GitLab is built and run but likely are not familiar with the product instrumentation architecture nor APIs. They heavily rely on documentation, examples, and previous MRs to add instrumentation that their PM requests. When they are unable to self-serve, they will ask the Analytics Instrumentation group for help or give up.\nThis persona relies on what we provide to them, which means it is critical for us to keep examples up to date and have clear guidance around deprecated APIs so that engineers use our newer, preferred APIs instead of older ones.\nGitLab Data program\nThe GitLab\ndata program\nis responsible for surfacing data and data-driven insights to the business. They have expertise in building data pipelines, models, and managing data once collected.\nThey are not necessarily familiar with the GitLab code base and rely on product groups to add instrumentation for new metrics or update existing ones.\nThey rely on Analytics Instrumentation to effectively collect and send data to Snowflake, which is their main interface with the data.\nCustomer success\nCustomer Success team members play a crucial role in partnering with clients to ensure they realize the full value of GitLab's offerings. Although they are experts in customer engagement and optimizing the GitLab experience, they may not have deep knowledge of the productâs instrumentation details. They rely on the Analytics Instrumentation group to help them easily find the relevant metrics and data for features and capabilities and to provide guidance and support on implementing missing instrumentation where needed. Effective support hinges on our ability to assist them in accessing the metrics they need and offering clear, actionable guidance for incorporating necessary instrumentation.\nExternal GitLab users\nExternal GitLab users are a broad category of individuals with different needs and who have different skill sets. These users may be interested in reading about what data we collect and how to interact with it. In the future, external users will use the application instrumentation SDKs our group provides to be able to instrument their own apps.\nExternal users rely on our handbook pages and sites like\nmetrics.gitlab.com\nto understand what data is collected from their GitLab use, how to view it, and how to interact with it. If they are unable to get clear answers to their questions, they become frustrated. In that case, they may reach out to their account manager to help them, post on a forum, or stop using GitLab.\nExternal users will use the application instrumentation SDKs we provide to instrument their apps. These teams will be similar to our own product groups within GitLab. That is, PMs will understand user journeys about their features, developers will understand how their own app is built, but neither will be familiar with our instrumentation SDKs. They will rely heavily on our documentation and examples or else they will give up and do something else.\nChallenges we face in Analytics Instrumentation\nGitLab's\nsingle application approach to DevOps\ncreates a product that is both wide and deep, encompassing a large collection of features used by many teams within an organization, which are composed of different types of users.\nThat depth/breadth makes it exceedingly complex to properly map out and understand how our diverse customer set is using the product and gaining value.\nWe currently are unable to provide GitLab the required data to identify opportunities and make the right decisions against them.\nGitLab's MVC approach to product development introduces frequent changes to the product stages and what data is available, making historical trend analysis difficult.\nThere are more and more supplementary applications outside of the GitLab instance, such as the\nAI gateway\n, that need their own instrumentation setup to get a full picture of product usage.\nOur opinion on automated tracking\nIt is a valid question to ask why analytics instrumentation can not be automated to a high extent by automatically tracking API hits based on the URL or button clicks in the UI.\nWhile this would be the most usable solution, as it does not require any manual instrumentation, it is neither scalable nor manageable or adaptable:\nIt would multiply the amount of events we receive, which would affect the effort needed for event processing. Querying the useful events will become slower and/or more costly due to the high amount of unneeded events. This can impact the reliability of the system as well.\nIt increases the likelihood of personal data unintentionally leaking into event collection as API request parameters or button texts are collected.\nIt is not clear which events are useful and which are not since there is no intent behind tracking a specific event. The same user interaction could be tracked through multiple automated events, like a UI click or an API hit.\nIt does not obviate the need for instrumentation, since not all events can be automatically tracked, such as the results of an asynchronous computation.\nIt creates a dependency between feature code and analytics code since automatic tracking by definition depends on implementation details such as the URI of an API call or the CSS selector of a button. This can lead to a resistance to feature changes since they could break tracking. Analytics instrumentation aims to benefit future feature development not hinder it.\nInstrumentation should be easy as possible while still clearly documenting the intent to track a specific behavior and getting out of the way of feature changes.\nHow We Work\nFor more information on Analytics Instrumentation, you can checkout our\nAnalytics Instrumentation Guide\nwhich details a\nhigh-level overview of how we make data usable\n, the\nCollection Frameworks\nwe leverage, our\nMetrics Dictionary\n, and much more!\nWorking Groups and Cross-Functional Initiatives\nAnalytics Instrumentation provides the necessary frameworks, tooling, and expertise to help us build a better GitLab. Naturally we sit in the middle of many projects, initiatives and OKRs at GitLab. In order to provide clarity and realistic expectations to our stakeholders and customers we practice relentless prioritization (\nper Product Principle #6\n), identifying what is above the line, what is below, and what is unfunded and not possible for us to action on in a given timeline.\nThis table lists recurring activities that are part of\nworking groups and cross-functional initiatives\n.\nActivity\nCadence\nType\nTeams Involved\nGTM Product Usage Data Working Group\nWeekly\nSync\nFulfillment PMs, Analytics Instrumentation, Data, Customer Success, Sales\nData & Analytics Program for R&D Teams\nEvery 2 Weeks\nSync\nFulfillment PMs, Analytics Instrumentation, Growth, Data\nProduct ARR Drivers Sync\nMonthly\nSync\nCustomer Success, Sales, Product Leadership\nClickHouse Datastore\nWeekly\nSync\nMultiple\nQuick Links\nResource\nDescription\nInternal Analytics Docs\nAn implementation guide for Usage Ping\nMetrics Dictionary\nA SSoT for all collected metrics from Usage Ping\nPrivacy Policy\nOur privacy policy outlining what data we collect and how we handle it\nImplementing Product Performance Indicators\nThe workflow for putting product performance indicators in place\nAnalytics Instrumentation Development Process\nThe development process for the Analytics Instrumentation groups\nProject resposibilities\nList of several projects that our group is the DRI for\nIncident Reporting\nAnalytics instrumentation specific incident reporting process\nTechnical Roadmap FY25/FY26\nThe\ntechnical roadmap\nfor Analytics instrumentation.\nEdit this page\nView source",
  "html_file": "22500b3bf8e41398.html"
}