{
  "url": "https://about.gitlab.com/direction/tenant_scale",
  "title": "Product Stage Direction - Tenant Scale\n|\nGitLab",
  "headings": [
    "Product Stage Direction - Tenant Scale",
    "Tenant Scale Section"
  ],
  "text": "Product Stage Direction - Tenant Scale\n|\nGitLab\nProduct Stage Direction - Tenant Scale\nMaintained by\n:\nYou are here:\nGitLab Direction\nProduct Stage Direction - Tenant Scale\nMaintained by\n:\nThe following page may contain information related to upcoming products, features and functionality. It is important to note that the information presented is for informational purposes only, so please do not rely on the information for purchasing or planning purposes. Just like with all projects, the items mentioned on the page are subject to change or delay, and the development, release, and timing of any products, features or functionality remain at the sole discretion of GitLab Inc.\nTenant Scale Section\nMission\nLast reviewed: 2024-11-26\nTenant Scale Section\nThe Tenant Scale section is responsible for the features and tools our customers use to operate GitLab at scale. We offer regional scalability, multi-tenant operations for GitLab.com, and the ability for top level organizational management.\nThe Tenant Scale section is made up of three groups:\nGeo\n- Disaster recovery and worldwide performance\nOrganizations\n- Delivering top level management for customer instances\nCells Infrastructure\n- Delivering a scalable multi-tenant framework to scale GitLab's SaaS offerings.\nMission\nGitLab can be easily scaled to meet the demands of the users.\nTenant Scale provides a framework which allows GitLab to scale in order to meet the business demands of our customers. We enable both multi- and single-tenant GitLab platforms to be easy to administer, easy to migrate, and easy to grow to meet demands. Our focus is on ensuring that, no matter which GitLab offering (self-managed, Dedicated, GitLab.com) is being used, native and intuitive tooling exists which allows for scaling and configuring the instance.\nWe're aiming for a world where a self-managed customer can easily create a geographical dissimilar secondary site from within GitLab, where a GitLab.com customer can migrate seamlessly to our Dedicated offering, and where organizations can create an instance in a specific region. While we may not yet be able to do these things, we're working towards them with a clear vision and focus.\nEdit this page\nView source",
  "html_file": "76bf9106ee67fd22.html"
}