{
  "url": "https://about.gitlab.com/direction/foundations",
  "title": "Product Stage Direction - Foundations\n|\nGitLab",
  "headings": [
    "Product Stage Direction - Foundations",
    "On this page",
    "Vision",
    "Groups",
    "Stage Themes",
    "1 Year Plan",
    "Target audience",
    "Metrics",
    "How we operate",
    "Categories",
    "Pricing",
    "Upcoming Releases",
    "Other Interesting Items"
  ],
  "text": "Product Stage Direction - Foundations\n|\nGitLab\nProduct Stage Direction - Foundations\nMaintained by\n:\nG\nContribute to this page\nEdit this page\nYou are here:\nGitLab Direction\nProduct Stage Direction - Foundations\nThe following page may contain information related to upcoming products, features and functionality. It is important to note that the information presented is for informational purposes only, so please do not rely on the information for purchasing or planning purposes. Just like with all projects, the items mentioned on the page are subject to change or delay, and the development, release, and timing of any products, features or functionality remain at the sole discretion of GitLab Inc.\nOn this page\nVision\nGroups\nStage Themes\nDrive Adoption\nSecurity and Compliance\nHelp Customers Deliver Faster\nImprove SUS (System Usability Score)\n3 Year Strategy\n1 Year Plan\nImport and Integrate\nPersonal productivity\nTarget audience\nToday\nMetrics\nHow we operate\nIterate on the essential\nMeasure what matters\nGreat team\nCategories\nImporters\nNotifications\nNavigation\nSettings\nGitLab Documentation Site\nPajamas Design System\nGlobal Search\nCode Search\nPricing\nUpcoming Releases\n18.4 (2025-09-18)\nOther Interesting Items\nVision\nFoundations helps enterprise customers setup and adopt GitLab quickly, efficiently and securely.\nThe Foundations Stage is at the core of the GitLab platform. It is a glue that spans across different stages and enables our customers to setup and adopt GitLab by providing a frictionless\nImport\nexperience to bring your applications into GitLab,\nIntegrations\nwith your ecosystem and an intuitive and effective\nNavigation\nsystem.\nGroups\nThe Foundations stage is made up of four groups. You can find the direction pages of these groups here:\nImport and Integrate\nPersonal productivity\nDesign System\nUX Paper Cuts\nThe existing team members for the Foundations Stage can be found under the links below:\nImport and Integrate\nPersonal productivity\nDesign System\nUX Paper Cuts\nStage Themes\nDrive Adoption\nAligning with\nCore Platform section\ntheme\n\"GitLab is easy to deploy and adopt\"\n, the foundations stage will aim to drive adoption of GitLab through a faster & smoother onboarding process. Our onboarding process will support our customers needs for lower downtime & improved reliability of importers. This will increase number of customers who onboard to GitLab as well as reduce the time it takes to onboard, increasing overall adoption of GitLab.\n`- We will prioritize enhancing the experience for enterprise customers by developing tools that improve business continuity, reduce downtime, provide easy-to-understand error messages, and ensure reliable data migration. For instance, \"Import Evaluation Tool\" can be run before the migration and will help customers understand how long will migration take, what can and cannot be migrated, and possibly even suggest \"migration waves\" to break down a huge import into several chunks. This feature in combination with faster import reduces the downtime and allows flexibility to work through migration in off-hours improving business continuity\nOur goal is to enhance collaboration and productivity by creating integrations that help customers get more out of their GitLab experience. For example, rather than manually updating Jira ticket status upon code merge, GitLab for\nJira integration\nautomates this process. This removes redundancy and saves up to 30 minutes per day of the development time per developer.\nCustomers will be able to customize & extend GitLab for their unique needs by using APIs and Webhooks. For instance, an internal process can be run by utilizing webhook that triggers the\nevent on pipeline status change\n.\nSecurity and Compliance\nTypically, an enterprise will have a security team, DevOps teams, and an internal compliance officer. They collectively try to understand how the product in the organization is being delivered and have manual processes to examine compliance. By automating some of these tasks, we can accelerate the time to delivery for our customers and reduce the cost of compliance. For instance, security standards & best practices defined at project, group or organization level could be applied automatically to detect if the code merged is compliant or not. Additional security measures could be applied to prevent the branch from being merged if a certain level of compliance is not met. This DevOps automation could be applied to organization-specific, industry-specific ( e.g.\nPCI-DSS\n), or government-related ( e.g.\nGDPR\n) regulations to increase operational efficiency and bake in security as part of the development lifecycle.\nHelp Customers Deliver Faster\nThe Foundations stage is uniquely positioned to minimize the time it takes for our customers to deliver throughout the DevSecOps life cycle. We will help our customers deliver faster by\nMaking it easier for everyone to contribute.\nFor instance, build modular & easy to plug-and-play infrastructure for “onboarding”. This will accelerate process of maturing onboarding platform by increasing the number of 3rd party tools we can migrate from while improving maintainability. In the future, importing from Jenkins, GitHub Actions and Jira can be easily added by introducing field mapping from respective tools to GitLab. This will make it easier for community, partners & internal teams to contribute and help customers deliver faster.\nReducing the time taken to complete your day-to-day tasks in GitLab. Here are few use-cases:\nFor a system admin, Setting up approvers or changing Jira integration settings by improving the usability & accessibility of Settings.\nFor a product manager or developer, to access issues or MRs using Pinning.\nUsing AI to automate workflows. For instance, suggest fixes for vulnerability finds, build automated test cases to speed up the development process, execute those test cases async & even create issues and suggests fixes for bugs found.\nImprove SUS (System Usability Score)\nThis theme is directly aligned with\n\"World Class DevSecOps experience\"\n. The foundations stage spans across different stages of the DevSecOps lifecycle. Our goal is to improve the overall user experience by improving the usability & accessibility of GitLab with our continued efforts on\ndesign system adoption\n&\nnew and improved navigation\n. We will continue to make it easier for our users to find what they are looking for, to pick up where they left off, and to orient them in GitLab. For instance, If you're a System Admin who updates MR settings annually (such as merging only on a successful pipeline or with approval from 2+ reviewers), we aim to simplify the process. No need to recall previous actions or sift through notes.\n3 Year Strategy\nIn three years, we expect :\nOnboarding to Gitlab from other platforms (such as GitHub, Bitbucket) to SaaS/Dedicated will be predictable & 80% faster than in FY23.\nOnboarding journey will cover wider use-cases than importing groups & projects to support customers in getting the most out of their GitLab instance. For instance, importing Github Actions and Jira issues.\nTo integrate with third-party tools that are consistent with the\nvision of AllOps\nplatform, ensuring that they complement the DevSecOps journey and promote collaboration. Notably, tools such as Jira, Slack, and ServiceNow will be integrated in alignment with our overarching one-platform strategy.\nSystem administrators will have Enterprise User management tools for easy, secure, and automated user lifecycle management, minimizing the need for manual work. For instance, Automated off-boarding processes we introduce aim to reduce risk of unauthorized access, data loss and security exposures.\nTo improve learnability & reduce cognitive load on users through intuitive, easy-to-use, and accessible Navigation.\nArtificial Intelligence will increase automation and make it easier and faster for users to manage their DevSecOps tasks. For instance, a personal assistant for the devOps team that automates the test cases for the code, determines the test coverage and suggests ways to improve it.\n1 Year Plan\nImport and Integrate\nPersonal productivity\nThe Personal productivity team will continue to build cross-stage UIs and user workflows that should be consistent, clearly designed, and iterated on like a feature to improve the overall user experience of GitLab. In rest of the FY24 and FY25, we will work on\nEnhancing the navigation experience of the super sidebar.\nContinue to build consistent user experience across GitLab by increasing Pajamas adoption.\nEnable Dark Mode as color theme in New Navigation\nContinue to enhance the design system with the goal of improving overall SUS\nImprove usability of Settings\nBuild The Message Center for personalized notifications to the users.\nTarget audience\nGitLab identifies who our DevSecOps application is built for utilizing the following categorization. We list our view of who we will support when in priority order.\n🟩 - Targeted with strong support\n🟨 - Targeted but incomplete support\n⬜️ - Not targeted but might find value\nToday\n🟩\nCompliance Managers\n🟩\nSystems Administrator\n🟨\nApplication Ops\n🟨\nPlatform Engineer\n🟩\nSoftware Developers\n🟩\nDevelopment Team Leads\n🟨\nApplication Development Director\n⬜️\nProduct Managers\n⬜️\nSoftware Engineer in Test\n⬜️\nProduct Designers\n🟨\nDevOps Engineers\n🟨\nSecurity Operations Engineers\n🟩\nSecurity Analysts\n🟨\nRelease Manager\nMetrics\nManage uses\nStage MAU\nas a primary measure of success. This represents the unique number of users getting value from the stage; all groups should be able to contribute to improving this number.\nIndividual groups track progress against a number of group-specific\nperformance indicators\nAll links are to the internal handbook\n:\nGroup\nDashboard URL\nImport\nMAU importing\nIntegrations\nGMAU - MAU for Jira and Slack Integrations\nPersonal productivity\nPercentage views on New Nav vs. Old Nav\nHow we operate\nManage operates under GitLab's values, but is a stage that seeks to particularly excel in certain areas that support our goals above. We seek to be leaders at GitLab by:\nIterate on the essential\nLeading the way on iteration, regularly shooting for small but ambitious MVCs.\nSupporting iteration with a great planning and development process, giving us checkpoints to keep issues small and incremental. As a result, our throughput is high.\nValuing the 1-year themes above, and deliberately deciding to not pursue initiatives that don’t support our 2020 goals. We'd rather do a few things well than a bunch of things poorly.\nPrioritizing depth over breadth. For the most part, we’re biased toward doubling down and investing on what’s working rather than extending the breadth of our stage.\nMeasure what matters\nPrioritizing instrumentation through our North Star dashboards, which we regularly monitor to keep our priorities in check.\nMeasuring business value by tying customer delight and revenue to our priorities.\nGreat team\nAspiring to be the happiest team at GitLab, with high individual job satisfaction.\nHaving great work-life balance, ensuring that we\nvalue friends and family above work\nand avoid individual burnout.\nCategories\nImporters\nImport existing work into GitLab from a wide variety of sources.\nPriority: high •\nDocumentation\n•\nDirection\nNotifications\nWeb and email notifications\nDocumentation\n•\nDirection\nNavigation\nHow users move through the product\nDirection\nSettings\nSettings encompasses all configuration interfaces across GitLab that allow users to customize and manage their GitLab experience, including project settings, group settings, user profiles, admin configurations, and system-wide controls. Settings-related issues typically involve users having difficulty finding, accessing, or modifying configuration options, or experiencing problems with settings inheritance and permissions.\nDirection\nGitLab Documentation Site\nImprove and maintain the features, style, and build process for the GitLab Documentation website.\nPriority: medium •\nDocumentation\n•\nDirection\nPajamas Design System\nGitLab's design system called Pajamas. Used internally to power GitLab in order to improve user interface consistency and accessibility.\nDocumentation\n•\nDirection\nGlobal Search\nGlobal Search is made up of two primary experiences, Basic Search and Advanced Search.\nBasic Search is the default search experience for self-managed users as well as Free users of GitLab.com. It provides a way to search across the DevOps platform. Basic search includes Code Search for one project.\nAdvanced Search, in GitLab Premium and above, is an optional feature that uses Elasticsearch to enable additional search features for sorting, filtering, and improved relevancy.\nThis category is at the \"complete\" level of maturity.\nDocumentation\n•\nDirection\nCode Search\nCode Search gives users the ability to explore all their code. Code searches are a significated portion of searches run by users, and Code Search is a fundamental need for organizations with complex or large amounts of code and multiple repositories.\nThis category is at the \"complete\" level of maturity.\nDocumentation\n•\nDirection\nPricing\nThe Foundations stage has several features that enable users to quickly get started with using GitLab. These features are available in Core and are Free. However, as we move into specific use-cases for Enterprise customers that need to manage their GitLab organization at scale, features will be introduced into paid tiers as well and are intended to drive\ncompany-level financial goals\n.\nFull list of features by tier under Foundations stage are\nhere\nUpcoming Releases\n18.4 (2025-09-18)\nDirect Transfer General Availability\nOther Interesting Items\nThere are a number of other issues that we've identified as being interesting\nthat we are potentially thinking about, but do not currently have planned by\nsetting a milestone for delivery. Some are good ideas we want to do, but don't\nyet know when; some we may never get around to, some may be replaced by another\nidea, and some are just waiting for that right spark of inspiration to turn\nthem into something special.\nRemember that at GitLab, everyone can contribute! This is one of our\nfundamental values and something we truly believe in, so if you have\nfeedback on any of these items you're more than welcome to jump into\nthe discussion. Our vision and product are truly something we build\ntogether!\nHow to add support for AWS SNS service?\nNew contributors graph (lines of code)\nInclude rake task for testing mail sending\nLibreJS compatibility\nChoose behavior by default for filtering Merge Requests and Issues\nImprove the\nMember\nAPI entity to take actual\nMember\nobjects instead of\nUser\nGetting started - Better empty state for Activity tab\nMissing validation information in api docs\nClarify Drone CI error message based on configuration setting\nImprove Usage Data Ping\nSuper obvious, customizable project documentation link\nRemove frontend API class from global namespace\nMigrate all methods of frontend API class to Promises\nProvide complete safe current user entity to frontend\nThumbs up/down emoji is not aligned\nImprove support for Unity3D / 3D Development with different features\nReserved words in PathRegex should not include word that don't match\nPATH_REGEX_STR\nFollow-up from \"Allow pulling container images using personal access tokens\"\nUsage ping for Integrations\nSee for which issues on issueboard you have an open Todo\nCover the\nOmniauthCallbacksController\nwith controller tests.\nImprove projects controller specs\nGroup selection broken on Bitbucket import page\nDon't show quoted text in user activity feed\nDocument SourceTree flow\nImplement social buttons for GitLab\nEnterprise Edition Add-on - IP Restrict for SSH Keys\nAdd debouncing to Select2\nRename CSS classes related to lazy loading\nAdvance backup keep options\nRrefactor LDAP logins to use Users::CreateService\nGuideline for passing single objects from backend to frontend (current user, current project, …)\nMore options for landing page of project\nAdd heartbeat to import jobs to avoid timeout if the job is still working\nRemove Lodash Templates for Consistency\nbackups folder not accessible although backup permissions are set to 0644\nShouldn't the PUT API requests respect the \"If-Unmodified-Since\" header?\nAllow a read_user token to access instance version API\nSystem checks should verify\ndb/schema.rb\nis writable\nFollow-up from \"Add new API endpoint - get a namespace by ID\"\nGitlab omnibus backup not working for AWS\nTest specific service configuration via the API\nImprove test coverage calculation for .vue files\nConsider excluding mounting points from test coverage\nGitlab Should Have a Web App Manifest\nUse Netflix's fast_jsonapi gem instead of oj\nGroup and Project wide page with secrets which can be shared among team members\ncan't send email over http(s) proxy\nUI/UX: terrible experience in project settings due to expanding/collapsing sections\nCreate command to capture resources usage for each GitLab component\nUse axios mock adapter where request object is needed\nCreation / Retrieval of PRIVATE-TOKEN for further automation after chart completes\nAdd confirmation input component for use in modals\n[Allow\nto contain the corresponding input](https://gitlab.com/gitlab-org/gitlab/-/issues/21371)\nFollow-up from \"OmniauthInitializer created to allow testing/refactoring of code from devise.rb\"\nAdd parameters to v-tooltip directive\nDocument how to use $options for constants in Vue components\nAdd slot to loading button component to support icon buttons\nCreate GitLab Ribbon / Badge\nUse axios MockAdapter history in JavaScript tests\nUpdate AccessLevel tables: (remove timestamps, create index on group_id and use on_delete: :cascade instead of dependent: :destroy)\nRedesign GitLab's Permission Allocation Process\nDecline flow of accepting terms of service\nAdd support to restore backup from a URI - local or remote\nAvoid using\n@user\nin authenticates_with_two_factor.rb and\ndevise/sessions/two_factor.html.haml\nUnify\nset_remember_me\napproaches for LDAP and OAuth\nCentralized user preferences/settings\nMattermost XMPP username and password\nAdd Write / Preview to Terms of Service like in Issues and other places\nChanging the Terms of service should have option to reinforce user confirmation\nconfigurable header / footer links for GDPR (DSVGO) compliance of self hosted gitlabs\nAdd configuration options for privacy-aware reduced/disabled logging\nBetter user information for scheduled server downtimes\nBetter customization to help users get started on new projects\nAdd issue metrics to import/export (make it consistent with MR metrics)\nRestore does very little validate before unpacking backup\nShould download dropdown have search box?\nReduce duplication in Application Settings frontend\nSystem hook event_type vs. event_name\nSystem messages: Support customized colors?\nCircuit breakers on misconfiguration\nInstall From Source Failing on OSX\nGPG: Automatically fetch keys using Web Key Directory protocol\nImprove 404 returned when linking to a deleted directory\nSupport emailless sing-up and signin\nRate limiting - notify user via email\nRemoving the \"Fluid\" preferences option\nDo not remove old backups on upgrade\nadd gitlab:backup:create ONLY option\nSlack service integration API should support \"confidential_note_channel\" parameter\nReimplement protected tags/branches/environments settings panel into Vue component\nConsolidate UI page widths - Part 01: Repository\n[meta] Backup/Restore improvements\nDifferenciate Web- and Cloneurl\nRepositoryCheck::ClearWorker is too aggressive\nConsolidate UI page widths - Part 02: Issues\nConsolidate UI page widths - Part 03: Snippets\nConsolidate UI page widths - Part 05: Wiki\nConsolidate UI page widths - Part 04: CI/CD\nConsolidate UI page widths - Part 07: Project settings\nConsolidate UI page widths - Part 08: Operations\nExtended user centric tooltips: Backend\nImprove error message when uploading a license with a trueup\nConsolidate UI page widths - Part 01: Repository (EE version)\nDisable / Suppress GitLab sending Emails\nImprove error when destroying a project and the +deleted path already exists on disk\nGravatar fallback for airgapped environments\nSending Messages to Users\nPlease add CI tests for installations where gravatar is disabled\nSupport installation-specific integrations\nImport Project - Editing recommended repository name isn't persisted\nAdmin user Personal Access token without admin credentials.\nSign in page replaces the current page instead of being added in the history\nProtocol Agnostic and relative badge-urls.\nAdd visual regression testing to frontend testing guidelines\nAdd different types of mocking to frontend testing guidelines\nMerge Vue testing guidelines into frontend testing guide\nAdd section about view specs to frontend testing guide\nExisting user connect account for cas3\nIs a merge a push event\nPermissions can affect navigation hierarchy (potential for discovery)\nFollow-up from \"Add documentation about frontend test categories to frontend guide\"\nMinimize network roundtrip in PersonalAccessToken#redis_getdel and make it more reliable\nImpersonationTokens / PersonalAccessTokens should not be created via PersonalAccessTokensFinder\nConsole log a link to GitLab's jobs page on GitLab.com\nAdd common Vue plugins to describeComponent wrapper\nDocs feedback: Add link to gitlab.com's SSH host key fingerprints on the page about adding SSH keys to a gitlab account\nDocs feedback: Please document default values\nManage: Product discovery issues open for scheduling\nMake errors due to gitlab-secrets.json missing/regenerated more evident.\nAllow\nallow_local_requests_from_hooks_and_services\nto be set via API\nDocs feedback: fast lookup of ssh keys in database\nPossible improvement of JWT authentication\nRake task for moving repositories to new storage\nSSH API\nAdd option to rate limit SSH requests\nProject Level Banner Message\nImprove project moved notification email\nAdd a way to link to the deploy key section in the Settings\nNew setting to disable overriding the email sender's name with the author when sending email notifications\nToggle Gitlab features and functionality on and off\nIncrease Cache-Control for avatars which are delivered from GitLab\nCustom Templates configuration behavior in Gitlab-ee Starter level is confusing\nBitbucket remote password is stored in clear text when importing poject\nConfigure only an\nallowedList\nof\n:params\nto be included in structured logs (confidential notes leaked in production_json.log)\nWith kerberos_enabled enabled the git clone default instructions are missing the git user\nIntegrate flipper-ui\nCreate ruby upgrade guide when moving to a new version\nEmbed cookie feature/canary toggle in product\nInclude EE-specific frontend files in generated JSDoc\nOld images/attachments not working\nImprove settings pages design by prioritizing content: Conditional features follow-up\nUpdate existing flash messages and introduce Bootstrap callout style\nAllow for customize of Submit Feedback link\nSearchFilesByContent is taking 30-60 s to complete\nAdd note to Netlify templates that they only work with gitlab.com hosting\nOffer a more reliable and secure API calling method\nallow cidr for rack_attack ip_whitelist\nImprove empty states within sidebar\nLinks in issuable sidebar do not pass color audit\nMake it more obvious to users that their todo has been marked done as intended\nFollow-up from \"Added write_repository scope for personal access token\"\nDocs feedback: Docs about password length limits only address installation from source. What about Omnibus package?\nAdd tooltips/popouts to column headings in the Admin Area's\nJobs\npage\nAvoid JSDOM where we don't need it in Jest / use node.js environment\nModify Logo for og image preview\nShould we refactor to have Ruby objects for project services ?\nAdmin Page to list/remove Rack Attack blocks\nActiveRecord::QueryCanceled: PG::QueryCanceled: ERROR: canceling statement due to statement timeout\nDisable option to upload ssh keys by users in their profile\nMail notification after deletion of Git group\nEnable Content-Security-Policy by default\nMove functionality of GroupMembersController#index into GroupMembersFinder\nReduce HAML duplication in app/views/groups/group_members/index.html.haml\nFollow-up from \"Make it easier to find invited group members\"\nAllow enabling and disabling admin features\nSwap the issues and merge request order on project settings page.\nMake the System header and footer configurable from a config file\nDo not cross reference confidential issues\nsync user history between multiple devices\nReplace spinners with skeleton loader on user > profile.\n500 In /users/auth/openid_connect/callback \"NoMethodError (undefined method `count' for nil:NilClass)\"\nHide or disable group level badges per project\nAdmin Note Prompt\nAdd Organization to the \"Your Projects\" Section.\nAdding user to project using smartphone interface is ridiculously obscure\nLimit items returned to filtered search input\nAdmin page: Move blob rate limiting to \"User IP and Rate Limits\" section\nEasier project member setup\nDon't hide the \"Private\" visibility option when it's disabled\nSlack Notification API property fields location mismatch between GET/PUT\nSlack Notification Service API fields commit_events, job_events missing from WebUI\nSlack Notification Service API GET does not return set value for channel\nSlack Notification Service API documentation missing GET fields\nBetter indicate to users that their changes have not been saved\nGitlab Groups API - List all members of group –> List also user's email address(primary at least)\nUsernames should have a shorter length limit\nAdd controller and action to logs when ETag cache is hit\nCustom HTML snippet via Admin UI\nFollow-up from \"Group Import API endpoint\"\nDocs feedback: Todo APIs Page\nUse consistent styling to display shortcuts in GitLab\nAdd closing button for\nAuto DevOps pipeline is enabled\nmessage\nAllow setting of custom pagination sizes\nRefactor Bitbucket Importer\nWebpack memory usage increasing\nAbility to Give a reason for Denying a User Access Request\nDocs feedback: Issue / Epics / Merge request events notification table blank \"sent to\" needs clarification\nImprove Documentation / Process of Adding HAML Lint Exclusions\nServerside Rendering of Vue components\nFrequently blocked during deploys (Persisted in redis, but not rack attack??)\nBetter grouping and organization of long strings of metadata\nStart v5 API\nNo \"/explore\" link on start page anymore\nLint for unused frontend dependencies\nReplace blacklist/whitelist in doc//development/import_export.md\nMirror importing by URL should not wait on request without credentials\nUpdate Import/Export development docs to mention which tests need updates when adding new relations\nConsider merging window.location jest mock helpers\nDocs feedback: No api docs on import by url\nProvide a way to customize the new user dashboard/post-login welcome to gitlab page\nUpdate props for GlRadio and GlCheck Groups\nEvery Settings API parameter should link to documentation about that setting\nDocs - product feedback: Add details on how to clone/push import for projects that time out\nDiscovery: Provide way to make all form components contribute to form data (e.g., like readonly, not disabled)\nExpose user email address to admins in group and project members API\nTabs > HAML > Migrate app/views/shared/_event_filter.html.haml to GlTabs\nTabs > HAML > Migrate app/views/projects/merge_requests/creations/_new_submit.html.haml & app/views/projects/merge_requests/_page.html.haml to GlTabs\nIs there a way to move a group to become a subgroup of a different group in the gitlab python api?\nGraphQL: Avoid ConnectionType gotchas\nURL strings are different from UI description\nImprove New Project performance from 1.2s for first render\nConsider bootstrap.native as an alternative to jQuery-based bootstrap library\nConvert stylesheets/pages/events.scss into page specific bundle\nConvert stylesheets/pages/settings.scss into page specific bundle\nMove Custom notification settings modal to JS\nAudit usage of link variant in app/assets/javascripts/design_management/components/design_notes/toggle_replies_widget.vue\nAudit usage of link variant in app/assets/javascripts/repository/components/table/index.vue\nNavigate to recently viewed, frequently viewed, or starred groups, projects, and issues\nProject Import missing some data\nUnable to upload a project import of more than 50mb to Gitlab.com\nStandardise return values for GraphQL destroy mutations\nAdd NOT NULL constraint validation migration for GroupImportState model\nContinue to improve performance of Advanced Search Web Controllers\nReplace bootstrap dropdown in app/views/dashboard/todos/index.html.haml\nReplace bootstrap dropdown in app/views/shared/_mobile_clone_panel.html.haml\nReplace bootstrap dropdown in app/views/shared/projects/_dropdown.html.haml\nDocumentation doesn't tell how to add a Github Organization\nUse consistent pluralisation for Issue model namespacing\nWhen importing projects with LFS, warn users if LFS is disabled\nExploration on standardizing patterns used for Settings UI\nConsider converting HAML user callouts/alerts to Vue\nAllow Broadcast Messages to target URLs with URL parameters\nEnforce parameter types in internal/allowed endpoint\nConsider removing index_mr_metrics_on_target_project_id_merged_at_time_to_merge index\nUser currently has to use bookmarks to keep track of popular projects and locations in large groups.\nEnable user to disable features that aren't needed\nInconsistent UI elements and terminology cause confusion when user tries to access settings.\nAdd guide for analyzing changes to webpack bundles\nReview PHP Community SDK challenges with API breaking changes\nMiddle-class of haproxy rate-limit bypass\nTraffic using a deploy token counts as unauthenticated for rate limiting\nUpdate existing labels to match new colors\nUpdate realtime_changes endpoint to be GraphQL one\nCreate frontend fixture for frozen fixture date\nBulkImports: Add custom ErrorTracker to log to the\nimports.log\nas well\nJetbrains cannot resolve imported javascript spec helper files\nFollow-up from \"Draft: Process one record at a time in Bulk Import pipelines\"\nUse \"Recently visited\" instead of \"Frequently visited\" for Projects & Groups\nInvestigate card styling for graphs in the contributor page\nInvestigate how the concept of the \"GitLab UI Polish Gallery\" might improve the contributor experience\nChange the way webpack compile warnings are surfaced\nMove the project path update field to the same view where the project name can be updated.\nShow group owner's current IP and allow/deny status based on current IP on the \"IP address restriction\" feature\nExpose all project settings in a single JSON-like format\nAllow Markdown bulleted lists in the Group/Project description field\nReduce the amount of duplication across BulkImport codebase\nBulkImports: Rename BulkImports::Tracker to BulkImports::PipelineTracker\nMake Project and Group Settings pages URLs consistent\nCreate a single document for understanding backups on GitLab.com\nRename NamespaceSettings::UpdateService\nExplore better ways to surface \"Settings\" within the left nav\nExplore leftnav layout with \"Settings\" and \"Analytics\" in the submenu\nHelp anyone learn to swiftly navigate GitLab\nUpdate Webpack to next major version (webpack 5)\nAdd group relations export API rate limits\nInvestigate esbuild loader as a drop-in replacement for babel-loader\nData events and visualization for settings search\nDocs feedback: Webhook instructions too specific, should be generic\nA11y action > Design and QA checklists\nA11y action > Consider how to make attachment alt tags more meaningful\nA11y action > Discuss auditing top pages for semantic structure\nA11y action > Explore \"language of parts\" editor capability\nA11y action > Audit external links\nA11y action >Tables lack caption or label\nA11y action > Remove max scale from meta content\nA11y action > Ensure all help links have meaningful aria-labels\nA11y action > Approval settings > Move alert outside of input group label/fields\nA11y action > Audit subset of pages for dynamic loading of content\nA11y action > Ensure our keyboard shortcuts do not interfere with browser or AT shortcuts\nList API parameters alphabetically, with required parameters on top\nPremium\nUltimate\nA11y action > Ensure epic and issue tree drag and drop can be done via keyboard\nAdd optional param to Export API to export a single relation\nDocs - Project Import - Bitbucket -> GitLab\nREST API Responses - link to schemas\nProject Import: Allow remote import download limit to be configurable\nFollow-up from \"Enable Project Import to import from remote object storage [RUN ALL RSPEC] [RUN AS-IF-FOSS]\"\nOther CI platforms (GPU, ARM, TPU, DPU)\nLow margin theme\nAdd file dowload validation to CreateProjectFromRemoteFileService\nProvide an ability to mark GraphQL fields, resolvers and mutations as \"beta\"\nAdd exponential backoff when fetching ndjson relation export status\nGitLab Docs: Jira Integrations Content Update\nAlomaisi\nSAML response email blank when in fact the SAML response does contain the email and mapped with attribute_statements\nHow to handle breaking changes to Jihu in overrides\nCustomize color theme\nDe-Sprite our SVG Icons\nCreate brain activity data set during using GitLab with BMI\nGitLab team become a project maintainer for the jenkinsci/gitlab-plugin\nPremium\n\"Trigger pipelines for mirror updates\" option not visible in import URL\nExtend the Rack::Attack DRY_RUN mode to allow testing new settings before enforcing them\nUX: What should tooltips show with absolute date user setting\nFeature request : Add \"test settings\" button when using default Jira integration\nAPI: Allow setting \"watch\" on projects for groups of users\nMove GitLab UI Rails form builder into its own project/gem\nEnsure that browserslist cannot break CI no more\nDocs feedback: Outdated screenshot on Akismet integration page\nSet default flags on group level\nGitHub CI/CD: build merge_commit_sha\nAdd issue export from group issue overview\nMake project member filter sticky\nThe string \"DayTitle|S\" does not translate well\nChange \"+\" to \"-\" for keyboard combinations\nProvide GraphQL Schema in GraphQL Schema Language\nRe-think webpack memory metrics CI job\nUpdate BulkImports transformers to remove usage of\nthen\nFollow-up from \"Move Mattermost doc from Omnibus to main project\"\nTranslation of the string \"MergeConflict|origin//their changes\"\nValidate import_type on project\nThe use of the letters g and q is barely discernible in the name of the project\nMake incremental webpack compilation work better when running RSpec tests\nEnhance logging in all github import workers on raised exceptions\nMove import rake task classes into a service\nStar/unstar button shows 2 stars and text is untranslated\nWebpack worker paths reset method is disrupting ability to run RSpec tests locally\nTabs > Use unique href for each tab\nDocs feedback - feature proposal: Write your title\nDocumentation for X-GitLab-NotificationReason missing possible values\nissues with labels for red/green color blind\nMake GitLab file based import idempotent\nInvestigate replacing webpack with esbuild\nTimezone pulldown should have more than city names\nFollow-up from \"GithubImporter: Optimize Pull Request MergedBy Importer\"\nFollow-up from \"Make breadcrumb toggle inline\"\nProject > Visibility Settings > CI/CD > Allow users to disable Schedules individually\nManage:Import feature flag cleanup\nFollow-up from \"Add Push Rule to Project Migration\"\nRefactor labels management from HAML to Vue - nav bar component\nConcern duplication ::Gitlab::Import::Metrics vs ::Gitlab::GithubImport::ObjectCounter\nRefactor labels management from HAML to Vue - table component\nRefactor labels management from HAML to Vue - setup group labels Vue app\nRefactor labels management from HAML to Vue - Add\nsubscribed\nargument to GraphQL query\nRefactor labels management from HAML to Vue - Add\ntype\nfield to GraphQL query\nRefactor labels management from HAML to Vue - Add\nsubscribed\nfield to GrahpQL query\nLong file listing kills browsers\nAdd feature spec to test confirmation modal\nAdd tests for attribute whitelist/blacklist for migration\nRemove Issue#readable_by? custom implementation\nGitlab fails because objects/pack folder takes all free space\nChange caching headers from 'no-store'\nSettings Template Repositories for new Projects\nPremium\n[Test] api/1_manage/migration/gitlab_migration_project_spec.rb | Manage Gitlab migration with wiki successfully imports project wiki\napi/1_manage/migration/gitlab_migration_project_spec.rb | Manage Gitlab migration with repository successfully imports repository\n[Test] api/1_manage/migration/gitlab_migration_issue_spec.rb | Manage Gitlab migration with project issues successfully imports issue\n[Test] api/1_manage/migration/gitlab_migration_project_spec.rb | Manage Gitlab migration with uninitialized project successfully imports project\nbrowser_ui/1_manage/login/maintain_log_in_mixed_env_spec.rb | Manage basic user remains logged in when redirected from canary to non-canary node\n[Test] api/1_manage/migration/gitlab_migration_group_spec.rb | Manage Gitlab migration with milestones and badges successfully imports group milestones and badges\n[Test] ee/api/1_manage/migration/gitlab_migration_group_spec.rb | Manage Gitlab migration with EE features imports group epics and iterations\n[Test] ee/api/10_software_supply_chain_security/user/minimal_access_user_spec.rb | Software Supply Chain Security User with minimal access to group is not allowed to commit via the API\napi/1_manage/import_large_github_repo_spec.rb | Manage Project import imports large Github repo via api\n[Test] api/1_manage/import/import_github_repo_spec.rb | Manage GitHub import when imported via api imports project\n[Test] api/1_manage/migration/gitlab_migration_group_spec.rb | Manage Gitlab migration with subgroups and labels successfully imports groups and labels\n[Test] ee/browser_ui/10_govern/group/group_saml_enforced_sso_new_account_spec.rb | Govern Group SAML SSO - Enforced SSO with Snowplow tracking enabled behaves like group membership actions creates a new account automatically and allows to leave group a…\n[Test] browser_ui/10_software_supply_chain_security/project/project_access_token_spec.rb | Software Supply Chain Security Project access tokens can be created and revoked via the UI\ngitlab webhook payload ref conflicts with pipeline trigger api\n[Test] api/10_software_supply_chain_security/project_access_token_spec.rb | Software Supply Chain Security Project access token for the same project can be used to create a file via the project API\n[Test] api/10_software_supply_chain_security/project_access_token_spec.rb | Software Supply Chain Security Project access token for the same project can be used to commit via the API\n[Test] api/10_software_supply_chain_security/project_access_token_spec.rb | Software Supply Chain Security Project access token for a different project cannot be used to create a file via the project API\n[Test] api/10_software_supply_chain_security/project_access_token_spec.rb | Software Supply Chain Security Project access token for a different project cannot be used to commit via the API\n[Test] browser_ui/1_manage/migration/gitlab_migration_group_spec.rb | Manage Gitlab migration imports group from UI\n[Test] browser_ui/10_software_supply_chain_security/user/user_access_termination_spec.rb | Software Supply Chain Security User when parent group membership is terminated is not allowed to push code via the CLI\n[Test] browser_ui/10_software_supply_chain_security/user/user_access_termination_spec.rb | Software Supply Chain Security User when parent group membership is terminated is not allowed to create a file via the API\n[Test] browser_ui/10_software_supply_chain_security/user/user_access_termination_spec.rb | Software Supply Chain Security User when parent group membership is terminated is not allowed to commit via the API\n[Test] browser_ui/10_software_supply_chain_security/login/register_spec.rb | Software Supply Chain Security standard when admin approval is not required with basic registration allows the user to register and login\n[Test] browser_ui/10_govern/login/register_spec.rb | Govern standard when admin approval is not required when user account is deleted allows recreating with same credentials\n[Test] ee/browser_ui/10_software_supply_chain_security/user/minimal_access_user_spec.rb | Software Supply Chain Security User with minimal access to group is not allowed to edit files via the UI\n[Test] browser_ui/10_software_supply_chain_security/login/register_spec.rb | Software Supply Chain Security standard when admin approval is required allows user login after approval\n[Test] ee/api/10_software_supply_chain_security/user/minimal_access_user_spec.rb | Software Supply Chain Security User with minimal access to group is not allowed to push code via the CLI\n[Test] ee/api/10_software_supply_chain_security/user/minimal_access_user_spec.rb | Software Supply Chain Security User with minimal access to group is not allowed to create a file via the API\n[Test] browser_ui/1_manage/import/import_github_repo_spec.rb | Manage GitHub import when imported via UI imports a project\n[Test] browser_ui/10_software_supply_chain_security/login/log_in_spec.rb | Software Supply Chain Security basic user login user logs in using basic credentials and logs out\n[Test] api/1_manage/rate_limits_spec.rb | Manage rate limits throttles authenticated api requests by user\n[Test] ee/browser_ui/2_plan/insights/default_insights_spec.rb | Plan for group insights page behaves like default insights page displays issues and merge requests dashboards\n[Test] ee/browser_ui/2_plan/insights/default_insights_spec.rb | Plan for project insights page behaves like default insights page displays issues and merge requests dashboards\n[Test] browser_ui/9_tenant_scale/group/create_group_with_mattermost_team_spec.rb | Configure Mattermost support user creates a group with a mattermost team\n[Test] browser_ui/10_software_supply_chain_security/login/log_into_mattermost_via_gitlab_spec.rb | Software Supply Chain Security Mattermost login user logs into Mattermost using GitLab OAuth\n[Test] browser_ui/10_software_supply_chain_security/login/log_into_gitlab_via_ldap_spec.rb | Software Supply Chain Security LDAP login user logs into GitLab using LDAP credentials\n[Test] ee/browser_ui/10_govern/group/group_ldap_sync_spec.rb | Govern LDAP Group sync with user filter method behaves like Group sync has LDAP users synced\n[Test] ee/browser_ui/10_govern/group/group_ldap_sync_spec.rb | Govern LDAP Group sync with group cn method behaves like Group sync has LDAP users synced\n[Test] browser_ui/10_software_supply_chain_security/login/login_via_instance_wide_saml_sso_spec.rb | Software Supply Chain Security Instance wide SAML SSO user logs in to gitlab with SAML SSO\nee/browser_ui/10_govern/ldap/admin_ldap_sync_spec.rb | Govern LDAP admin sync sets and removes user's admin status\n[Test] ee/browser_ui/10_govern/group/group_saml_non_enforced_sso_spec.rb | Govern Group SAML SSO - Non enforced SSO user logs in to group with SAML SSO\n[Test] ee/browser_ui/10_govern/group/group_saml_non_enforced_sso_spec.rb | Govern Group SAML SSO - Non enforced SSO lets group admin test settings\n[Test] ee/browser_ui/10_govern/group/group_saml_enforced_sso_git_access_spec.rb | Govern Group SAML SSO - Enforced SSO user clones and pushes to project within a group using Git HTTP\nee/browser_ui/10_govern/group/group_audit_logs_2_spec.rb | Govern Group for enable and disable membership lock behaves like audit event logs audit events for UI operations\nee/browser_ui/10_govern/group/group_audit_logs_2_spec.rb | Govern Group for change project creation level behaves like audit event logs audit events for UI operations\nee/browser_ui/10_govern/group/group_audit_logs_2_spec.rb | Govern Group for enable and disable allow user request access behaves like audit event logs audit events for UI operations\n[Test] ee/browser_ui/10_software_supply_chain_security/project/project_audit_logs_spec.rb | Software Supply Chain Security Project for project archive and unarchive behaves like audit event logs audit events for UI operations\n[Test] ee/browser_ui/10_software_supply_chain_security/project/project_audit_logs_spec.rb | Software Supply Chain Security Project for add project behaves like audit event logs audit events for UI operations\n[Test] ee/browser_ui/10_software_supply_chain_security/project/project_audit_logs_spec.rb | Software Supply Chain Security Project for change visibility behaves like audit event logs audit events for UI operations\n[Test] ee/browser_ui/10_software_supply_chain_security/project/project_audit_logs_spec.rb | Software Supply Chain Security Project for add user access as guest behaves like audit event logs audit events for UI operations\n[Test] ee/browser_ui/10_software_supply_chain_security/project/project_audit_logs_spec.rb | Software Supply Chain Security Project for add deploy key behaves like audit event logs audit events for UI operations\n[Test] ee/browser_ui/10_software_supply_chain_security/group/group_audit_logs_1_spec.rb | Software Supply Chain Security Group for change repository size limit behaves like audit event logs audit events for UI operations\n[Test] ee/browser_ui/10_software_supply_chain_security/group/group_audit_logs_1_spec.rb | Software Supply Chain Security Group for update group name behaves like audit event logs audit events for UI operations\n[Test] ee/browser_ui/10_software_supply_chain_security/group/group_audit_logs_1_spec.rb | Software Supply Chain Security Group for add group behaves like audit event logs audit events for UI operations\n[Test] ee/browser_ui/10_software_supply_chain_security/group/group_audit_logs_1_spec.rb | Software Supply Chain Security Group for add user, change access level, remove user behaves like audit event logs audit events for UI operations\n[Test] ee/browser_ui/10_software_supply_chain_security/group/group_audit_logs_1_spec.rb | Software Supply Chain Security Group for add and remove project access behaves like audit event logs audit events for UI operations\n[Test] ee/browser_ui/10_software_supply_chain_security/instance/instance_audit_logs_spec.rb | Software Supply Chain Security Instance for failed sign in behaves like audit event logs audit events for UI operations\n[Test] ee/browser_ui/10_software_supply_chain_security/instance/instance_audit_logs_spec.rb | Software Supply Chain Security Instance for successful sign in behaves like audit event logs audit events for UI operations\n[Test] ee/browser_ui/10_software_supply_chain_security/instance/instance_audit_logs_spec.rb | Software Supply Chain Security Instance for add SSH key behaves like audit event logs audit events for UI operations\n[Test] ee/browser_ui/10_software_supply_chain_security/instance/instance_audit_logs_spec.rb | Software Supply Chain Security Instance for start and stop user impersonation logs audit events for impersonation operations\n[Test] ee/browser_ui/10_software_supply_chain_security/instance/instance_audit_logs_spec.rb | Software Supply Chain Security Instance for change password behaves like audit event logs audit events for UI operations\n[Test] ee/browser_ui/10_software_supply_chain_security/instance/instance_audit_logs_spec.rb | Software Supply Chain Security Instance for add and delete email behaves like audit event logs audit events for UI operations\nee/browser_ui/10_govern/group/group_audit_logs_2_spec.rb | Govern Group for disable and Enable LFS behaves like audit event logs audit events for UI operations\nee/browser_ui/10_govern/group/group_audit_logs_2_spec.rb | Govern Group for enable and disable 2FA requirement behaves like audit event logs audit events for UI operations\n[Test] ee/browser_ui/10_software_supply_chain_security/group/restrict_by_ip_address_spec.rb | Software Supply Chain Security Group access when restricted by another ip address with SSH denies access\n[Test] ee/browser_ui/10_software_supply_chain_security/group/restrict_by_ip_address_spec.rb | Software Supply Chain Security Group access when restricted by another ip address with API denies access\n[Test] ee/browser_ui/10_software_supply_chain_security/group/restrict_by_ip_address_spec.rb | Software Supply Chain Security Group access when restricted by another ip address with UI denies access\n[Test] ee/browser_ui/10_software_supply_chain_security/group/restrict_by_ip_address_spec.rb | Software Supply Chain Security Group access when restricted by user's ip address with SSH allows access\n[Test] ee/browser_ui/10_software_supply_chain_security/group/restrict_by_ip_address_spec.rb | Software Supply Chain Security Group access when restricted by user's ip address with API allows access\n[Test] ee/browser_ui/10_software_supply_chain_security/group/restrict_by_ip_address_spec.rb | Software Supply Chain Security Group access when restricted by user's ip address with UI allows access\n[Test] browser_ui/10_software_supply_chain_security/login/log_in_with_2fa_spec.rb | Software Supply Chain Security 2FA allows enforcing 2FA via UI and logging in with 2FA\n[Test] browser_ui/10_software_supply_chain_security/login/register_spec.rb | Software Supply Chain Security while LDAP is enabled allows the user to register and login\n[Test] ee/browser_ui/10_govern/group/group_saml_non_enforced_sso_spec.rb | Govern Group SAML SSO - Non enforced SSO when SAML SSO is configured with a default membership role adds the new member with access level as set in SAML SSO configuration\n[Test] browser_ui/10_software_supply_chain_security/login/2fa_recovery_spec.rb | Software Supply Chain Security 2FA allows using 2FA recovery code once only\n[Test] browser_ui/10_software_supply_chain_security/login/2fa_ssh_recovery_spec.rb | Software Supply Chain Security 2FA allows 2FA code recovery via ssh\n[Test] ee/browser_ui/10_software_supply_chain_security/project/project_audit_logs_spec.rb | Software Supply Chain Security Project for export file download behaves like audit event logs audit events for UI operations\nWhen user is using double quotes to search, dont allow free text search\n[Test] ee/browser_ui/1_manage/integrations/jira_issues_list_spec.rb | Manage Jira issues integration views an issue\nPremium\n[Test] ee/browser_ui/1_manage/integrations/jira_issues_list_spec.rb | Manage Jira issues integration shows open issues\nPremium\n[Test] ee/browser_ui/1_manage/integrations/jira_issues_list_spec.rb | Manage Jira issues integration searching issues returns results\nPremium\napi/1_manage/migration/gitlab_migration_mr_spec.rb | Manage Gitlab migration with merge request successfully imports merge request\nAdd Integration for Jira Service Management\n[Test] api/1_manage/integrations/webhook_events_spec.rb | Manage WebHooks integration sends a push event\nIncorrect docs for the event webhook payload example\ngl-spinner uses ridiculous cpu amount (56%)\nHow to update\ndb_key_base\nGitHub -> Gitlab mirroring failing deterministically per-user\n[Test] api/1_manage/integrations/webhook_events_spec.rb | Manage WebHooks integration sends a merge request event\n[Test] api/1_manage/integrations/webhook_events_spec.rb | Manage WebHooks integration sends a wiki page event\n[Test] api/1_manage/integrations/webhook_events_spec.rb | Manage WebHooks integration sends an issues and note event\nUpdate Slack logo in GitLab SVG to not include empty space\nInvestigate & remove sensitive information from logs\nInvestigate the impact of malicious uploaded files\nCSV Export of merge requests does not include approvers\n[Test] ee/browser_ui/10_govern/group/group_saml_enforced_sso_new_account_spec.rb | Govern Group SAML SSO - Enforced SSO with Snowplow tracking disabled behaves like group membership actions creates a new account automatically and allows to leave group …\nFollow-up from \"Migrate WebHookWorker to use params: step 2\"\nDocs feedback: provide specification for confusing fields/behavior in Webhook events\nMotorola one vision, sms sending impossible\nFill testing gap identified when upgrading to 14.4 for GraphQL\nGraphQL Subscription triggers through Gitlab::EventStore\nReplace import confirmation modal with hover message\nAdd skip_authorization to group destroy\nEncourage GraphQL deprecations to be kept around indefinitely where possible\nRemove bootstrap \"collapse\" functionality from our codebase\nIs their a quick way to find \"my issues\" ie. created by me?\nExtend left side nav bar with custom entries to integrate 3rd party web applications easily with context from GitLab UI\nGroup import / export API does not respect the member list and adds \"Administrator\" to the imported group\n[Test] api/1_manage/migration/gitlab_migration_members_spec.rb | Manage Gitlab migration with group member member retains indirect membership in imported project\n[Test] api/1_manage/migration/gitlab_migration_members_spec.rb | Manage Gitlab migration with project member member retains direct membership in imported project\n[Test] api/1_manage/migration/gitlab_migration_pipeline_spec.rb | Manage Gitlab migration with ci pipeline successfully imports ci pipeline\nFollow-up from \"Make spinners in users/_overview partial Pajamas-compliant\"\nDraft: Docs feedback: Add troubleshooting section and guidance on enabling Operations when setting up Sentry Error Tracking\nExtend tests to make sure all required refs are kept after a project import\nCreate Todo via API\nDocs feedback: Fine grained permissions for Jira server account for Jira integration\napi/1_manage/bulk_import_project_spec.rb | Manage Gitlab migration with merge request successfully imports merge request\nRemove font and color columns from broadcast_messages table\nUI popup on hover very anoying. It show popup at bottom of hovered element.\napi/1_manage/migration/gitlab_migration_large_project_spec.rb | Manage Gitlab migration migrates large gitlab group via api\nAdd embedded content placeholder for email notifications\nMove EE code to separate files in spec/support/helpers/navbar_structure_helper.rb\nRemove uuid npm package in favor of Crypto.randomUUID\n[Test] api/1_manage/migration/gitlab_migration_release_spec.rb | Manage Gitlab migration with release successfully imports project release\nProduct marketing: Webauthn support with Yubico\nAdd Pajamas compliant text field component to GitLab UI form builder\nReplace generic radio button with GitLab UI styled radio button in app/views/projects/project_templates/_template.html.haml\nReplace generic radio button with GitLab UI styled radio button in ee/app/views/users/_custom_project_templates_from_groups.html.haml\nAudit SVGs inside GitLab project\nImport stage — JTBD\nHandle failed requests when posting notifications to Slack/Mattermost\nChange the header color by specifying the rgb value\nAbstract eventually_matcher.rb so it can be used in feature specs\nUpdate user callout implementation in\nee/app/views/shared/promotions/_promote_group_webhooks.html.haml\nto the one compatible with\nGlEmptyState\nUpdate user callout implementation in\nee/app/views/shared/promotions/_promote_audit_events.html.haml\nto the one compatible with\nGlEmptyState\nMigrate btn-inverted to secondary gl-buttons\nReplace jQuery in app/assets/javascripts/projects/project_find_file.js file\nRequirements for v5 architecture\n[Time tracking reports] Implement a search bar like the one used to search for issues\n[Time tracking reports] Allow users to group timelogs together\nUse linter rule to disallow importing js-cookie directly\n[Test] api/9_tenant_scale/user_inherited_access_spec.rb | Tenant Scale User when added to parent group is allowed to create a file in sub-group project via the API\nversion check badge missing\nConsider creating Rails helper/ViewComponent for skeleton loader\nInvestigate creating @rails/ujs upstream changes to disallow script execution\nRename \"component\" to \"view component\"\nWhat happens when form builder radio and checkbox components has no label/help_text arg/slots passed in\nFollow-up from \"Web Hook encrypted URL variables: Backend support (Web)\"\nIntegrations Discussion: MVC for Integrations as data\n[Test] browser_ui/1_manage/integrations/pipeline_status_emails_spec.rb | Manage Pipeline status emails when pipeline passes sends an email\n[Test] browser_ui/1_manage/integrations/pipeline_status_emails_spec.rb | Manage Pipeline status emails when pipeline fails sends an email\n[Test] api/1_manage/migration/gitlab_migration_issue_spec.rb | Manage Gitlab migration with designs successfully imports design\nMake cards in app/views/discussions/_discussion.html.haml Pajamas-compliant\nDisplay README on project homepage if placed under docs/\nRename\ndestination_name\ncolumn to\ndestination_slug\nfor bulk imports on db level\nRemove font color override in emails\nDocs feedback: Security partner integrations\nPassenger Vhost server config example have issue with cloning subgroup - Bring it up to date.\nIncrease the MAX_LANGUAGES limit in language detection\nGitHub migration: Use group name or a default bot as issuer of imported items that not have local equivalent\nOfficial GitLab App for Android and iOS\nIssue in Rendering GlFormSelect in GitLab\nCheckboxComponent - Remove\nlabel\nand\nhelp_text\narguments and refactor how slots work\nRefactor the hook log \"show\" partials to a shared partial \"shared/hook_logs/_show\"\nAlign theme of Haml form datepickers with gitlab-ui\nMove controller specs for webhooks over to request specs\nMigrate\napp/views/admin/application_settings/appearances/_form.html.haml\nto use\nLayouts::HorizontalSectionComponent\nMigrate\napp/views/admin/application_settings/appearances/_system_header_footer_form.html.haml\nto use\nLayouts::HorizontalSectionComponent\nMigrate\napp/views/admin/hooks/index.html.haml\nto use\nLayouts::HorizontalSectionComponent\nMigrate\napp/views/admin/users/_access_levels.html.haml\nto use\nLayouts::HorizontalSectionComponent\nMigrate\napp/views/admin/users/_admin_notes.html.haml\nto use\nLayouts::HorizontalSectionComponent\nMigrate\napp/views/admin/users/_form.html.haml\nto use\nLayouts::HorizontalSectionComponent\nMigrate\napp/views/groups/settings/access_tokens/index.html.haml\nto use\nLayouts::HorizontalSectionComponent\nMigrate\napp/views/profiles/audit_log.html.haml\nto use\nLayouts::HorizontalSectionComponent\nMigrate\napp/views/profiles/show.html.haml\nto use\nLayouts::HorizontalSectionComponent\nMigrate\napp/views/profiles/accounts/show.html.haml\nto use\nLayouts::HorizontalSectionComponent\nMigrate\napp/views/profiles/active_sessions/index.html.haml\nto use\nLayouts::HorizontalSectionComponent\nMigrate\napp/views/profiles/chat_names/index.html.haml\nto use\nLayouts::HorizontalSectionComponent\nMigrate\napp/views/profiles/emails/index.html.haml\nto use\nLayouts::HorizontalSectionComponent\nMigrate\napp/views/profiles/gpg_keys/index.html.haml\nto use\nLayouts::HorizontalSectionComponent\nMigrate\napp/views/profiles/keys/index.html.haml\nto use\nLayouts::HorizontalSectionComponent\nMigrate\napp/views/profiles/notifications/show.html.haml\nto use\nLayouts::HorizontalSectionComponent\nMigrate\napp/views/profiles/passwords/edit.html.haml\nto use\nLayouts::HorizontalSectionComponent\nMigrate\napp/views/profiles/personal_access_tokens/index.html.haml\nto use\nLayouts::HorizontalSectionComponent\nMigrate\napp/views/profiles/preferences/show.html.haml\nto use\nLayouts::HorizontalSectionComponent\nMigrate\napp/views/profiles/two_factor_auths/show.html.haml\nto use\nLayouts::HorizontalSectionComponent\nMigrate\napp/views/projects/hooks/index.html.haml\nto use\nLayouts::HorizontalSectionComponent\nMigrate\napp/views/projects/settings/access_tokens/index.html.haml\nto use\nLayouts::HorizontalSectionComponent\nMigrate\napp/views/shared/doorkeeper/applications/_index.html.haml\nto use\nLayouts::HorizontalSectionComponent\nMigrate\napp/views/shared/file_hooks/_index.html.haml\nto use\nLayouts::HorizontalSectionComponent\nMigrate\nee/app/views/admin/users/_limits.html.haml\nto use\nLayouts::HorizontalSectionComponent\nMigrate\nee/app/views/admin/users/_namespace_plan_fieldset.html.haml\nto use\nLayouts::HorizontalSectionComponent\nDiscuss naming of\nLayouts::HorizontalSectionComponent\nViewComponent\nCreate mechanism to remove graphql mutations automatically at a future date\nAdd option to configure project visibility on import\nFollow-up from \"Use CSS-util classes for sec-dashboard accordion\"\n[Feature flag] Remove\nproject_import_level_configuration\nfeature flag\nStorybook > Backport the LinkToSource block from GitLab UI\nRemove\nwrapper = null\nfrom Vue component tests\nAdd hide/show and/or a list mode to /-/releases page\nRun bundle-size-review job on\nmaster\n, only if needed.\nInvestigate webpack speed-up in MR pipelines\nAdd caveat to @graphql-eslint/require-id-when-available\nDiscussion: Static DSL Concept Review & Documentation\nImprove the search behaviour on user settings pages\nRevisit spec/frontend/commit/pipelines/pipelines_table_spec.js\ngitlab-rake gitlab:check\nshould check for noexec mounted /var/opt/gitlab/gitaly/run/\nReview Gitlab::GithubImport::ParallelScheduling and make interface methods as private if possible\nImprove slow tests in ./spec/support/shared_examples/integrations/integration_settings_form.rb:7\nFollow-up from \"Migrate Group Import Form to GitLab UI\"\nTerms of Service \"Decline and sign out\" does not redirect to configured sign out page\ndoes toolbox support point-in-time restore\nInvestigate Integration Platforms\nArchitecture Blueprint for API v5\nStackblitz Codeflow for Gitlab\nbrowser_ui/3_create/slack/slash_commands_spec.rb | Create Slack app integration when using slash commands creates an issue\nbrowser_ui/3_create/slack/slash_commands_spec.rb | Create Slack app integration when using slash commands with gitlab issue displays an issue\nbrowser_ui/3_create/slack/slash_commands_spec.rb | Create Slack app integration when using slash commands with gitlab issue closes an issue\nbrowser_ui/3_create/slack/slash_commands_spec.rb | Create Slack app integration when using slash commands with gitlab issue comments on an issue\nbrowser_ui/3_create/slack/slash_commands_spec.rb | Create Slack app integration when using slash commands with gitlab issue with target project moves an issue\nIntegrations\nbranches_to_be_notified: protected\nbehaviour with a protected default branch\nUltimate\nProfessional Services using Direct transfer as default importer\n[Test] ee/api/1_manage/import/import_github_repo_spec.rb | Manage GitHub import when imported via api imports repo push rules\nRemove unnecessary duplication of variables and rely on gitlab-ui\nRefactor API response messages\n[Test] api/1_manage/migration/gitlab_migration_project_spec.rb | Manage Gitlab migration with import within same instance successfully imports project\nEnvironment UX overall issues\nPremium\n[Test] api/1_manage/integrations/webhook_events_spec.rb | Manage WebHooks integration sends a tag event\napi/1_manage/integrations/webhook_events_spec.rb | Manage WebHooks integration sends a group_member event when a user is added to the group\n[Test] ee/api/1_manage/integrations/group_webhook_events_spec.rb | Manage Group WebHooks integration sends subgroup events\nImprove\ncreateAlert\nto handle multiple alerts\nFollow-up from \"Added a UI to create timelogs\" - Refactor issuable helper fields to snake_case\nAllow\nPOST /projects/remote-import\naccept AWS\nSession_key\nRetain/Restore comment authors and assignees in the Merge Requests History after a gitlab export/import\nRefactoring: LFS objects fetching during the import\nGitlabUiFormBuilder#submit: Consider passing additional options to Pajamas::ButtonComponent\nFollow-up from \"Increment project statistics by individual job artifact\"\nImprove datadog integration specs\nImprove sprite_icon output markup accessibility\nLonger term vision for Monitor left-hand navigation items\nJustin's Test - will close/delete\nUpdate /#hooks documentation to reflect the current schema\nRemove jQuery from GLForm class\n[Test] api/1_manage/migration/gitlab_migration_issue_spec.rb | Manage Gitlab migration with associated merge request preserves related merge request\nImprove strategy for opting out of certain font features, e.g. symbolic ligatures\nRainbow flag should not be named \"gay pride flag\"\nDocs feedback: \"GitLab.com settings\" page doesn't mention whether \"Requests to the local network by webhooks\" is allowed or blocked\nTest Webhook Merge Request Events with self-hosted gitlab-ce:15.6.0-ce.0 in docker container , but get error page of '500'\nUltimate\nFollow-up from \"Update Awesome Co docs to contain correct rake namespace\"\nRemove direct instantiation of resolver objects in GraphQL code\nRemove unnecessary GitLab UI mixins usage from the codebase\nMake integrations API static\nMake application settings API more static\nFollow-up from \"Fix spacing of \"Your work\" menu item\"\nCreate a validator to validate an array of URLs\nFix potential inconsistency in group visibility selector\nCloudQuery Source Plugin\nRemove Project.services GraphQL field\nProducer and Consumer example\n.tar.xz?\nDocumenting the Public URL of GitLab.com\nImprovements for scripts/lint-json\nGitLab for Jira app - Persistent Testing App for Self-Managed integration\nReplace instances of the drag icons with the new grip icon\nUpdate Max Import Size documentation to stipulate relevant Importer\nPersonal DIY tracking issue\nee/api/1_manage/integrations/group_webhook_events_spec.rb | Manage Group WebHooks integration when hook fails group hooks do not auto-disable\napi/1_manage/integrations/webhook_events_spec.rb | Manage WebHooks integration when hook fails hook is auto-disabled\nAdd handling for\nNumpadEnter\nin the new dropdown\nMigrate default_theme settings to application settings\nAdd custom error message in the modal dropdown\nImport from BitBucket Server fails with if cloning over HTTPS is disabled\nRemove LazyLoader class\nRuboCop: Undo changes to autocorrect \"this\" to \"the\"\nNice to Have - YAML Debugging\nuser_email field in Webhook Requests is incorrect and inconsistent\nFollow-up from \"Migrates LabelsSelect to LabelsSelectWidget in TestCaseSidebar and fixes bug\"\nConsider using storybook for visual regression testing of the primary navigation dropdown menu\nRepository clean up is inconsistent\ncreate/modify/delete should not be hard for projects\nerror en el registro y este DNI corresponda a otra persona,\nProposal: Require Rake to be written as a class using Rake::DSL\nReuse\nMergeChecksApp\nVue component in\napp/views/projects/_merge_request_pipelines_and_threads_options.html.haml\nFollow-up from \"Improve web-hook failure state cache\"\nRemove markdownDocsPath prop from field.vue\nGitLab failing to respect my browser locale (fr-CA)\nImprove Import/Export dev docs\nUpstream lib/gitlab/buffered_io.rb changes to net-protocol\nConsider adding header styling for GlDropdownDisclosure\nModelo História\nJira integration stopped working\nNo Slack notification for deployment start/finish\nJira Cloud fails to connect to self-hosted Gitlab: \"Unknown CA\"\nAPI changes should be reviewed by experts\nRestrictive Dropdown Width For Jira Integration Create Branch\nHow to check difference between two difference by using API\nDocs feedback: Settings link does not exist.\nMirror with submodules\n\"407 Proxy authentication Required\" for slack integration while http_proxy is properly configured.\nError 500 when enabling direct transfer\nUpdate Zoekt Production Readiness Review to reflect larger scale\npowershell script doesn't work after the update of GitLab-runner from Version 15.5.1 to version 15.7.3\nImprove webhook test coverage\nSynchronize date time format across api\nJIRA integration doesn't work with JIRA project name starting with a number\nRemove SVG imports from\n?raw\nand remove usage of v-safe-html to render images\nDocumentation: mention real time sync for Jira Server/Data Center DVCS\nSync Failed error when re-synchronizing GitLab resposiotries in Jira data center\nSeparate out GitHub tracking log from Gitlab::Import::Metrics\nUpstream Net::HTTPResponse changes in config/initializers/net_http_response_patch.rb\nAnnoying tooltips that dont let you click\nCreate wrapper for router-view to support vue-router@4\nFollow-up: Update dashboards to homepage in user settings\nFollow-up from \"Remove\nproject_export_as_ndjson\nand\nproject_import_ndjson\nFFs\"\nAutomatically identify constraints that do not match schema\nCreate a plugin for VTU for elegant event emitting\nIntroduce API to retrieve uploaded fie\nIn Cloud Native GitLab the Rake task gitlab:uploads:migrate_to_local:all loses uploads\nTest pipelines to import packages feature\nDocs feedback: Missing prerequisite for enabling feature flag for group import\nConsider consistent header anchors\nLint against implicit multi-root-node components\nInvestigate increase of failed group migrations by Direct transfer\nDirect link to Jenkins\nDocs feedback: Webhook doc for Issue events does not mention event_type confidential_issue\nUsing Import API to import project into self-managed GitLab adds strange suffix to imported project's path\nregression: no \"activity\" link in hamburger menu\nDirect transfer data: Discrepancy Sisense chart vs database\nAddress small performance, accessibility and UI issues of the pinned items section\nAdd Multi-Page Selector to Top of Page\nThe Slack integration doesn't allow using the \"run\" command with jobs with spaces in their name\nGraphql docs should show going from query to curl request\nImprove pinned items components' specs\nUI Bug with version GitLab Community Edition 15.10.1, MergeRequest error banner persists\nChange the mainfest.json\ndisplay\nfield to\nstandalone\nto support full screen app like experience on mobile devices\n[Feature Request] I'd like to centralize notification of external events in gitlab\nSupport highlighting multiple ranges of source lines\nDocs feedback: consider suggesting Terraforms environmental-variable alternative to putting tokens into config files\nDoc refer to \"GitLab administrators\" but this is not an official role, so I have no idea how to decipher\ngit lfs capacity doubled after migration without reduction\nNot receiving Webhooks from Gitlab on events(push, merge) anymore\n15.10.1-ee - Selector for \"instance template repository\" behaves inconsitently\nMigrate GlDropdown in app/assets/javascripts/projects/settings/components/access_dropdown.vue\n[AI pattern] Feature discovery moments AI features\nInvestigate why unique_relation? method returns true unexpectedly\nPublicacion de Pagina de Servicio de la Municipalidad de San Juan de Lurigancho\nGitLab for Slack app - feature proposal: Run command for stage or complete pipeline\nOnly first 30 or so anchors in markdown are scrolled to automatically when viewed using blob URL\nAudit casing for breadcrumbs and page titles\nApple App Store integration works only on proteced branches\nGitLab Slack app: hide username\nMigrate GlFilteredSearch to use terms-as-tokens in app/assets/javascripts/add_context_commits_modal/components/add_context_commits_modal_wrapper.vue\nMigrate GlFilteredSearch to use terms-as-tokens in app/assets/javascripts/admin/abuse_reports/components/abuse_reports_filtered_search_bar.vue\nMigrate GlFilteredSearch to use terms-as-tokens in app/assets/javascripts/admin/abuse_reports/components/app.vue\nMigrate GlFilteredSearch to use terms-as-tokens in app/assets/javascripts/jobs/components/filtered_search/jobs_filtered_search.vue\nMigrate GlFilteredSearch to use terms-as-tokens in app/assets/javascripts/members/components/filter_sort/members_filtered_search_bar.vue\nMigrate GlFilteredSearch to use terms-as-tokens in app/assets/javascripts/pipelines/components/pipelines_list/pipelines_filtered_search.vue\nMigrate GlFilteredSearch to use terms-as-tokens in app/assets/javascripts/vue_shared/components/filtered_search_bar/filtered_search_bar_root.vue\nMigrate GlFilteredSearch to use terms-as-tokens in app/assets/javascripts/vue_shared/components/paginated_table_with_search_and_tabs/paginated_table_with_search_and_tabs.vue\nMigrate GlFilteredSearch to use terms-as-tokens in ee/app/assets/javascripts/audit_events/components/audit_events_filter.vue\nMigrate GlFilteredSearch to use terms-as-tokens in ee/app/assets/javascripts/compliance_dashboard/components/frameworks_report/filters.vue\nMigrate GlFilteredSearch to use terms-as-tokens in ee/app/assets/javascripts/usage_quotas/components/search_and_sort_bar/search_and_sort_bar.vue\nMigrate GlFilteredSearch to use terms-as-tokens in ee/app/assets/javascripts/usage_quotas/seats/components/subscription_seats.vue\nMigrate GlFilteredSearch to use terms-as-tokens in ee/app/assets/javascripts/usage_quotas/storage/components/namespace_storage_app.vue\nAdd failing spec when\nimport_sources\nis corrupted\nRedirecting using\nredirect_to\nwrongly shows \"notice\" alerts\nDocs feedback: Sample CSV data code doesn't work.\nHabilitar acceso a analytic en GOB.PE: https://www.gob.pe/ejercito\nExclude\nalpha\nfeatures from\nused_deprecated_fields\nReplace generic checkbox with GitLab UI styled checkbox in app/views/clusters/clusters/_provider_details_form.html.haml\nReplace generic checkbox with GitLab UI styled checkbox in app/components/pajamas/checkbox_tag_component.html.haml\nReplace generic checkbox with GitLab UI styled checkbox in app/views/clusters/clusters/user/_form.html.haml\nAdd new pre-approved Blue Oak licenses\nAudit drawer component\nSOLICITUD DE VERIFICACION DE DATOS PARA MIGRACION DEL PORTAL GOB.PE AYACUCHO\nMake profile/signup form inclusive of users who have only single name legally\nFollow-up from \"Introduce parallelised BitBucket Server Importer\"\nFollow-up from \"Introduce parallelised BitBucket Server Importer\"\nFollow-up from \"Introduce parallelised BitBucket Server Importer\"\nRemove Hash-handling code from BitBucket Server UserFinder#uid\nBitBucketServer: Add missing specs\njunit reports incorrectly parsed when generated from maven-surefire-plugin >2.22.2\nDiscussion: When to use a broadcast message\nBroadcast Messages that appear in the CLI appear on every push\nConsider also using visible text for modal confirm button in confirm_via_gl_modal.js\nMigrate \"app/assets/javascripts/emoji/components/picker.vue\" to GlDisclosureDropdown or GlCollapsibleListbox\nMigrate \"app/assets/javascripts/groups/settings/components/access_dropdown.vue\" to GlDisclosureDropdown or GlCollapsibleListbox\nUpdate developer docs for Direct transfer\nFlay test spec/requests/api/project_export_spec.rb:287 | API::ProjectExport GET /projects/:project_id/export/download when project export is enabled when user is an admin applies correct scope when throttling throttles downloads within same namespaces\nFix spec violations in ee/spec/frontend/test_case_show/mixins/test_case_graphql_spec.js\nFix spec violations in spec/frontend/vuex_shared/bindings_spec.js\nMigrate \"app/assets/javascripts/projects/settings_service_desk/components/service_desk_template_dropdown.vue\" to GlDisclosureDropdown or GlCollapsibleListbox\nMigrate \"app/assets/javascripts/sidebar/components/sidebar_dropdown.vue\" to GlDisclosureDropdown or GlCollapsibleListbox\nDocs - product feedback: bad pointer for values.yaml\nFeedback on the \"GitLab for Jira Cloud\" app\nWhy not provide menu for \"your repositories\" under the user icon like github does\nImporting collaborators for a personal repository imports only the repository owner\nGive option to show the time and date of an action\nMove\nallowedlisted?\nfrom Utils to\nGitlab::PathTraversal\nIntroduce a class for safe file handling as an alternative to IO and File\nMake the star filled in the explore page for starred projects\nDRY up \"%b %d, %Y\"\nCREACION DE UN MENU\nClarify the Failing webhooks to explain what is the backoff strategy applied\nPrevent BitBucket Server to continue running workers when import fails\nConnecting Jira through \"GitLab.com (SaaS)\"\nSubtransaction: Detected subtransaction related to ProjectsController#create\nCommand palette: render project files in a file tree structure\nAdd \"Activity\" to the new navigation\nRegression: \"preview\" in input fields is unergonomically placed\nFollow-up from \"Add repository size limit check during import\"\nProject export: Cannot export project with error \"exit status 128: stderr fatal: bad object\" in email\nCreate the gem\ngitlab-sidekiq-cluster\nfrom\nroot/sidekiq_cluster\ncode\nCreate the gem\ngitlab-metrics_server\nfrom\nroot/metrics_server\ncode\nCleanup the SidebarsHelper#super_sidebar_context method\nInconsistent search results in components with search and autocomplete\nDocs feedback - feature proposal: Give us a way to find out which groups are meant by group IDs for the free tier limit\nUse Pajamas button component for button in ee/app/views/devise/sessions/_new_smartcard.html.haml\nUse Pajamas button component for button in ee/app/views/projects/blob/_header_file_locks_link.html.haml\nUse Pajamas button component for button in ee/app/views/shared/billings/_billing_plan_actions.html.haml\nUse Pajamas button component for button in ee/app/views/groups/saml_group_links/_form.html.haml\nCambio de nombre de funcionario, alcalde de la provincia de Bagua\nSettings form sticky footer: Only show footer sticky if form changes are detected\nAuto-merge info box does not indicate all relevant details\n2FA QRcode background enlarge with page (too much width)\nAdd mechanism for Gitlab import/export to add import only attributes\nFailure in ee/spec/features/projects/integrations/user_activates_github_spec.rb | User activates GitHub integration with valid license with pipelines tests integration before save\nee/spec/features/projects/new_project_spec.rb fails if GitHub is down\nnil is not a known state value\nSwap\nswagger-ui-dist\nwith\nswagger-ui\nnpm package\nCurrent DRI for preparing issues for Pajamas Migration Day: FY24Q2 July 14th\nSpike: Performance of a single settings page\nUnify common frontend implementation for emoji reactions between Work Items and Design Management\nConsider removing \"auto-save\" feature from user preferences\nMigrate to Pajamas compliant buttons in app/helpers/auth_helper.rb\nMigrate to Pajamas compliant buttons in app/helpers/issuables_helper.rb\nMigrate to Pajamas compliant buttons in app/views/discussions/_diff_with_notes.html.haml\nMigrate to Pajamas compliant buttons in ee/app/views/shared/issuable/_filter_epic.html.haml\nMigrate to Pajamas compliant buttons in ee/app/views/users/available_project_templates.html.haml\nMigrate app/assets/javascripts/vue_shared/components/color_select_dropdown/dropdown_contents.vue to GlDisclosureDropdown or GlCollapsibleListbox\nMigrate app/assets/javascripts/vue_shared/components/dropdown/dropdown_widget/dropdown_widget.vue to GlDisclosureDropdown or GlCollapsibleListbox\nMigrate app/assets/javascripts/vue_shared/components/new_resource_dropdown/new_resource_dropdown.vue to GlDisclosureDropdown or GlCollapsibleListbox\nMigrate app/assets/javascripts/vue_shared/components/user_select/user_select.vue to GlDisclosureDropdown or GlCollapsibleListbox\nAllow UserCalloutDismisser and GlPopover to work better together\nMigrate to Pajamas compliant buttons in app/helpers/auth_helper.rb\nNew UI: Navigation menu partially out of bounds in Safari\nFunctional ownership of project templates, forking and mirroring functionality\nRevisit logic used to hide projects created by banned users\nAdd description of how to import a bare repo after Rake task removal in 16\n[Test] spec/features/projects/integrations/project_integrations_spec.rb | Project integrations behaves like integration settings form displays all the integrations\n[Test] spec/features/groups/integrations/group_integrations_spec.rb | Group integrations behaves like integration settings form displays all the integrations\n[Test] spec/features/admin/integrations/instance_integrations_spec.rb | Instance integrations behaves like integration settings form displays all the integrations\nAdd guidelines for changes to the old nav header search\nChatops command: Trigger Zoekt reindexing for a whole namespace\nEnable the\ndisallowVueBuiltInComponents\n/\ndisallowVue3BuiltInComponents\nin eslint\nInvestigate why Snowplow tracking does not work with the link buttons\nstandalone chrome and firefox in Version 15.11.6\nChange health status behaviour when user does not change value\nIssue Links routing with absolute URLs instead of relative\nSlash command comment without changes triggers webhooks with emtpy changes\nHover Add Popup\nMigrate\nbreadcrumb-class-haml\nin\napp/views/projects/artifacts/_file_navigation.html.haml\nMigrate\nbreadcrumb-class-haml\nin\napp/views/projects/artifacts/browse.html.haml\nMigrate\nbreadcrumb-class-haml\nin\napp/views/projects/blob/_breadcrumb.html.haml\nMigrate\nbreadcrumb-class-haml\nin\napp/views/projects/commits/show.html.haml\nMigrate\nbreadcrumb-class-haml\nin\napp/views/projects/graphs/charts.html.haml\nMigrate\nbreadcrumb-class-haml\nin\napp/views/users/_overview.html.haml\nMigrate\nbreadcrumb-class-haml\nin\napp/views/projects/find_file/show.html.haml\nFix the notification dot border\nTabs within cards\nSocilo cambi de numero de whatsapp al tramite obtener copia certificada de una partida o acta de nacimiento matrimonio o de funcion\nFailure in api/1_manage/migration/gitlab_migration_project_spec.rb | Manage Gitlab migration with repository successfully imports repository\nUpdate Broadcast message documentation to reflect new targeting\nAccessing profile badge and submenu is counterintuitive\nGitLab Api : Get merge_requests not working as intended\nMake GitLab to be more capable in doing exams in education settings.\nAddress relayout challenges for the navigation\nWrong number of pages in Pagination when searching in docs.\nShow full title as tooltip if nav item title has ellipsis\nMitigate problems with interdependence of GitHub importer and GitLab CI/CD for external repositories features\nLog the field performance of GraphQL queries in Kibana\nAllow GraphQL fields to have feature_category metadata\nBackfill existing GraphQL types and fields to have a feature_category, and make it required.\nFeed GraphQL feature_category field data into Error Budgets\nAdd 'new navigation' option in '/-/profile/preferences'\nPotential DoS vulnerability via decompression bomb\nMigrate\nbootstrap-dropdown-toggle-haml\nin\napp/views/layouts/header/_super_sidebar_logged_out.haml\nAudit: Calls to methods in IO class must be avoided - can lead to 'OS command injection' critical bug\nFeedback animations: Apply to components\nEmotion animations: Create a few drafts based on real interfaces and brand book\nImprove Project Super Sidebar specs\nAdd\ngitlab-rake gitlab:web_hook:retry\ncommand for projects\nClarify current vs prospective properties of the AI architecture\nCreate a fallback state for private users in the navigation sidebar\nWIP - Make search bar more visible\nFollow-up clean up of dropdown migration\nDeprecate stage and entity_id from PipelineWorker - Direct Transfer\nCommand + e shortcut for formatting as code, does not work in comments\nEvaluate actor override of Direct Transfer disabled setting\nAddress Visual follow-ups in boards_selector\nResolve GitLab instance check exceptions\nUse ClickHouse for Project AuditEventsController\n[Feature Request][self-hosted] Make display of date-times more consistent across site.\nImpossible to reach user profile from the sidebar if Gravatar failed to load\nMake \"Contributed Projects\" more easily accessible on the web interface\nMigrate\nbutton-class\nin\napp/assets/javascripts/behaviors/copy_code.js\nUse default\ndata-testid\nfrom the GlCollapsibleListobx instead of a\nqa-selector\nin jira_issue_creation_vulnerabilities.vue\nGitLab for Slack app - FY25 and beyond Roadmap preparation\nBrotkrumenpfad auf Unterseiten anpassen\nThings that Congregate does that our product should do\nImprove Webhook timeout error message\nCount of assigned merge requests in sidebar doesn't update when assigned to a MR post-creation\nRevisit navbar feature specs\nConfigurable banners in GitLab SaaS at Group level\nOptimize input-field for variables (make it resizable or add full-size-view)\n[Test] spec/features/explore/navbar_spec.rb | Explore navbar behaves like verified navigation bar renders correctly\n[Test] spec/features/dashboard/navbar_spec.rb | Your work navbar behaves like verified navigation bar renders correctly\nZoekt Beta Downtime notifications\n\"Path has already been taken\" error when trying to re-import Bitbucket Repositories into the same group\nImplement colorization for COBOL language\nSidebar cannot be collapsed\n[openapi] Origin is 'null' in api testing request\nUpdate defer_on_database_health_signal documentation\nAccessibility of Sign In Page and Support of Markdown\nMi página web indica que no existe\nnewly left sidebar is not user friendly , remove it asap make it as before\nIsolate\nGitlab::Database::LoadBalancing\ncode into\ngitlab-database-load_balancing\ngem\nNo longer able to edit/delete broadcast messages\nMigrate DOCS_URL_IN_EE_DIR to helpPagePath where possible\nMerge Request and To-Do List icons have moved to left hand side bar\ngroupUsersSearch doesn't return users with inherited membership\nSmartcard authentication question\nShow issue/epic navigation consistently in groups and projects\nMake GitLab.com use the CSP generated by the Rails app\nSet\nimporting\non objects through global context\nInquiry Regarding Loss of Approval Rights in Crowdin\nReplace success alerts with Toasts in user preferences\nFailure in ee/spec/lib/sidebars/groups/menus/analytics_menu_spec.rb | Sidebars::Groups::Menus::AnalyticsMenu Menu items Analytics dashboards is expected to eq /groups/group1/-/analytics/dashboards\nFailure in ee/spec/lib/sidebars/groups/menus/analytics_menu_spec.rb | Sidebars::Groups::Menus::AnalyticsMenu Menu items Analytics dashboards when the dashboards analytics feature is disabled is expected to eq /groups/group1/-/analytics/dashboards/value…\nGitHub AdvanceStageWorker should use\ngithub_importer\nqueue namespace\nDeprecation issue: Slack Notifications integration\nFailure in spec/models/lfs_download_object_spec.rb | LfsDownloadObject validations is expected to validate that :size looks like a number greater than or equal to 0\nAdd additional attributes (variables) to the Gitlab Changelog\nImprove \"Tutorial: Make a GitLab contribution\"\nAdd integration tests for validate Webhooks that require mutual TLS\nWhen AdvanceStage workers exhaust their retries, they should enact their timeout_strategy\nInconsistent navigation in branch sorting\nDraft - Run attachment and LFS Object stages in parallel with other stages\nDrop down dialog from left side bar overflows outside window boundaries\nDocs feedback: Mattermost integration doc Links broken\nI want to revert back to old navigation\nKeep the Keep sidebar visible and Hide sidebar buttons in the same place\ngitlab calls 500 for admin/application_settings/general Rack::Timeout::RequestTimeoutException (Request ran for longer than 60000ms ):\nAdding ascii characters to error messages guidelines\nFix attributes inheritance\nBuild an E2E test GitLab in Vue Compat in CI\nDocs feedback: Write your title\nAllow specifying diagram dimensions (or at least width/maxWidth) for Kroki diagrams in markdown\nLinks to the licenses and ToS are incorrect.\nQuestions for considerations when discussing importer framework\nUser menu opens partially off screen in gitlab UI\nClicking any help link automatically signs you out\nConsider responding with a 401 instead of 404 on unauthenticated request to\nGET /api/:version/project/:project_id_or_path/*\n[REGRESSION] Choice of preferred editor missing in UI\n[CSS Utilities WG] Disable arbitrary values\nMark moved issues as such also in the top pane\nAmbiguos doc for SaaS Gitlab.com slack integration\n\"Admin Area\" link in the sidebar uses the internal domain\nWhy strong_memoize_attr?\nJob timeout risk: spec/features/broadcast_messages_spec.rb ran much longer than expected\nFix target=\"blank\" occurrences for GlAvatarLink\nAllow differentiation between draft-merge-request and non-draft for notifications\nJob timeout risk: spec/features/nav/pinned_nav_items_spec.rb ran much longer than expected\nOption to revert to \"old navigation\" gone after update to gitlab omnibus 16.6.7\nThird-Party Clients List Needs Updating\nReplicate Github Release event trigger\nAdd mjs extension to eslint config\nCustomers feedback: update GitLab for Jira Cloud installation tab\n[Feature flag] Enable export_reduce_relation_batch_size\nAdd more triggers for autoflow\nContinue button in the Google Cloud IAM integration guided setup\nUnify handling logic for namespace settings parameters\n[Test] spec/lib/gitlab/import_export/project/relation_tree_restorer_spec.rb | Gitlab::ImportExport::Project::RelationTreeRestorer when inside a group behaves like import project successfully imported project has the project attributes and relations\nReplace terser gem with its JS alternative\n[Test] ee/spec/features/search/elastic/project_search_spec.rb | Project elastic search when zoekt is not enabled does not display exact code search is enabled\n[Test] spec/lib/gitlab/import_export/group/tree_restorer_spec.rb | Gitlab::ImportExport::Group::TreeRestorer excluded attributes does not allow override of excluded attributes\n[Test] spec/lib/api/helpers/integrations_helpers_spec.rb | API::Helpers::IntegrationsHelpers.integration_classes returns correct integrations\n[Test] spec/lib/gitlab/import_export/project/tree_restorer_spec.rb | Gitlab::ImportExport::Project::TreeRestorer behaves like project tree restorer work properly restore project tree JSON event at forth level of the tree event belongs to note, belongs …\n[Test] spec/lib/gitlab/import_export/group/tree_restorer_spec.rb | Gitlab::ImportExport::Group::TreeRestorer excluded attributes does not import root group path\n[Test] spec/features/search/user_searches_for_code_spec.rb | User searches for code when signed in no ref switcher shown in issue result summary\nAllow for more time-robust links to code\nSSL certificates issues on some GitLab hosted pages with custom domains\nStage with emoji are broken\n[Test] ee/spec/lib/ee/gitlab/import_export/project/tree_restorer_spec.rb | Gitlab::ImportExport::Project::TreeRestorer restores\nprotected_environments\nwith\ndeploy_access_levels\nis expected to eq 1\nReimplement AI Features as Agents\nPOC - Use a LLM to import configuration from other platforms into GitLab\nIntroduce external_link_icon helper and replace existing usages of sprite_icon('external-link')\nMicrosoft Teams integration ignores https_proxy setting\nAI Architecture v2\n[Test] ee/spec/lib/ee/gitlab/import_export/project/tree_restorer_spec.rb | Gitlab::ImportExport::Project::TreeRestorer boards has milestone associated with the issue board\n[Test] ee/spec/lib/ee/gitlab/import_export/project/tree_restorer_spec.rb | Gitlab::ImportExport::Project::TreeRestorer boards has milestone associated with the issue board list\nImporters: standardise import file validations\nFix modal accessible name errors\n[Test] spec/services/projects/import_service_spec.rb | Projects::ImportService#execute with valid importer when importer when lfs import fails logs the error\nUpdate maintainer trainee process\nFollow-up from \"Address style violations in project import specs\"\nUnship: Option to permit unauthenticated media viewing\nUnship: Option to hide default emoji reactions 👍 👎\nUnship: Option to avoid highlighting hidden unicode characters\nUnship: Next badge from navigation sidebar\n[Test] ee/spec/requests/search_controller_spec.rb | SearchController GET /search when elasticsearch is enabled for project scope behaves like an efficient database result avoids N+1 database queries\nMigrate\nalert-iconless-vue\nin\napp/assets/javascripts/sidebar/components/confidential/sidebar_confidentiality_content.vue\nMigrate\nsearch-input-vue\nin\napp/assets/javascripts/issues/show/components/fields/description_template.vue\nMigrate\ntable-tag-vue\nin\napp/assets/javascripts/vue_merge_request_widget/components/artifacts_list.vue\nMigrate\ntable-tag-vue\nin\nee/app/assets/javascripts/vue_merge_request_widget/components/approvals/approvals_list.vue\nMigrate\nform-textarea-native-vue\nin\napp/assets/javascripts/vue_merge_request_widget/components/states/commit_edit.vue\nMigrate\nform-textarea-native-vue\nin\napp/assets/javascripts/merge_conflicts/merge_conflict_resolver_app.vue\nRemove javascript code around\njs-toggle-lazy-diff\nFeedback issue for the guide for Adding a new relation to the direct transfer importer\nConsistent Backups: Create an architecture blueprint for local backups\nInvestigate need for linter on nullable fields in GraphQL\nExplain Failed Import via Duo Chat\nAdd crossorigin=\"use-credentials\" to manifest.json and opensearch.xml\nProvide a redirect warning when a link goes external sites\nBackgroundMigrationBaseClass cop should not complain if the parent class inherits from BatchedMigrationJob\nUsers invited from a group with maintainer max-role can create projects even if they are not maintainers on the invited group\nFurther \"Frontend Onboarding Course\" lessons\nImprove the support of NTFS in backup process\nOption to disable the emoji pop-up when typing \":\" semicolon\nDirect Transfer is not working with Cells 1.0\nDropdowns not closing during the peek behaviour\nAdd zoekt feature flags to application settings\n[UX] Border of gl-avatar is too close to image and is showing up even with a circle avatar\nMattermost Slash Commands integration not working with Cells 1.0\nDocumentation unclear for Pipeline status emails\n[Test] spec/lib/bulk_imports/common/graphql/get_members_query_spec.rb | BulkImports::Common::Graphql::GetMembersQuery behaves like a valid Direct Transfer GraphQL query does not use any deprecated GraphQL schema\nUse\nGlKeysetPagination\nin\napp/assets/javascripts/analytics/cycle_analytics/components/stage_table.vue\nUse\nGlKeysetPagination\nin\napp/assets/javascripts/ci/artifacts/components/job_artifacts_table.vue\nUse\nGlKeysetPagination\nin\napp/assets/javascripts/ci/pipeline_schedules/components/pipeline_schedules.vue\nUse\nGlKeysetPagination\nin\napp/assets/javascripts/clusters_list/components/agent_table.vue\nUse\nGlKeysetPagination\nin\napp/assets/javascripts/diffs/components/app.vue\nUse\nGlKeysetPagination\nin\napp/assets/javascripts/error_tracking/components/error_tracking_list.vue\nUse\nGlKeysetPagination\nin\napp/assets/javascripts/organizations/activity/components/app.vue\nUse\nGlKeysetPagination\nin\napp/assets/javascripts/vue_shared/components/paginated_table_with_search_and_tabs/paginated_table_with_search_and_tabs.vue\nUse\nGlKeysetPagination\nin\nee/app/assets/javascripts/analytics/merge_request_analytics/components/throughput_table.vue\nUse\nGlKeysetPagination\nin\nee/app/assets/javascripts/audit_events/components/audit_events_table.vue\nUse\nGlKeysetPagination\nin\nee/app/assets/javascripts/iterations/components/iteration_report_issues.vue\nUse\nGlKeysetPagination\nin\nee/app/assets/javascripts/requirements/components/requirements_root.vue\nUse\nGlKeysetPagination\nin\nee/app/assets/javascripts/security_dashboard/components/pipeline/security_dashboard_table.vue\nObject-storage files downloaded via API from browser do not have correct file name and extension\nGroups and subgroups seeding rake task is broken\nDiscussion: Popover hints\nBilling item missing from nav inventory\nAudit date format usage in app/assets/javascripts/packages_and_registries/package_registry/components/details/package_title.vue\nAudit date format usage in app/assets/javascripts/packages_and_registries/container_registry/explorer/components/details_page/tags_list_row.vue\nAudit date format usage in app/assets/javascripts/analytics/usage_trends/utils.js\n[Test] spec/lib/gitlab/import_export/project/relation_tree_restorer_spec.rb | Gitlab::ImportExport::Project::RelationTreeRestorer when inside a group behaves like import project successfully imported project assigns the correct import source\nList group users API (experiment) returns 403 error\nSet sharding keys for feature category\nintegrations\ntables\nAdd accessible syntax highlighting themes\nExtend Direct Transfer API endpoints to allow for broader queries based on group and/or project IDs\nFlaky Test at spec/models/integrations/beyond_identity_spec.rb\nRescue from\nAccessDeniedError\nin GraphQL consistently\nWebhook Job event payload is incomplete\napi_json log doesn't track API requests during database issues\nMicrosoft Teams notifications Integration setting \"Notify only broken pipelines\" does not generate teams notification\nPull base set of attributes into\nBaseImporter\nCreate a rate limit module for GraphQL API\nAudit date format usage in /ee/app/assets/javascripts/on_demand_scans/constants.js\nAudit date format usage in /app/assets/javascripts/observability/utils.js\nAudit date format usage in /app/assets/javascripts/analytics/cycle_analytics/utils.js\nAudit date format usage in /app/assets/javascripts/admin/broadcast_messages/components/datetime_picker.vue\nAudit date format usage in /ee/app/assets/javascripts/on_demand_scans_form/components/scan_schedule.vue\nAudit date format usage in /app/assets/javascripts/issuable/popover/components/milestone_popover.vue\nAudit date format usage in /ee/app/assets/javascripts/usage_quotas/pro duct_analytics/components/utils.js\nAudit date format usage in /ee/app/assets/javascripts/compliance_dashboard/components/violations_report/report.vue\nAudit date format usage in /app/assets/javascripts/vue_shared/components/filtered_search_bar/tokens/daterange_token.vue\nAudit date format usage in /ee/app/assets/javascripts/tracing/details/tracing_header.vue\nAudit date format usage in /ee/app/assets/javascripts/usage_quotas/product_analytics/components/group_usage/product_analytics_group_usage_overview.vue\nAudit date format usage in /ee/app/assets/javascripts/logs/list/logs_drawer.vue\nAudit date format usage in /ee/app/assets/javascripts/issuable/popover/components/epic_popover.vue\nAudit date format usage in /ee/app/assets/javascripts/security_configuration/dast_profiles/components/dast_scan_schedule.vue\nAdd slash command to prompt Duo Chat in Slack\nGitLab Status Microsoft Teams subscription webhook payload does not match required adaptive card schema\nHarbor integration doesn't properly encode special characters in passsword\nFeautre Request: Integration GitLab for Slack App configure tag trigger\nFeautre Request: Integration GitLab for Slack App add release as trigger\nFollowup: Why do we have avatar.scss in gitlab?\nProposal: migrating to using design tokens in the product\n[Test] ee/spec/features/search/elastic/group_search_spec.rb | Group elastic search redactions behaves like a redacted search results page behaves like redacted search results page assertions when logged in redacts private features the user does not hav…\nStart using new table for instance integrations (using feature flag)\nRemove instance integrations from old table\nSet not null constraint on multiple columns (namespace_id/project_id)\n[Test] spec/lib/search/group_settings_spec.rb | Search results for group settings behaves like all group settings sections exist and have correct anchor links has only valid settings sections\n[Test] ee/spec/lib/ee/search/group_settings_spec.rb | Search results for settings behaves like all group settings sections exist and have correct anchor links has only valid settings sections\nCreate System Note for imported resource events - Gitea\n[Test] ee/spec/features/search/elastic/group_search_spec.rb | Group elastic search redactions behaves like a redacted search results page behaves like redacted search results page assertions when not logged in redacts private features the user does not…\nIn-product feature for time off coverage\nUI shows slack integration is \"inactive\" when there isn't an integration present\nManifest import: misleading path in status table when user cannot create top level groups\nRemove ProjectExportWorker following global enablement of parallel project export\nError when importing project with iteration cadence\nExperiment: Zoekt uses a reranking model\nFind Gaps in Improved User Mapping Logging\nExpose Global IDs in REST API\nFollow-up from \"Show pending placeholder assignment notice\"\nUpdate the golang for the zoekt_indexer\nFeature Request: Improve UX for Logged Out Users by Providing Clear Messaging and Visual Cues\nPremium\nUltimate\nPossible micro-interaction\nDocs feedback: the default Workflow doesnt work in MS Teams\n[Test] ee/spec/features/search/elastic/group_search_spec.rb | Group elastic search when searching for all scopes except issues and epics finds all the scopes\nDefine standard event schema for \"fat\" events\n[Test] ee/spec/features/search/elastic/global_search_spec.rb | Global elastic search I search through the issues and I see pagination has a pagination\n[Test] spec/features/groups/integrations/group_integrations_spec.rb | Group integrations behaves like integration settings form displays all the integrations\n[Test] spec/features/admin/integrations/instance_integrations_spec.rb | Instance integrations behaves like integration settings form displays all the integrations\n[Test] spec/features/projects/integrations/project_integrations_spec.rb | Project integrations behaves like integration settings form displays all the integrations\nGathering Plan-specific UX paper cuts for Q4 FY25\nReduce Direct Transfer jobs execution duration\n[Test] ee/spec/features/search/elastic/project_search_redactions_work_item_spec.rb | Project elastic search redactions work_item behaves like a redacted search results page behaves like redacted search results page assertions when logged in redacts pri…\n[Test] ee/spec/features/search/elastic/project_search_redactions_work_item_spec.rb | Project elastic search redactions work_item behaves like a redacted search results page behaves like redacted search results page assertions when logged in when work_i…\n[Test] ee/spec/features/search/elastic/project_search_redactions_work_item_spec.rb | Project elastic search redactions work_item behaves like a redacted search results page behaves like redacted search results page assertions when not logged in redacts…\n[Test] ee/spec/features/search/elastic/project_search_redactions_work_item_spec.rb | Project elastic search redactions work_item behaves like a redacted search results page behaves like redacted search results page assertions when not logged in when wo…\n[Test] ee/spec/features/search/elastic/group_search_spec.rb | Group elastic search redactions behaves like a redacted search results page behaves like redacted search results page assertions when logged in when work_items are public redacts other priva…\nUpdate LegacyGithubImport to be solely for Gitea\n[Test] ee/spec/lib/gitlab/elastic/group_search_results_spec.rb | Gitlab::Elastic::GroupSearchResults for group level work items finds all examples\n[Test] ee/spec/features/search/elastic/group_search_spec.rb | Group elastic search redactions behaves like a redacted search results page behaves like redacted search results page assertions when not logged in when work_items are public redacts other p…\nDefine custom settings for UI notifications\nDirect Transfer: Investigate whether we can use\ndata_consistency: :delayed\nin the workers\nUpdate gitlab storybook for components in app/assets/javascripts/vue_shared/components/pagination_bar\nShift validations in Integrations::Base::Integration to models\nFollow-up from \"Delete todos of deleted SSH keys\"\nCreate importer for AWS CodeCommit repos\nGraphQL query using API and pagination is receiving an HTTP status of 503\nCertain parameters which should be able to be altered through the API are not updating properly.\nAdd analytics instrumentation for allow-listed integrations\nFeedback on \"Direct Transfer User Contribution Mapping\"\nAdd linting rules for design tokens\nDocument Performance bar warnings\nRefactor bitbucket server representations to refer to actor in consistent manner\n[Test] spec/services/projects/import_service_spec.rb | Projects::ImportService#execute with valid importer when importer does not have a custom repository importer downloads lfs objects\n[Test] ee/spec/features/search/elastic/project_search_spec.rb | Project elastic search searching finds issues\nUpgrade swagger-ui-dist dependency to the latest\nFeedback on \"Allow all autodisabled webhooks to self-heal\" feature\n[Test] spec/lib/search/project_settings_spec.rb | Search results for project settings behaves like all project settings sections exist and have correct anchor links has only valid settings sections\nHandle interrupted jobs gracefully in Project Import/Export\n[Test] browser_ui/1_manage/migration/gitlab_migration_user_contribution_reassignment_spec.rb | Manage Gitlab migration with user contribution reassignment reassigns placeholder users in issues and merge requests after reassignment\n[Test] ee/spec/lib/ee/search/project_settings_spec.rb | Search results for project settings behaves like all project settings sections exist and have correct anchor links has only valid settings sections\nFollow-up from \"Update CI & monitoring integrations to use shared modules\"\nAllow users to use\n!\nas a delimiter to search and insert MR references into Duo chat\ngl-text-subtle in app/assets/javascripts/content_editor/components/content_editor.vue\ngl-text-subtle in app/assets/javascripts/super_sidebar/components/organization_switcher.vue\nuse GlEmptyState component in ee/app/assets/javascripts/security_configuration/dast_profiles/dast_profiles_drawer/dast_profiles_drawer_empty_state.vue\nLint against setting display mode on components\nEvaluate work items to-do list filter\n[Test] ee/spec/lib/gitlab/elastic/search_results_visibility_levels_spec.rb | Gitlab::Elastic::SearchResults visibility_levels visibility levels issues behaves like issues respect visibility when different issue descriptions finds all examples\n[Test] ee/spec/lib/gitlab/elastic/search_results_visibility_levels_spec.rb | Gitlab::Elastic::SearchResults visibility_levels visibility levels issues when search_uses_match_queries flag is false behaves like issues respect visibility when different is…\nGitea importer does not import all comments on Issues or PRs\n[Test] ee/spec/services/elastic/process_bookkeeping_service_spec.rb | Elastic::ProcessBookkeepingService#execute for N+1 queries does not have N+1 queries for notes\nVector store comparison\nIcons with fill class can have problems since gl-icon uses currentColor which uses color over fill\nctrl + Enter : identical behaviour in all input fields\nRe-compose NewIssueDropdown messages to support localizability\nProps not correctly traversed on extended components under Vue 3\n[Wiki] Sidebar: Create guidance for sidebar styling in dark mode (borders, surfaces)\nImport/Export Orphaned uploads causing verification failures\nCreate super sidebar specific apollo provider\nAssess curl commands on API pages\nRequire explicit reason to use mount instead of shallowMount in Vue specs\nLocalizability issues for various high-visibility strings\nJob timeout risk: spec/features/projects/integrations/user_activates_issue_tracker_spec.rb ran much longer than expected\nRe-compose Work Item Quick Action: Blocks and Blocked_by UI message to support localizibility\nSupport custom email templates for notifications\n[Feature flag] Cleanup bitbucket_server_user_mapping\nBitbucket Server Importer - Use user object info for merged event imports\nTrack group level activity for user contribution calendar\n[Test] spec/lib/bulk_imports/projects/pipelines/snippets_repository_pipeline_spec.rb | BulkImports::Projects::Pipelines::SnippetsRepositoryPipeline#run when a snippet matches when snippet url is valid creates snippet repo\nGroup#execute_hooks should automatically execute system hooks\nDraft: Copied and adjusted code from Bootstrap Vue components\n[Webhook: Project, group, instance] Section shouldn't be nested within a section.\n[Direct transfer: Project list/overview] Explore alternative layouts for \"New group\" column\n[Test] spec/lib/bulk_imports/projects/pipelines/snippets_repository_pipeline_spec.rb | BulkImports::Projects::Pipelines::SnippetsRepositoryPipeline#run when a snippet matches when snippet url is valid skips already cached snippets\njira_auth_type required for Jira Integration Resource\nAdd missing foreign keys\nDirect transfer - Importing multiple groups without selecting the destination parent group causes error\nSingle commit API returns wrong\nlast_pipeline\nwith wrong\nref\nMerge Request Events Webhook: CODEOWNERS approval rules missing from initial MR open event\nPremium\n[Feature flag] Enable import_vulnerabilities\nUser Contribution Mapping - Improve Download CSV UI for when there are no placeholders\nFeature Request: graphql return using_license_seat as part of the response for premium and ultimate instances\nDefine a data strategy for homepage team updates\nSmoke tests for instances running OpenSearch and postgres\n[Test] ee/spec/lib/ee/gitlab/import_export/project/tree_restorer_spec.rb | Gitlab::ImportExport::Project::TreeRestorer vulnerabilities when import_vulnerabilities feature flag is disabled does not restore vulnerabilities\nFix console errors about insights_chart component stories in vue_shared\nTrigger a test group webhook API gives unexpected 422 when IP access is restricted\nUpdate YouTrack integration copyright year\ncustom role with specific permissions required for AWS CodePipeline\nGuidance on which vector store to select\n[Test] ee/spec/features/projects/new_project_spec.rb | New project with premium license creates a new project in personal namespace\nEnsure Bitbucket Cloud PR notes importer is retriable\nDocs feedback: Google Cloud integration docs don't have exhaustive descriptions of how to use federated workload in pipelines\n[Feature flag] Enable zoekt_rollout_worker\nFollow-up from \"Add AI ActiveContext collection table\"\ngroup::import and integrate - HTTP 500 errors from DB statement timeout\nGraphQL doesn't return projects for one particular user\n[Search results] Use GlSearchboxByClick to have correct styles, and improve usability\n[Test] spec/features/projects/import_export/export_file_spec.rb | Import/Export - project export integration test admin user exports a project successfully\nSentry connection is not updating projects list\nReview and update development docs for Direct Transfer\n[Test] ee/spec/features/search/elastic/project_search_spec.rb | Project elastic search searching finds wiki pages\nLDAP attributes are migrated on import when LDAP is not configured on target instance\nInvestigate and design a REST-to-GraphQL API Bridge\nIntroduce lifecycle annotations for REST APIs and expand annotations for GraphQL\nMove relevant Importer FAQ's topics to public documentation\nBetter guide & educate customer choice in API - collect of case studies of where choice of REST vs GraphQL improved customer efficiency\nAPI Token permission issue\nproper syntax to Post a new Requirement under \"Requirements\" using API Post\nopenapi.yaml: delete, deprecate, or redirect?\nCreate new merge request thread API not working for multiline comments\nSelf-rotate endpoint for group access tokens returns 401\nGitLab does not accept @vfemail.net email addresses even though they're OK\nadmin/groups - List Navigator disappears on last page\nFollow-up from \"Fix broken Direct Transfer spec\"\nInvestigate feature flagging asset builds\nAllocate IIDs on GitHub Importer\nAllocate IIDs on Gitea Importer\nAllocate IIDs on Bitbucket Cloud Importer\nAllocate IIDs on Bitbucket Server\nAllocate IIDs on Direct Transfer\nAllocate IIDs on Import/Export\nAllocate IIDs on Fogbuz Importer\nUpdate GitHub import failures page to have consistent URL structure\nMigrate\napp/assets/javascripts/import_entities/import_groups/components/import_table.vue\nto to GlDisclosureDropdown or GlCollapsibleListbox\nMigrate\napp/assets/javascripts/jira_import/components/jira_import_form.vue\nto to GlDisclosureDropdown or GlCollapsibleListbox\nActiveContext: invalidate current adapter active connection changes\nDraft - Direct Transfer - Allow the user to customize the number of concurrent migrated entities\nRemove jira-ruby gem\nRemove octokit gem\nDirect Transfer - Remove old user mapping code\nGitea - Remove old user mapping code\nAPI documentation about pending members (both listing or approval is outdated)\nGitLab docs guide: \"Using GitOps - Connect Kubernetes cluster\" is not working properly.\nWebhook for tag_push event don't send \"ref\" with the tag name\nhow get blob from image attached in the issue\n/api/v4/projects/{project_id}/access_tokens search is not working\nNavigation proposal - Add import history to Your Work\nAPI: dedicated endpoint for issue promotion\nAPI: dedicated endpoint to delete avatars\nAPI: missing group service account PAT query endpoints\nAPI: missing group and project webhook queries for custom headers and url variables\nAPI: missing deletion for group approval rules\nAPI: issue reordering should be a POST endpoint\nAPI: resetting MR approvals should be a POST endpoint\nAPI: deleting merged branches should be a POST, not PUT\nTrack 'update_source_user_count' when all placeholders are kept as placeholders\nUI Feature Request\nWhen importing project with issues, the users are incorrectly set up\nAsana integration broken due to new Asana task link format\nRemove all\nembeddings\ndatabase config from GitLab/CNG/Omnibus\nAPI: project access token API does not support\nself\ntoken_id\n[Test] spec/models/integrations/pivotaltracker_spec.rb | Integrations::Pivotaltracker behaves like Integrations::Base::Pivotaltracker Execute posts correct message\n[Test] spec/models/integrations/pivotaltracker_spec.rb | Integrations::Pivotaltracker behaves like Integrations::Base::Pivotaltracker Execute when allowed branches is specified posts message if branch is in the list\n[Test] spec/lib/gitlab/octokit/url_validation_spec.rb | Gitlab::Octokit::UrlValidation#call when the URL is a public URL with failed address check behaves like Blocked URL raises an error\nPossible system email paper cuts\nGoogle Chat webhook integration failing to create new threads\nGitlab API bug - does not return more than 1000 changed files\nSelf-rotating a group/personal access token that has already been rotated results in the newly rotated token being revoked as well\nTrack placeholder reassignment method\nUsing Releases API create results in error: did not find expected alphabetic or numeric character while scanning an anchor at line 12 column 55}\nMultiline comments API does not work as expected despite following documentation\nAdd not null constraint on project_id/group_id/organization_id to issue_tracker_data, zentao_tracker_data, jira_tracker_data tables\nAdd not null constraint on project_id/group_id/organization_id to slack_integrations_scopes, slack_integrations tables\n[Feature flag] Rollout of\nactivity_stream_graphql\nAudit events for project and group export download\nSet the organization_id for ServiceHooks\nOpenid_connect undefined method\nBuild the saved views GraphQL API create/update/query\nProjects API returns empty results when combining search and owned=true parameters\nService Account Display Name Update via API (PATCH) Returns 404\nAdd get/delete/update API methods for instance deploy keys\nSAML API incorrectly responds with \"access_level does not have a valid value\"\nNew API Endpoint: Programmatically Add Authentication Identity for Users\nDiscord Notifications - feature proposal: Support releases as Discord trigger\nRequire descriptions for GraphQL types, input objects, and enums, enforced with Rubocop\nUser contribution mapping: Reassignment of placeholder users to real users is stuck\n[Test] spec/helpers/sidebars_helper_spec.rb | SidebarsHelper#super_sidebar_context context switcher persistent links when user is an admin when application setting :admin_mode is enabled when admin mode is on returns public links, admin area and leave …\nCreate issues from vulnerabilities programmatically (via APIv4 or GraphQL API)\nConsider creating\nwaitForFinalTick\nhelper, or similar\nImprove checking Graphql/Descriptions cop for runtime values\nMutation.vulnerabilityCreate does not respect given detectedAt time\nInconsistency in handling dates in the commit log screen\nApply auto-disabling webhooks to System Hooks\nApply rate limiting to System Hooks\nEnsure BulkImports::Tracker and BulkImports::Failure keep the same sharding key as BulkImports::Entity\nImprove global search sidebar filter UX consistency\nBadge Counter UX: Moving from Numbers to Meaningful Indicators\nMR approval endpoint fails with 401 authz error for non-authz problem\nAllow proxy authentication for webhooks\nReintegrate CopsDocumentationGenerator changes to the upstream RuboCop repo\nRemove or implement the \"Version Added\" and \"Version Changed\" table columns in the RuboCop documentation site\nMove\nrubocop:docs\nrake task components to their own class\nConfusing UI/UX of Jira Integration Settings\nFollow-up from \"Update grape gem to 2.1.0\"\nRequest reassignment by using a CSV file Call to Action Confusing for SaaS Customers\nPremium\nUltimate\nAllow full name customization for group or project access token bot users on GitLab.com SaaS\nMove web_hook_test_api_endpoint_rate_limit FF to setting\nMove web_hook_event_resend_api_endpoint_rate_limit FF to setting\nInconsistent reponses in merge request API\nInvestigate including all MR diffs in import/export\nRequest: a common payload attribute across all webhook payloads\nManual\ndeploy\nphases are reported to JIRA\nGitLab mouse clicks should register on mouseup, not mousedown\njira_import_stuck_jira_import_jobs cron schedule not configured as intended\n.ico favicon messed up on merge requests\nImprove integration between Gitlab and TargetProcess\nGitLab for Jira app improve initial sync: Sync pipelines\nGitLab for Jira app improve initial sync: Sync deployments\nGitLab for Jira app improve initial sync: Sync feature flags\nProvide the capability to exclude specific attributes from a webhook payload\nProject export checksum\nGroup CICD variable created via REST API with param\nmasked_and_hidden=false\nis created as masked and hidden\nCreate issue from slack thread\nOpenAPI documentation generation with registry enabled causes contributor pipeline failures\nDark mode > illustration_sprite component\nDark mode > Replace illustrations with sprite illustrations\nAdd\nProject visibility\nicon to breadcrumbs\nIntegration.default_integration should be returning nil if integration is not enabled at group, or instance level\nNo default selection of destination namespace when importing with GH, BB ad Gitea\n[Test] spec/services/bulk_imports/process_service_spec.rb | BulkImports::ProcessService#execute when tracker configuration has a maximum version defined when the source instance version is a patch version creates trackers with the same status as the no…\nAdd specs for WebHooks::LogExecutionWorker\nImprove Jira Integration Terminology and Behavior in Merge Requests\n[Test] ee/spec/features/search/elastic/snippet_search_spec.rb | Snippet elastic search when header search when searching titles behaves like expected snippet search results as anonymous user when global_search_block_anonymous_searches_enabled is enable…\nOption\ncomment_on_event_enabled: false\nnot recognized when using API endpoint\n/api/v4/groups/$GROUP_ID/integrations/jira\nCrudComponent #count slot should replace count instead of appending to it\nSupport configuring Integrations on group/instance level via API\nDevise an approach to properly sequence issue relative_positions after Direct Transfer\nCannot Fork via API\nWork item webhook payload does not contain item type\nTest that new UI components are rendered when\nnew_project_creation_form\nFF is enabled\nPinned tabs do not remember their URLs\nGo Module Proxy Fails to Serve Correct Metadata for Nested Subprojects (Still Present in 17.10.3-ee)\nConfigurable Base URL for the Jira Cloud App\nOffline transfer - remove export tool from architecture\nGCP Federation Identity Integration does not authorise docker image pull from a private GCP registy\nUnable to set developer_can_initial_push and allow_force_push during group creation via API\nDelete mirror via API\nDocs: Gitlab Google Integration Tutorial refers to non existent option\nGitLab for Jira Cloud App Sync Delay\nGitLab for Jira Cloud integration sends wrong enviroment name to Jira\nAllow mapping/reassignment from placeholder-users to serviceaccounts\nCreate new offline transfer API endpoint to begin offline import\nUpdate BulkImports::Configuration to support offline transfer config\nCreate object storage client for offline transfer\nUpdate NdjsonExtractor to support file extraction from object storage in offline transfer\nUpdate direct transfer stages to support offline transfer\nHost SSH Public Key via REST API\nWeb Commit API includes embedded newlines\nUtilize\nuser_contribution.ndjson\nfor Offline Transfer\nGitlab for Slack Deployment messages should include the Tag name/description if present and link to Environment\n404 error in Repository files API when use URL-encoded project ID\nProject importer hangs when importing from BitBucket with an access token.\nTitle change system notes should be moved to resource_*_events\nUser cap settings to be available at group level for self managed instances\nAbility to not create placeholder users when importing a project\nDocs: (undocumented) webhook\npush_events\nenabled by default when using the API\nUpdate Bitbucket Cloud importer to use Gitlab::HTTP\nCreate file-based pipeline for BulkImports::Projects::Pipelines::SnippetsRepositoryPipeline\nCreate file-based pipeline for BulkImports::Projects::Pipelines::ProjectPipeline\nCreate file-based pipeline for BulkImports::Groups::Pipelines::IterationsPipeline\nCreate file-based pipeline for BulkImports::Groups::Pipelines::ProjectEntitiesPipeline\nCreate file-based pipeline for BulkImports::Groups::Pipelines::GroupPipeline\nCreate file-based pipeline for BulkImports::Common::Pipelines::BadgesPipeline\nCreate file-based pipeline for BulkImports::Common::Pipelines::MembersPipeline\nSystem hook when inviting a group to a project or group\n[Test] spec/lib/gitlab/background_migration/backfill_jira_tracker_data_project_keys_spec.rb | Gitlab::BackgroundMigration::BackfillJiraTrackerDataProjectKeys updates project_keys values only for integrations with project_key and without project_keys\nAdd organization/project/group id presence validation to issue/zentao/jira tracker data tables once all records are backfilled\nExtract API tests against escaped project full path into shared example\nCreate file-based pipeline for BulkImports::Common::Pipelines::WikiPipeline\nCreate offline transfer pipeline for BulkImports::Projects::Pipelines::RepositoryBundlePipeline\nCreate offline transfer pipeline for BulkImports::Common::Pipelines::LfsObjectsPipeline\nCreate offline transfer pipeline for BulkImports::Common::Pipelines::UploadsPipeline\nCreate file-based pipeline for BulkImports::Groups::Pipelines::SubgroupEntitiesPipeline\nExport group and project members to NDJSON for offline transfer\nAdd notice in the UI that reassignment is restricted to enterprise users\nPremium\nUltimate\nAccessing the MR commits API endpoint from a CI job\nAPI inconsistency /snippets and /projects\nVerifiy GitHub noreply Email Address with Connected Account\nIncorrect Inheritance of 'only_allow_merge_if_pipeline_succeeds' in Project API\n[Feedback] Advanced search for issues includes issue comments\nContent created through project template, or custom template, recorded as imported from file-based import\nIssues from a Customer Issue Tracker from the same GitLab instance should reference automatically\nDocument/implement different states for reordering components\nIssue with REST API PIPELINES ref query option\nFF cleanup: Remove 'group_import_history_visibility' wip flag\nColumn integrations.organization_id should be ready for Cells 1.0\nFollow-up from \"Add reusable TokenValidityBadge component\"\nParse variables set in\nrun\nSlack slash command into CI variables\nRuby nil bug on project creation with different namespace ids\nProvide a way to create Jira issue when there is a merge conflict\nChange the Order of Page Titles in Browser Tabs\nSkip importing AwardEmoji for custom emoji which don't exist on the target instance\nThe new endpoint of GitLab doesn't allow the underlying page to check whether the page is still open during an OAuth flow\nMove notification action from ee/app/services/epics/close_service.rb#L34-34 to use event store\nMove notification action from ee/app/workers/new_epic_worker.rb#L19-20 to use event store\nMove notification action from ee/app/services/epics/reopen_service.rb#L32-33 to use event store\nMove todo action from ee/app/services/epics/update_service.rb#L52-53 to use event store\nMove todo action from ee/app/services/epics/update_service.rb#L81-82 to use event store\nMove todo action from ee/app/services/epics/update_service.rb#L91-92 to use event store\nMove todo action from ee/app/services/epics/update_service.rb#L92-93 to use event store\nMove todo action from ee/app/services/epics/update_service.rb#L71-71 to use event store\nMove todo action from ee/app/services/epics/update_service.rb#L81-81 to use event store\nMove todo action from app/services/keys/expiry_notification_service.rb#L45-45 to use event store\nMove todo action from app/services/keys/expiry_notification_service.rb#L49-50 to use event store\nMove notification action from app/services/keys/expiry_notification_service.rb#L33-33 to use event store\nMove notification action from app/services/keys/expiry_notification_service.rb#L39-40 to use event store\nMove todo action from ee/app/services/gitlab_subscriptions/user_add_on_assignments/base_create_service.rb#L61-62 to use event store\nMove todo action from ee/app/services/gitlab_subscriptions/user_add_on_assignments/base_create_service.rb#L62-63 to use event store\nMove todo action from app/models/member.rb#L668-668 to use event store\nMove notification action from app/models/member.rb#L664-664 to use event store\nMove todo action from app/services/alert_management/alerts/update_service.rb#L108-108 to use event store\nMove todo action from app/services/alert_management/alerts/update_service.rb#L131-132 to use event store\nMove notification action from app/services/draft_notes/publish_service.rb#L55-55 to use event store\nMove notification action from app/services/merge_requests/resolved_discussion_notification_service.rb#L10-10 to use event store\nMove notification action from app/services/merge_requests/handle_assignees_change_service.rb#L17-17 to use event store\nMove todo action from app/services/merge_requests/handle_assignees_change_service.rb#L19-19 to use event store\nMove notification action from app/services/merge_requests/base_service.rb#L81-81 to use event store\nMove todo action from app/services/merge_requests/base_service.rb#L82-82 to use event store\nMove todo action from app/services/merge_requests/base_service.rb#L315-315 to use event store\nMove todo action from app/services/issuable_base_service.rb#L471-471 to use event store\nMove todo action from app/services/issues/after_create_service.rb#L4-4 to use event store\nMove notification action from app/workers/new_issue_worker.rb#L25-25 to use event store\nMove todo action from app/services/issues/update_service.rb#L51-52 to use event store\nMove todo action from app/services/issues/update_service.rb#L56-56 to use event store\nMove todo action from app/services/issues/update_service.rb#L75-75 to use event store\nMove todo action from app/services/issues/update_service.rb#L82-83 to use event store\nMove todo action from app/services/issues/update_service.rb#L183-183 to use event store\nMove notification action from app/services/issues/update_service.rb#L193-193 to use event store\nMove notification action from app/services/issues/update_service.rb#L201-201 to use event store\nMove notification action from app/services/issues/update_service.rb#L74-74 to use event store\nMove todo action from app/services/issues/close_service.rb#L49-49 to use event store\nMove notification action from app/services/issues/close_service.rb#L48-48 to use event store\nMove todo action from app/services/issues/close_service.rb#L76-76 to use event store\nMove todo action from app/services/members/base_service.rb#L57-57 to use event store\nMove todo action from app/services/members/base_service.rb#L64-65 to use event store\nMove todo action from app/services/members/base_service.rb#L64-65 to use event store\nMove todo action from app/services/merge_requests/add_todo_when_build_fails_service.rb#L11-11 to use event store\nMove todo action from app/services/merge_requests/add_todo_when_build_fails_service.rb#L24-24 to use event store\nMove todo action from app/services/merge_requests/after_create_service.rb#L41-42 to use event store\nMove notification action from app/services/merge_requests/after_create_service.rb#L36-36 to use event store\nMove todo action from app/services/merge_requests/close_service.rb#L20-20 to use event store\nMove notification action from app/services/merge_requests/close_service.rb#L19-19 to use event store\nMove todo action from app/services/merge_requests/post_merge_service.rb#L22-22 to use event store\nMove notification action from app/services/merge_requests/post_merge_service.rb#L28-28 to use event store\nMove todo action from app/services/merge_requests/refresh_service.rb#L226-227 to use event store\nMove notification action from app/services/merge_requests/refresh_service.rb#L280-280 to use event store\nMove notification action from app/services/merge_requests/request_review_service.rb#L35-35 to use event store\nMove todo action from app/services/merge_requests/request_review_service.rb#L36-36 to use event store\nMove todo action from app/services/merge_requests/update_service.rb#L40-40 to use event store\nMove todo action from app/services/merge_requests/update_service.rb#L36-37 to use event store\nMove notification action from app/services/merge_requests/update_service.rb#L176-176 to use event store\nMove notification action from app/services/merge_requests/update_service.rb#L188-188 to use event store\nMove notification action from app/services/merge_requests/update_service.rb#L262-262 to use event store\nMove todo action from app/services/notes/create_service.rb#L102-102 to use event store\nMove notification action from app/workers/new_note_worker.rb#L21-21 to use event store\nMove todo action from app/services/notes/update_service.rb#L92-92 to use event store\nMove todo action from app/services/merge_requests/update_reviewers_service.rb#L18-18 to use event store\nMove notification action from app/models/merge_request.rb#L290-290 to use event store\nMove todo action from app/models/merge_request.rb#L293-293 to use event store\nMove todo action from app/services/alert_management/alerts/todo/create_service.rb#L17-17 to use event store\nMove todo action from app/services/award_emojis/add_service.rb#L29-29 to use event store\nMove todo action from app/services/discussions/resolve_service.rb#L58-58 to use event store\nMove notification action from app/services/discussions/resolve_service.rb#L48-48 to use event store\nMove notification action from app/services/keys/create_service.rb#L16-16 to use event store\nMove todo action from app/services/notes/destroy_service.rb#L6-6 to use event store\nMove todo action from app/services/notes/update_service.rb#L101-101 to use event store\nMove todo action from app/workers/merge_requests/resolve_todos_after_approval_worker.rb#L29-29 to use event store\nMove todo action from ee/app/services/ee/notification_service.rb#L92-92 to use event store\nMove todo action from ee/app/services/system_notes/merge_train_service.rb#L27-27 to use event store\nMove todo action from ee/app/services/system_notes/merge_train_service.rb#L54-54 to use event store\nMove todo action from ee/app/workers/okrs/checkin_reminder_emails_cron_worker.rb#L32-32 to use event store\nMove notification action from ee/app/workers/okrs/checkin_reminder_emails_cron_worker.rb#L33-33 to use event store\nMove notification action from app/services/merge_requests/refresh_service.rb#L280-280 to use event store\nMove notification action from app/models/member.rb#L681-681 to use event store\nMove notification action from app/models/member.rb#L689-689 to use event store\nMove notification action from app/models/member.rb#L693-693 to use event store\nMove notification action from app/services/auto_merge/merge_when_checks_pass_service.rb#L73-73 to use event store\nMove notification action from app/services/groups/import_export/export_service.rb#L131-131 to use event store\nMove notification action from app/services/groups/import_export/export_service.rb#L142-142 to use event store\nMove notification action from app/services/issuable/callbacks/milestone.rb#L74-74 to use event store\nMove notification action from app/services/issuable/callbacks/milestone.rb#L76-76 to use event store\nMove notification action from app/services/issues/clone_service.rb#L102-102 to use event store\nMove notification action from app/services/issues/reopen_service.rb#L25-25 to use event store\nMove notification action from app/services/merge_requests/execute_approval_hooks_service.rb#L7-7 to use event store\nMove notification action from app/services/merge_requests/reopen_service.rb#L14-14 to use event store\nMove notification action from app/services/releases/create_service.rb#L85-85 to use event store\nMove notification action from app/models/project.rb#L2022-2022 to use event store\nMove notification action from app/services/issues/move_service.rb#L194-194 to use event store\nMove notification action from app/services/work_items/data_sync/widgets/notifications.rb#L60-60 to use event store\nMove notification action from app/services/work_items/data_sync/widgets/notifications.rb#L61-61 to use event store\nMove notification action from lib/gitlab/import_export/after_export_strategies/download_notification_strategy.rb#L15-15 to use event store\nMove notification action from app/services/projects/import_export/export_service.rb#L162-162 to use event store\nMove notification action from app/services/projects/import_export/parallel_export_service.rb#L86-86 to use event store\nMove notification action from app/workers/projects/import_export/wait_relation_exports_worker.rb#L77-77 to use event store\nMove notification action from app/workers/pipeline_notification_worker.rb#L28-28 to use event store\nMove notification action from app/services/pages/domains/obtain_lets_encrypt_certificate_service.rb#L69-69 to use event store\nMove notification action from app/workers/mail_scheduler/issue_due_worker.rb#L23-23 to use event store\nMove notification action from app/services/merge_requests/remove_approval_service.rb#L45-45 to use event store\nMove notification action from ee/app/services/ee/merge_requests/remove_approval_service.rb#L24-24 to use event store\nMove todo action from app/workers/merge_requests/resolve_todos_worker.rb#L19-19 to use event store\nMove todo action from app/services/merge_requests/update_service.rb#L65-66 to use event store\nMove notification action from ee/app/services/ee/issues/update_service.rb#L66-66 to use event store\nMove notification action from ee/app/services/ee/issues/update_service.rb#L68-68 to use event store\nMove notification action from ee/app/services/incident_management/pending_escalations/process_service.rb#L50-50 to use event store\nMove notification action from app/services/verify_pages_domain_service.rb#L123-123 to use event store\nMove notification action from ee/app/services/incident_management/oncall_rotations/remove_participant_service.rb#L44-44 to use event store\nMove notification action from ee/app/services/incident_management/escalation_rules/destroy_service.rb#L39-39 to use event store\nMove notification action from ee/app/models/ee/merge_request.rb#L617-617 to use event store\nMove notification action from ee/app/services/ee/members/create_service.rb#L98-98 to use event store\nMove todo action from app/services/issuable/destroy_service.rb#L39-39 to use event store\nMove todo action from app/services/issues/update_service.rb#L183-183 to use event store\nMove todo action from app/services/projects/group_links/destroy_service.rb#L18-20 to use event store\nMove todo action from app/services/projects/update_service.rb#L195-196 to use event store\nMove todo action from app/services/design_management/delete_designs_service.rb#L24-24 to use event store\nMove todo action from app/services/members/destroy_service.rb#L61-61 to use event store\nMove todo action from app/services/members/update_service.rb#L64-64 to use event store\nMove todo action from app/services/groups/update_service.rb#L90-90 to use event store\nMove todo action from ee/app/services/epics/update_service.rb#L81-81 to use event store\nAddress usage of deprecated\nGlFieldErrors\nin relation to Vue code\nDeleted BulkImports::ExportUpload records leave behind Upload records\nRate limit on\n/merge_requests\nAPI endpoint\nHealth Check API does not report \"unhealthy\" status when the UI does - pending DB migrations\nAdd option to open issues in full page by default\nApplication settings management improvement\nDisabling top level notifications does not cascade down to subgroups' settings values\nSupport Matomo Tag Manager\nFollow-up from \"Add sharding key to issue/jira/zentao tracker tables\"\nBitbucket Server import: Delay between import being logged as complete and completed project accessible in UI\nAdd option to cascade removal of integrations from group or instance level across subgroups and projects\ndiff limit in API\nGET /projects/{id}/pipelines 500 Internal Server Error when sorting a large dataset\nZoekt indexing takes too much time in rspec\nFeature Request - Add instance-wide merge requests query to GraphQL API\nBE [Group owner bypass] Add audit event for allow_enterprise_bypass_placeholder_confirmation\nRecord usage of deprecated GraphQL schema and surface to user\nAdd documentation for personalized homepage\nInvestigate use of default target namespace in import frontend\nAdd AI-enhanced webhook mode for intelligent pipeline analysis\nOffline transfer - handle placeholder users\n[ActiveContext] Refactor Query\nSnapshotStatus early for job webhooks\nVSCode Extensions Marketplace 500 Error\n[FF]\nsearch_notes_use_membership_filter\n– improve auth query performance\n[Test] spec/lib/bulk_imports/projects/graphql/get_snippet_repository_query_spec.rb | BulkImports::Projects::Graphql::GetSnippetRepositoryQuery behaves like a valid Direct Transfer GraphQL query does not use any deprecated GraphQL schema\nSelf-hosted GitLab CE times out graphql requests until restart, when left unused for a while\nInvesigate and cleanup\napproval_required\nand\nreview_submitted\ntodo action types\n[Test] spec/features/groups/integrations/user_manages_gitlab_for_slack_app_spec.rb | User manages the group-level GitLab for Slack app integration when an integration is not inherited allows the user to unlink the GitLab for Slack app\nBug: Import All count does not include re-imports\nRestructure design system levels\n[FF]\ngroup_owner_placeholder_confirmation_bypass\n– allow group owner bypass of placeholder user confirmation of enterprise users\nIncrease Interruption Limit for Bitbucket Import Jobs and Improve Failed Status Handling\nResolve auto disable form submit button logic\nStarred items > Instrumentation\nAdd key to\n~/vue_merge_request_widget/components/widget/action_buttons.vue\nrendering of tertiary buttons\nBitbucket Server Importer fails when pull request is deleted during migration\nComponent: Card\n✂️ UX Paper Cuts 18.x → Create\nStarred items > Persist starred items\nStarred items > Make starred items accessible over API\nStarred items > List starred items on Personalized Homepage\nStarred items > Determine title + icon based on item type\nStarred items > Add starred item manager to primary navigation\nAdd new part of description for automatically created MRs by AI feature flag removal tool\n[Test] spec/lib/gitlab/background_migration/backfill_bulk_import_export_batches_project_id_spec.rb | Gitlab::BackgroundMigration::BackfillBulkImportExportBatchesProjectId performs without error\n[Test] spec/lib/gitlab/background_migration/backfill_bulk_import_export_batches_project_id_spec.rb | Gitlab::BackgroundMigration::BackfillBulkImportExportBatchesProjectId constructs a valid query\n[Test] spec/lib/gitlab/background_migration/backfill_bulk_import_failures_namespace_id_spec.rb | Gitlab::BackgroundMigration::BackfillBulkImportFailuresNamespaceId performs without error\n[Test] spec/lib/gitlab/background_migration/backfill_bulk_import_failures_namespace_id_spec.rb | Gitlab::BackgroundMigration::BackfillBulkImportFailuresNamespaceId constructs a valid query\n[Test] spec/lib/gitlab/background_migration/backfill_bulk_import_export_batches_group_id_spec.rb | Gitlab::BackgroundMigration::BackfillBulkImportExportBatchesGroupId performs without error\n[Test] spec/lib/gitlab/background_migration/backfill_bulk_import_export_uploads_group_id_spec.rb | Gitlab::BackgroundMigration::BackfillBulkImportExportUploadsGroupId performs without error\n[Test] spec/lib/gitlab/background_migration/backfill_bulk_import_failures_organization_id_spec.rb | Gitlab::BackgroundMigration::BackfillBulkImportFailuresOrganizationId performs without error\n[Test] spec/lib/gitlab/background_migration/backfill_bulk_import_export_batches_group_id_spec.rb | Gitlab::BackgroundMigration::BackfillBulkImportExportBatchesGroupId constructs a valid query\n[Test] spec/lib/gitlab/background_migration/backfill_bulk_import_export_uploads_group_id_spec.rb | Gitlab::BackgroundMigration::BackfillBulkImportExportUploadsGroupId constructs a valid query\n[Test] spec/lib/gitlab/background_migration/backfill_bulk_import_failures_organization_id_spec.rb | Gitlab::BackgroundMigration::BackfillBulkImportFailuresOrganizationId constructs a valid query\n[Test] spec/lib/gitlab/background_migration/backfill_bulk_import_trackers_namespace_id_spec.rb | Gitlab::BackgroundMigration::BackfillBulkImportTrackersNamespaceId performs without error\n[Test] spec/lib/gitlab/background_migration/backfill_bulk_import_trackers_namespace_id_spec.rb | Gitlab::BackgroundMigration::BackfillBulkImportTrackersNamespaceId constructs a valid query\n[Test] spec/lib/gitlab/background_migration/backfill_bulk_import_trackers_project_id_spec.rb | Gitlab::BackgroundMigration::BackfillBulkImportTrackersProjectId performs without error\n[Test] spec/lib/gitlab/background_migration/backfill_bulk_import_trackers_project_id_spec.rb | Gitlab::BackgroundMigration::BackfillBulkImportTrackersProjectId constructs a valid query\n[Test] spec/lib/gitlab/background_migration/backfill_bulk_import_export_uploads_project_id_spec.rb | Gitlab::BackgroundMigration::BackfillBulkImportExportUploadsProjectId performs without error\n[Test] spec/lib/gitlab/background_migration/backfill_bulk_import_export_uploads_project_id_spec.rb | Gitlab::BackgroundMigration::BackfillBulkImportExportUploadsProjectId constructs a valid query\n[Test] spec/lib/gitlab/background_migration/backfill_project_relation_export_uploads_project_id_spec.rb | Gitlab::BackgroundMigration::BackfillProjectRelationExportUploadsProjectId performs without error\n[Test] spec/lib/gitlab/background_migration/backfill_project_relation_export_uploads_project_id_spec.rb | Gitlab::BackgroundMigration::BackfillProjectRelationExportUploadsProjectId constructs a valid query\n[Test] spec/lib/gitlab/background_migration/backfill_bulk_import_configurations_organization_id_spec.rb | Gitlab::BackgroundMigration::BackfillBulkImportConfigurationsOrganizationId performs without error\n[Test] spec/lib/gitlab/background_migration/backfill_bulk_import_configurations_organization_id_spec.rb | Gitlab::BackgroundMigration::BackfillBulkImportConfigurationsOrganizationId constructs a valid query\nProject authorizations incorrect when reassigned has existing memberships\nFile transfer - admin override application file size limits on .com\n[Test] spec/features/broadcast_messages_spec.rb | Broadcast Messages dismissible banner type behaves like a dismissible Broadcast Messages hides broadcast message after dismiss\n[Test] spec/features/broadcast_messages_spec.rb | Broadcast Messages dismissible banner type behaves like a dismissible Broadcast Messages broadcast message is still hidden after refresh\n[Test] spec/features/broadcast_messages_spec.rb | Broadcast Messages dismissible banner type behaves like a dismissible Broadcast Messages broadcast message is still hidden after logout and log back in\n[Test] spec/features/broadcast_messages_spec.rb | Broadcast Messages notification type behaves like a dismissible Broadcast Messages hides broadcast message after dismiss\n[Test] spec/features/broadcast_messages_spec.rb | Broadcast Messages notification type behaves like a dismissible Broadcast Messages broadcast message is still hidden after refresh\n[Test] spec/features/broadcast_messages_spec.rb | Broadcast Messages notification type behaves like a dismissible Broadcast Messages broadcast message is still hidden after logout and log back in\n[Test] spec/features/broadcast_messages_spec.rb | Broadcast Messages with GitLab revision changes properly shows effects of delete from any revision\n[Test] spec/features/broadcast_messages_spec.rb | Broadcast Messages with omniauth behaves like a dismissible Broadcast Messages hides broadcast message after dismiss\n[Test] spec/features/broadcast_messages_spec.rb | Broadcast Messages with omniauth behaves like a dismissible Broadcast Messages broadcast message is still hidden after refresh\nBasic homepage configuration\nDesign: Homepage pipeline widget\nInvestigate why the PG constraint error was detected on staging and not a merge request level\nTrack visit when landing on issue show right after issue creation\n[Design] Create AI design assets for upcoming functionality\nAdd the ability to move between form inputs and submit form with the keyboard, in the New Pipeline form\nDeploy Key Notifications Via System Hooks\nDocumentation lacks custom OmniAuth provider details\nGet last_push from Merge Request webhook event instead of last_commit\nExplicitly set font in HTML e-mails\nOAuth provider documentation lacking detail\nInclude support for PGP encrypted email notifications\nAdd artifacts path to CI WebHook\nOverview for projects with enabled specific service\nTest service settings with a build event as well as a push event\ntaiga.io integration\nVacation API\nSlack channel should show helpful text when linking to private repos\nWebhook: add header of retry count\nList of all subscribed issues\nBetter document e-mail (SMTP) setup\nUse favicon.js to show notifications count on favicon\nWeb hook templates [feature proposal]\nProject Web Hook for all projects\nAdd a way to schedule automatic nagging of issue/MR owner\nSafe Webhooks\nDisable Activity Feed\nCustomizable e-mail templates\nAdd user-defined text to website title for better integration with password managers\nEmails on Issues feature\nAppearance Model should be merged into ApplicationSetting\nEmail notifications: should we include \"via GitLab\" in 'from' or subject?\nIntegrate GitLab with smartsheets\nFeature request - add an easily modifiable \"custom.css\" to gitlab for those few cases where admin needs/wants to override a tiny part of the system\nSelect SSL authentication option when adding webhook from Rake task\nAdd email webhook when build change status\nAdd Slack notification for assignee change\nwebhooks:the request body when the \"Build Events\" was trigger\nRequire auth for /explore and /help when public visibility is restricted\nPer-group and per-project primary email\nNotification level to send mentions for authored resources or when mentioned\nAdd custom Rubocop cop that validates presence of permission checks in services\nShould be possible to set JIRA comments visibility by role\nClarify notifications for label subscriptions in email footer\nCreate a GitLab + Salesforce.com connector for issues and cases\nUltimate\nUse a callback to create personal access tokens\nRemove notification level from member model\nFix formatting for notification \"Marked the task … as completed\"\nBulk editing issues I'm not already subscribed to or participating in should not subscribe me\nMake Slack notifications use a user's Slack username for a \"mention\"\n@metions should only suggest groups that are members of the current project\nBuild hooks are inconsistent\nReduce the payload of notifications changes\nSlack integration should have a flag to notify 'freshly broken', 'still broken' and 'no longer broken' (the missing state being 'build still successful')\nNotification api for new comments on open or issues\nGenerate and send note notification emails in a batch\nImprove Slack preview/url render to display issue comment content when comment url\nImport to GitLab: rebuild Activity and Contribution Analytics page after each import\nRefactor and restructure integration documentation\nAdd service to integrate with OpenProject\nfeature request: backup endpoint\nImprove todos list view to always show the title of the issue\nEasy IRC notifications\nSpecify events on gitlab-rake gitlab:web_hook:add\nAdd\nusername\nand\nicon_url\nfor slack/mattermost integration\nTransition JIRA issue when GitLab merge request created\nPremium\nIFTTT integration\nAdmin dashboard feature for cancellation of project imports\nUse the OpenAPI specification for the API docs\nAdd the assignee to Slack messages\nSaucelabs integration\nwebhooks: include build URL in build events\nWebhook trigger for project visibility level changes\nBrowser notifications for when retry build passes or fails\nMake Slack fallback messages more compressed\nOn clicking an emailed link to a comment that no longer exists, should warn user\nContext for email notifications about comments\nConsider reducing duplications between import files\nAutomatically remove repositories exceeding a given size\nGitHub Importer - Import commit comments\nSubscribe to tags/releases\nCreate sub-todos / todo events\nEmail new issue: Generated address uses characters that Debian/Ubuntu prohibit by default\nAutomatic Dependency/Blocked issues/notifications\n\"Snoozing\" issues\nAPI: Add disableMailNotification on comments\nAllow admins to make specific project services unavailable\nNotify user of domain mismatch\nSort ToDos By Due Date\nFailed imports should clean up the partially imported items\nProvide a cropper for uploaded images\nOption to disable secondary emails for notifications\nadd webhook enable/disable option\nFR: API access with Kerberos credentials\nAdd @ here / @ channel to slack notification message\nOffer better choices for log file and directory permissions\nMake Mattermost notifications set up clearer\nSeparate label subscription emails from label change email\nReleases are not imported with Gitea Importer\nDo not send notification emails during nights, weekends or holidays\nEasy way to see or jump to new discussion since I last looked at an issue/MR\nReal time todo's/notifications (possibly also assignments)\ngitlab email display name not working with issues\nConsider using webpack-dev-server overlay option for more helpful compile errors.\nImporting from GitHub with omniauth associated does not associate commit author\nGithub import - Distinguish private repos.\nSend email notification to different categories of users\nSlack integration: filter messages by branch\nMake API pagination size configurable\nReactive build status in Slack (possibly Mattermost too)\nUnable to see user to add him to repositories\nSelect Web Hook method for request\nPlease make it easier to distinguish email notifications by subject and within discussions\nIntegration between Jira time tracking and Gitlab time tracking\nIncrease granularity of email notification settings\nSend notifications via Web Notification API\nCascading notification settings\nConsider extract gfm group reference match into own filter\nReal time todos in issuable sidebar\nJIRA transitions for non-master GitLab branches\nExtend WebHooks to support HTTP Negotiate/SPNEGO (Kerberos)\n[Meta] (improving) Personal notification/todo dashboard\nAllow more fine grained configuration of webhooks\nMention Slack user in SlackService\nAdd slack direct messages as a notification option\nOne way SVN to GitLab importer\nDelete webhooks for revoked OAuth app\nPush event web hooks should support Git push-options\nClean up schema for table users\nText is being mis-interpreted as JIRA project IDs\nDocumentation update (research required): Hardware requirements for HA infrastructure\nMultiple assignee change notification\nPlugin hooks for annotating source view\nAdd GitLab comment banner to the head of our frontend assets\n“Warning when committing comments/descriptions where large amount of people are mentioned`\nSend notification email periodically (hourly)\nAPI: import_url is not shown with project\nMattermost integration: no notifications when an issue labels change.\nGitLab does not close a task in Resolved state (JIRA integration)\nMake the email notification title/header clickable\nAllow '*' CORS origin for /api/ to be disabled\nRspec feature tests have useless javascript stack traces\nFormalize what we support for references to external issues [meta]\nNotifications page freezes my browser\nCustomizing notification template for comments in merge requests\nSupport JIRA when creating a new issue from a failed job\nDisplay visibility icon in sidebar or breadcrumbs\nNew navbar: Customization on private instances\nReturn Error messages for all integration settings\nSet notification per issue or per merge request to only notify on closing or merging\nDisable all notification emails\nAllow notification emails to be encrypted with PGP/GPG\nNotification when new changes pushed to a branch\nNotification recipients are not calculated correctly for projects in subgroups\nChange project remembers last view\nWeb Push Notifications System (OneSignal)\nUsername and password should only be required for JIRA service when used\nTeam Lead Management Dashboard\nUpdate Jira Fix version field to match Gitlab milestone of linked MR.\nWebhook Secret Token with HMAC Digest\nAssign issues / MRs created by unknown users during project import to the ghost user, rather than the project owner\nRecognize Jira issue URL\nInconsistent date time formats across the API and webhooks\nAdd unsubscribe link to plain text e-mail\nAdd build badge to JIRA issue\nProject services API doesn't use the correct event names\nIntroduce projects_settings table and migrate existing project settings in projects\nAllow developers to view project settings\nImprove documentation of import/export rake task\nMentions based on group, project and issue\nImport project import progress indicators\nImprove user email confirmation docs\nTrigger webhook when artifacts are expiring\nAdd Slack notification for label changes\nImport from Github wizard should still allow you to paste in a Git[hub] URL\nEmail subscriptions for issues and merge requests\nUpdate GitLab.com config for attachments in tags file size limit from 10MB to 200MB+\nRethink the way groups and subgroups are shown in dropdowns.\nMention in emails when a comment has been edited by using an image\nProvide option for a custom color palette\nAllow all system hooks to be enabled/disabled\nDisable User Notifications\nDocumentation for enforcing 2FA is outdated\nAdd a slash command /remind to remind me about an issue or MR\nHide issue and merge request nav items from group navigation when all projects have them disabled\nDifferent headers to distinguish live from test webhooks\nAdd system hook for reporting successful and unsuccessful login attempts\nAdd more notification reasons to the\nX-GitLab-NotificationReason\nemail header (and email footer)\nAdd Title field to Webhooks to easily identify them\nNew Feature: Slack notification on milestones creation/close/edit\nDisplay registry version in\ngitlab-rake gitlab:env:info\noutput\nSlack integration - Show Target branch in Merge events\nClose current filter dropdown by pressing Esc button\nValidate the external authorization is only called once per request\nStar/pin/bookmark a particular object by abusing reactions/emojis\nDocument when to use unnamed / default slots in Vue components\nOne time-migration of TFS work items to GitLab issues\nPremium\nAllow notifications for even non-comments\nJIRA Integration plugin - additional query parameters\nProjects notifications, with user subscription for updates\nCustomize notification settings instance-wide\nThreaded notifications in Slack\nNo way to get notifications both on mentions and participation\nTrello Integration with GitLab Issues\nX-GitLab-* headers for project move emails\nImprove filtering UX for todos\nExpose system hooks recent deliveries via API\nImplement flexbox in dropdowns\nJIRA: Issue solving commit messages should include the same content as commit messages which only mentions issues\nAllow project export to be imported using URL\nCheck space left before backup\nEnable S/MIME encryption for email notifications\nNotifications toggle needs an explicit state sent with the request, or needs to update in real-time\nDownload repository export from project overview page\nGitea Importer - Rescan git commit messages\nExpose project's hooks/services secrets to the API\nDisplay or communicate import result to the user when some imported element fails\nBeautify keyboard shortcuts modal\nAdd accessibility hints to broadcast message color customizer\nBuild emails for push-based mirrored repos sent to owner of repo instead of pusher\nFilter projects and users by updated_at\nChoose not get email notifications about an issue if you are the author\nGetting e mail notifications when not supposed to, and empty X-GitLab-NotificationReaso\nAdd a todo as a personal snippet\nSend notification email upon change to Issuable description\nProject star count could include those on external sites such as GitHub\nSend notification when Merge Request created from an issue\nImport GitHub profile to GitLab\nRole accounts for existing mailing lists\nClone topics from GitHub when importing\nStatus messages: Sync with Slack\nHooks for personal notifications\nAdd link to pagination docs for all API endoints that support it\nImprove nav bar plus \"+\" button issue creation - allow more flexible issue/epic creation regardless of current Group/Project\nShow notifications progress inside of objects\nCreate todo from notification\nReply to comments from preview drawer\nFilter todos/notifications on object labels\nFilter todos/notifications on due date of parent object\nSupport usage of decentralysed messagging systems\nTargeted Javascript Builds\nUpdate ServiceNow ticket when referenced from GitLab merge request (description, comment) and commit\nClose ServiceNow ticket from GitLab merge request or commit\nAllow users to configure whether MR approvals send chat/webhook notifications\nNotifications levels with icons\nProject export failing on gitlab.com, generates lots of emails\nFollow-up from \"Resolve \"Remove ghost notification settings for groups and projects\"\"\nMass update of issues should send digest emails\n\"Resolve all discusions in new issue\" should integrate with the configured external issue tracker, esp. Jira\nOptionally exclude discussion from notifications\nAdding a label to an epic does not generate a notification\nFollow-up from \"Add a new scenario to add an SSH key\" - set env vars as args for git command\nDiscovery: Support custom Emojis for personal status messages\nJira Integration Should Not Require Sharing Credentials per-project\nTrim whitespace from github access token (Import-Tool)\nPlease add consistent author information to system hooks\nUse same format for chat messages\nConsolidate UI page widths - Part 06: Merge requests\nBase64 embedding of images in notification mails\nCustom notification for changing milestones\n\"Add Gitter room\" on project overview page\nConsider adding a background to diffs sent in emails\nInvestigate replacing worker-loader with worker-plugin\nconsistent \"project\" JSON fields across the various events webhook payload\nConditionally show authentic OAuth application message for internal GitLab apps\nLinks to issues from outside vendors automatically\nChange the word \"Last\" to less ambiguous words like \"Previous\" or \"Recent\" in\n/admin\ninterface\nUpdate documentation following Admin Area settings split into sub-pages\nSupport alternative domain names for webhooks.\nDocs - product feedback: No option to not get email notifications for MRs you haven't commented on / been mentioned in\nUsing events API for displaying the redesigned activity feed\nDaily Digest Email Notifications\nAdd labels in the notification header for issue and merge request creation\nAdd support for image thumbnails in Activity feed\nAdd support for image thumbnails in Activity feed: Backend\nReceive notifications for emoji on issue/merge request/epic description\nCustom email notification template for Project moved\nAllow user mentions across groups\nProject Import User Mapping Whitelist via Access Token\nNotification toggle UI has ambiguous scope\nKeep the original last updated date when importing a new project\nInclude Project Boards (Issue Boards) in GitHub import\nAdd keyboard shortcuts to expand/collapse side navigation and issuable side bar\nAllowlist for rate limiting feature\nGitlab Rest APIs Collection\nFollow-up from \"Resolve \"Extended user centric tooltips\"\"\nList subscribers on the label\nHandle invalid import provider token on clientside - https://gitlab.com/gitlab-org/gitlab-foss/-/merge_requests/22458 follow up\nMake personal settings easier to explore/discover\nAdd structured logging to all importers\nDiscord Integration/Webhook Improvements\nLabel filtering for Slack notifications\nAdd automated tests for Dangerfiles\nAbility to elect to receive notifications for follow up issues\nIntegrations should allow to specify branch-name-pattern\nAdd a RuboCop cop / spec for sanitize_name helper in emails\nDisable navigation theme selection on user level\nJira Integration: Branch Names\nAdd the ablity to filter which JIRA projects to consider for the integration\nFogbugz Import User Mapping Error\nNo Pipeline creation on webhook trigger\nRemove merge request diffs from the import\n\"Enter line number\" shortcut (CTRL+L / CMD+L) in visual code editor collides with browser native CTRL/CMD+L for address bar\nHide features in navigation if you have Guest or Reporter role\n[Feature Request] | Limit the webhook count per project in gitlab CE\nWhen migrating from GitHub, allow requiring all users to be mapped to GitLab users\nAdd ability to edit to global notification settings to the UI\nSlack integration tag notifications should link to the tag, not the commits\nImprove \"import in progress\" screen\nStar any page in GitLab\nTrigger Chatops jobs via Microsoft Teams\nImprove settings pages design by prioritizing content: Repository settings\nImprove settings pages design by prioritizing content: CI/CD settings\nIntegrate with hub.docker.com\nAllow admins to set a default navigation theme for users\nAllow customers to specify regex in links to integrated projects\nImprove copy when user is already unsubscribed from a thread\nAbility to undo subscription cancellation from the confirmation notice\nSupport Deployment Notifications in Discord, Hangouts, and Microsoft Teams\nJob Webhook does not have standardized request body compared to Pipeline Webhook\nFilter out user repositories and forks when searching code\nContact reviewers only after a PR CI tests are successful\nChatOps 500 error on chat_names after delete project\nBitbucket Cloud Import Status Page Results in HTTP 500\nDefault Tanuki avatar\nAPI doesn't return full information about slack service and doesn't update deployment channel (v11.11)\nSlack notify should strip out html comments\nIssue trackers: stop reading properties\nIssue export to email: Emails are flagged as spam\n[Stack Overflow] Content Previews\nBrowserStack integration\nGitLab integration with Symphony\nDocument code-splitting policies and put together a training workshop for frontend engineers\nRedirect GitLab API calls when necessary, after a project transfer or rename\nRemove node polyfills in webpack\nSlack Notifications not working for multiple channels\nCannot create a project via API if import_url has non-default SSH port\nUpgrade mattermost integration (add icon_url)\nNotification of related issues\nDocument, verify and test every kind of Todo.target\nProblems on Import from private repository using username/password authentication\nSurface project import error in UI\nFollow-up from \"feat: smime signed notification emails\": support eddsa with curve 25519 using PureEdDSA\nImprove import experience by allowing gradual access\nSelect different email address to receive notifications, per project\nExport REST API with URL option responds accepted even though upload failed\nNone of the Project shortcuts will work on Groups\nNotify on new tag only\nJIRA integration - allow to configure Transition IDs per project\nDeprecate existing inconsistencies in our GraphQL Enums\nUpdate our front end to use the new (non-deprecated) GraphQL Enum values\nTrim down the range of background colors for styling admin messages/alerts\nA way to disable auto-add to To Do on nick mention\nBetter handling of Git 30X responses\nWhen an issue is moved, \"new issue\" notification emails are confusing\nGitLab integration not able to close JIRA issue when transition workflow has screen requiring resolution\nReplace Slack with better in GitLab functionality\nJIRA Integration does not read retrospectively from MR titles\nInclude environment URLs and slugs in project export\nConvert flash alerts into other components\nTurning off email notifications for individual issues\nAdd telemetry to community tools\nHosted Gitlab does not offer the ability to Super-Admin Globally Block all email notifications\nJIRA integration may captcha the JIRA account\nProject icon shouldn't be set when login is required\nJira integration authentication via SAML/OAuth\nMissing System Hook Event for transfering a group\nAdd plugin usage data to usage ping\nCreate re-usable method to hide flash\nDisplay logging for Jira integration in the UI\nImprove error messaging for JIRA integration connection tests\nFollow-up from \"Store mentioned users, groups, projects in DB using postgres array type\"\nJira Integration: Hyperlinks to Jira Issues in Merge Requests and more\nAdd User on Import if required\nAbility to ignore work in progress merge requests for mattermost notifications\nJira integration menu from UI should allow testing a configuration set via API\nFollow-up from \"Add Personal access token expiry policy\": Consider hiding the views if the feature flag is disabled\nNotifying user when mentioned in an edited comment\nSlack integration shows as only available on .com, in the self-hosted settings?\nNoMethodError: undefined method `gsub' for nil:NilClass\nSubscribe to label => post to Slack\nUse destroy_conditionally! helper for deletions in API\nDocs feedback: Events documentation does not properly specify structure of response\nFogBugz Importer fails to import attachments\nMigrate mentions for epics and notes.noteable_type = 'Epic'\nMigrate mentions for snippets\nMigrate mentions for commit notes\nMigrate mentions in Issues\nMigrate mentions in Issue notes\nMigrate mentions for MergeRequest\nMigrate mention for MergeRequest notes\nAdd pages_access_level to projects GraphQL API\nProject Export should include 'failed' state\n[For Gitlab.com / Non administrator plans] API endpoint to get all membership (projects and groups) of a given user, on the projects/groups owned by the user making the API call.\nFollow-up from \"Add spec to test import->export equivalence\"\nProject export ratelimit has wrong\nRatelimit-Reset\nand no\nRetry-After\nMove Settings for CI/CD and Operations to the CI/CD and Operations sidebar items\nWebhook - Align user information between job and pipeline events\nMove DLL-related webpack code into a separate plugin\nImporter: Ensure specs produce no\nImportFailure\ns\nHandle Project+Milestone link in Project Export/Import\nExtend capabilities for configuring slack notification triggers to give more control of channels to notify\nRefactor branch protection select to use Pajamas component\nMake using illustrations in Vue components easier\nProject import fails via API and UI for a large project\nAdditional information in WebHooks\nSync branch / MR deletions to Jira dev panel with the Gitlab for Jira App\nMR hook not sending update via Jira App when updated\nDocs feedback: Webhooks api schema\nSlack notifications integration fails setup in projects without a repository\nShort Message Service (SMS) notification\nUltimate\nHyperlinks to closed Issues are missing in MRs' descriptions after import\nJira import stats report\n[GraphQL] Add\nmerge_request\ndetail to\ndeprecated\nfield property\nExport/Import related merge requests empty\nAdd Overview Dashboard for Project Import/Export\nAdd Overview Dashboard for Gitea Importer\nAdd Overview Dashboard for Import by URL\nAllowing multiple integrations of a single project to Microsoft Teams\nCreate a \"checksum\" for project export/import\nExpose project services through graphql query\nGroup export/import status API endpoint\nEnable instance-level and group-level testing feature\nClean up any unassociated DeployToken records\nFigma Live Embed GitLab integration\nDocs feedback: Log settings\nExecuting docker - gitlab:import:repos - Refusing to create empty bundle\nErrno::ENOENT: No such file or directory @ rb_sysopen - /var/opt/gitlab/gitlab-rails/shared/external-diffs/merge…\ntarball downloads for tags can contain commit hash in root folder name\nGrouping the related messages in the same thread in Google Hangout Chat\nProject import/export does not include activity log entries (events) relating to git\nImport comments from Jira issue\nUnfurl links to code in Slack\nAzure DevOps Importer\nRemove jQuery from the main bundle\nExpand Group Hooks to include project events, similar to SystemHook offering\nInitial notification email is not being threaded together with replies when using Amazon SES\nTo-Do List: Sections Help Prioritize Work\nExport failing on GitLab.com\nAdd custom labels to all imported issues\nSlack integration commit messages are incomplete\nRemove append/prepend utility classes\nJira integration should have a setup incomplete status\nAllow mutations to have custom error types\nBroadcast notifications placeholders are empty for signed out users\nUse reactive caching for 3rd party REST calls made by Jira request services\nFeature Request - Configure Jira integration to not add \"Resolve\" to MR titles\nAdd issues and merge requests links to the project overview page\nFollow-up from \"Add AttributesPermitter for Import attributes filtering\"\nConsider using local temp storage instead of shared temp storage for Import/Export\nFilter Notifications by Change Type\nEnforce use of resolving with a method and not the field\nresolve:\nkeyword argument\nFollow-up from \"Document github rate limit behavior\"\nAdd Webhook logger to log all executions in addition to errors\n[GraphQL] Implement namespaced mutations\nMultilingual support for Broadcast Messages\nWhen an issue is created from Slack, post updates back to the Slack thread\nFollow-up from \"Refactor Service#test to use service object\"\nHow to restore default notification setting of a project?\nAdd Jira board view (MVC iteration 4)\nProject export/import (ndjson) - merge request approval count not imported\nProject export/import (ndjson) - child pipeline jobs not imported\nFirst time setup of Jira integration should leverage a stepper component\nInherited notification settings aren't shown correctly\nAdd option for disabling email notifications for confidential issues\nOption to not export closed objects\nGitLab Project Import: Preserving user contribution associations with existing group members\nAutomatically link Jira issue with GitLab activity\napi/services/slack: Consider add support custom icon emoji and url for incoming Slack webhooks\nSimplify Jira integration/installation flow\nImport Export Button - Is it missing or don't I know where it is?\nAllow paging of webhook logs further back than just 2 days\nNotifications for CI Minutes quota limits does not respect group-level notification settings\nContinue to improve performance of Advanced Search API\nTFS - Git Project Importer\nConsolidate input field on error tracking list page\nShow who in addition to when a setting has been updated\nReplace append-bottom-20 CSS class\nGraphQL: Declarative way to disable Graphql/AuthorizeTypes\nAdd user mentions to Project Import/Export\nSplit Gitea and Github Importers to have separate importing flow\nGitLab-JIRA integration occasionally posts several JIRA comments for the same Git commit (related to merge requests?)\nOrganize the states of group migration within tabs\nOptions for reducing emails\nCalling a service with complex ordering with GraphQL keyset pagination\n'Object Storage is not enabled for AvatarUploader' using rake task gitlab:import_export:export\nAdd cleanup job for failed import files\nInvestigate increasing the frequency of export file cleanup\nShould we officially support Firefox ESR?\ncore-js is polyfilling more than needed\nAdd an instance-level setting to require Jira association in Merge Requests\nUltimate\nRemove use of Legacy GitHub Client code from Gitea Importer & Other places\nReplace Legacy Github Importer with Parallel Importer in Gitea Importer\nRemove Legacy Github Importer from the codebase\nSetting up Atlassian integrations as part of new project flow\nSecurity: LDAP group access is converted to local user access on import\nGitlab-Slack integration doesn't send events for changes in MR title or description\nProject > Visibility Settings > Monitor > Allow users to disable Incident Response individually\nMigrate Container Registry with Project\nSlack integration: notify when a MR review is done\nShow user popover when hovering over avatars\nProject > Visibility Settings > Monitor > Allow users to disable Error Tracking individually\nDo not send 'sensitive' information in e-mail notifications\nUnify project/group hooks codebase\nIssuable sidebar > Update edit buttons\nHandle user mentions when converting from Jira ADF to GFM\nHandle attachments when converting from Jira ADF to GFM\nProvide a method to escape strings that match the Jira issue key regex\nAllow users to export notification settings\nGraphQL: LooksAhead - Allow scoping of eagerly loaded associations\nConfluence integration: Application setting to allow any website\nUX: Add the ability to create Jira issues within GitLab\nUltimate\nAdd a setting to remove external links from the user and help menus\nAdd aria labels to icons that link to help_page_path\nUpgrade plan button should work for both SaaS and self-managed accounts\nCreate a new Jira issue from unresolved MR threads\nClarifying what 0 required approvals means\nPremium\nJira dynamic-links do not refresh after updating the Jira-integration URL\nRedoc as OpenAPI reader\njira integration incorrectly formats sign-off message in commit render\nAllow keyboard shortcuts to be customized\nNotification icons: Add icon for \"custom\" notification settings\nTie deploy keys to bot users\nCountableConnection may need to take preloaded relations into account explicitly\nAllow manual sync of all exisiting data with GitLab for Jira app\nShow process when syncing data via Jira Connect\nUsage ping data: Optimize Jira usage calculation using deployment_type\nLint for css color variables\nImprove flow for adding and editing webhooks\nGitLab Migration - Multi-select group(s) from the tree\nMicrosoft Teams integration -> execution expired\nAdd a resolve Jira Association button to Merge Requests\nUltimate\nMonitoring Integration of pipelines with Datadog\nUnable to disable some types of notifications\nFollow up > MR widget extension button > loading state > remove extra css\nLink to the corresponding activity feed item in email notifications instead of the general issue/MR url\nProject import race condition results in 500 when importing a project with same name&path concurrently\nChange notification email for group/project level notifications via the API\nImprove usability of Confluence Workspace URL validation\nTidy up and simplify the \"+\" menu in the top nav bar\nUser can search and filter comments using various fields\nSystem Hook group_member_data doesn't include full paths for subgroups.\nFeedback issue for migrating groups and projects by direct transfer\nList broadcast messages has no filtering option\nRefactor jQuery dropdown implementation to GitLab UI GlDropdown in create_item_dropdown.js\nEnforce the rate limits for Group file-based import via API\nReplace prepend-top-20 css class\nIntroduce setting to restrict visibility of Confluence (and other) Integrations\nConsider adding argument names to DSL method\nImport project from repository by URL - stuck when incorrect URL is inserted\nAfterExportStrategy::StrategyError: Error uploading the project. Code 403: Forbidden\nButton heights are 1px off in some cases when containing emoji\nFilter interaction is inconsistent across GitLab\nChild Pipelines cause double Slack notifications on failure (or success)\nDocument disclaimer for Importers\nTest Jira issue list settings\nExpand https://developer.gitlab.com and the integrations guide with details for issue tracker integrations\nFeature request: Email notification should be sent when tags add/removed or commit added to issue\nAdd context_path when using custom Jira requests\nFix N+1 in Atlassian serializers\nAdd checkboxes to the GitHub repo list\nDocument use and purpose of\nDeferred\nTechnical discovery: Cross-page settings search\nFollow-up from \"Draft: Resolve: Experiments using Flipper will require Feature Flag YML files\" - percentage_of_time_value discussion\nAdd unit test coverage for logic in\nwatch:\nof settings_panel.vue\nPrevent exceeding allowed projects during Group Migration\nShould we split up the\nJiraConnect::Client#send_info\nmethod?\nCreate a pre-import check report\nProject > Action resets focus to top of page\nUX: Deactivating integrations with and without inheritance\nAdd documentation of GraphQL query validation for FE developers\nGitlab <> Blazemeter plugin development\nExport/Import API unreliable\nJiraConnect: support feature flag actions\nMarking a MR as draft disables the JIRA link in MR title the but removing the Draft mark does not restore the JIRA link\nAdd a group-level setting to require Jira association in Merge Requests\nUltimate\nJira Connect App: Use a GraphQL query to get the list of group\nAdd support for using Apache Solr for GitLab Advanced Global Search instead of ElasticSearch\nMove Admin Area, Push Rules to Settings > Repository\nUse a PostgreSQL trigger to maintain\nproject_settings.has_confluence\nFix incorrect data in\nproject_settings.has_confluence\nReplace uses of Grape API's\nat_least_one_of\nwith a catch-all method of ensuring at least 1 param is passed during a PUT\nUse non-public email addresses from LDAP for EWM integration\nUX: Jira integration should support OAuth\nUser specific custom RackAttack rate-limits\ngitlab.com (SaaS) customisation inside namespace\nRefactor hook data building\nImprove alt tags on user uploaded images\nElasticsearch migrations should not start until after a deployment is finished\nHave a global fix for workers paths\nSearchController#show rendering is very slow on second page of code results when using Elasticsearch\nFollow-up from \"Add preliminary badging to Ecosystem docset\"\nAllow using status names in Jira issue transition settings\nFollow-up from \"Fix project import error occurring due to default visibility\"\nSlack notifications for package publish\nCompressing gitlab assets\nExtend Graphql/Descriptions cop to ban descriptions beginning with \"A…\", or \"The…\" except for enum values\nAllow labels on merge requests to influence what teamcity builds are run\nMirrored Open MR Requests from Bitbucket to Gitlab Do Not Mirror Git Refs\nShould we organize GraphQL library code by function?\nWebhooks for Milestone Events\nBulkImports: Update contributor documentation\nReduce cyclomatic complexity for ChatNotificationService#execute\nImprove the categorization of the Deploy tokens setting\nValidate project settings in Web IDE using custom schema\nConvert a single settings page to a structured data file\nDefine the schema for a settings component\nExpose all user settings in a single JSON-like format\nFix chat message for reopened issue\nJira integration creates links for other projects\nFeature proposal: Add more data in the message sent by the Mattermost Notifications Service\nAutomatically install the GitLab for Jira Connect App from GitLab\nJira issue list should include counter for status tabs\nAbility to hide Issues/Epics from group page\nIntroduce read-only view of settings\nAlign BitBucket Server import name validation criteria with GitLab\nBulkImports: Add a configuration trait on\nbulk_imports\nfactory\nMake notification preferences more flexible\nAllow Mattermost Notification for Releases\nAdd ability to create Merge request/branch from a Jira issue\nReview, polish, expand Figma plugin docs\nUse lazy evaluation when building data for Project hooks\nStep through results when searching settings\ngitlab - jira integration : transition success but no weblink added to jira issue\nAdd project event to group & subgroup webhooks\nPremium\nUltimate\nAdd more flavour to the messages sent via the MS Teams Webhook\nKeep track of DRIs for frontend dependencies within GitLab\nMicrosoft Teams Bot Integration\nPremium\nUltimate\nGitLab runners should support clone over ssh\nPremium\nUltimate\nCreate a pre-migration check report\nRefactor UrlHelper in project integration settings\nRemove new_issue_url from external issue trackers\nMake it easier to update credentials in import_url\nRegression test for Jenkins integraton\nAllow overriding certain fields in inherited integration settings\nDisable GitLab issues when enabling external issue trackers\nPublic REST API: optimistic locking / Compare and Swap (CAS) proposal\nImported projects contain old URLs for merge request version links\nStandardise usage of 'property' and 'parameter' in doc/api/*\nUpdate broadcast form to include a calendar widget\nSupport multiple active configurations for integrations (e.g. Google Chat)\nFeature proposal: Allow to set\nicon_url\non Mattermost Integration\nRemove Campfire integration or consider changing to Basecamp integration\nBitbucket importer should remove failed repositories\nadd field upgrade_available on gitlab version API\nAfterExportStrategy::StrategyError\n(Webhooks) Group_id on Push events\nGithubImporter: Refactor the Representation layer\nDocs - product feedback: Notification options\nGraphQL: Allow fields to have 0 complexity\nExclude node_modules from Rails asset path\nYou should not need Maintainer access to see a project's hooks\nArchitecture: Manage multiple serialization formats for web-hook data\nSelect correct serialization format for each web-hook\nUX: users can see and edit web-hook version requirements\nUX: users can see which hooks can be updated\nFE: users can test a web-hook with multiple versions of payload\nImporting Project from GitLab Export validates file extension only after uploading the backup\nCommunicate why inheriting form elements are disabled\nTransient failure in qa/specs/features/api/1_manage/user_access_termination_spec | multiple failures due to pre-existing data\nAdd notification badge to Admin area\nIssue updates not triggering notification via Mattermost integration\nFollow-up from \"Add Apollo to \"Jira Issues List\" Vue app\"\nImprove ability to track status of, timeout, and cancel group/project exports\nClean up documentation on application limits\nExport miss merge requests when source branch doesn't exist\nReconsider margin-bottom for .btn-block\nFollow-up from \"GithubImporter: Count and log each object imported\"\nAdd ability to re-import a relation\nSlack Integration - Merge Request Reminders\nPremium\nInvestigate visibility of menus for discoverability\nImprove importers error persistence strategy\nSpecific error messages for deactivated users?\nEnable a way for GitLab to confirm that issue exists in Jira before hyper-linking a string in the issue title or merge request title\nPremium\nUltimate\nAPI for managing instance-level integrations\nDocs does not explain how to link Merge Requests to Trello card\nCodeBeamer Integration\nReplace\nautoprefixer-rails\ngem with direct use of\nautoprefixer\nnpm dependency\nFix partially migrated Jira integration records\nUpdate labels for integration secret fields when reentering them is required\nUpdate file does not trigger webhook\nJiraConnect sync should use junit test reports for test-info discovery\nHandle deployment_type\nunknown\nfor Integrations::Jira\nMake Bulk Import entity 'destination_namespace' parameter optional\nMake Jenkins CI be supported by Project Integration Management\nFollow-up from \"Add feature flag and basic frontend structure for instance-level integration overrides\"\nMake \"Search settings\" field sticky\nJIRA: MR linking with repository name in title of \"Web Link\"\nAdd\nLast edited\nto UI table of projects that override instance-level integrations\ncan't switch to instance default jira integration using REST API\nDesign: Slack application link unfurling states\nUnable to export project on GitLab.com (11+ Gb project files) due to\nGoogle::Apis::TransmissionError: execution expired\nerror\nJira integration make the project key a dropdown\nImporting large exports via rake task causes Postgres connection timeout\nJira Connect New Branch form: Provide link to branch in GitLab\nCheck for successful HTTP responses when testing integrations, rather than specific status codes\nImport code strips out root causes and obscures where an error occurred\nInclude commit discussions in export/import\nMigrate Environments with Projects\nDisallow anonymous / unauthenticated GraphQL queries\nPush default settings to project integrations from instance-level admin\nConsider breaking down project import/export into smaller transactions\nProject overrides: add ability filter by name\nCheck visibility of integrations dynamically in GraphQL ServiceTypeEnum\nReplace 'self' and 'unsafe-inline' in the CSP's style-src with a nonce\nProject overrides: add ability to sort\nAdd comment parameters to Jira service API\nOption to not migrate closed objects\nGitLab Migration - Migrate Commit discussions\nMake messages used in Chat integrations translatable\nEnsure all chat based integrations support notifications from all available triggers\nEnsure URLs passed to integrations have been sanitized to be used by receiving services\nDesign: Unfurl private GitLab links shared in Slack workspace\nInvestigate k8s Job objects for GitLab Migration\nSlack notifications fails to send to multiple channels\nFeature request: Use a Git commit or merge request to transition or close a Bugzilla bug.\nLFS objects\n404\nafter importing an exported project\nRename\nthrottle_unauthenticated_*\ncolumns in application settings\nUnable to save SAML SSO form with all checkboxes disabled and empty field values\nProvide warning about group import in progress\nBefore exporting a project, run GitGarbageCollectWorker with prune\nConfigure integration fields based on license\nMake all SystemHook trigger events configurable\nDocs feedback: Add documentation on chat section and how active chat names are populated\nAlign the parent dropdowns/names when selecting groups for migration\nGitLab Migration - Allows for on going migrations to be stoppable\nGitLab Migration - Automatically cancel migrations that are taking too long or got stale\nUse reactive caching for ZenTao issue views\n[Proposal] Preferences option to select \"Personal\" tab on homepage\nNotify GraphQL users of deprecated schema\nWebex Teams integration missing description of the commit\nMerge request don't understand Jira-ID and not hyperlinks Jira-ID in commit title\nJira integration doesn't work for imported project\nZenTao integration: add zentao_issues_list_bundle tests\nSupport jira.com domain during GitLab.com for Jira Cloud app installation\nGitLab Migration - Migrate projects without groups\nFurther improvements of group imports history API\nMake group import history available as GraphQL endpoint\nOffer guidance to users on the Global Search empty and no result states\nIndicate to users when global searches are being scoped to a specific content type\nSite-wide colour blind mode (like what GitHub does)\nInclude default branch configuration in export/import\nMicrosoft Teams integration triggered by deployment event\nMove GitLab Migration sidekiq jobs to the dedicated imports shard\nClarify ssh key authentication options under performance optimization\nGitHub Importer: Enhance logging around API calls to GitHub\nOption to see and remove a user from pipeline status integrations mailing list\nPremium\nUltimate\nImprove clarity of time preference setting\nAdd support dynamic PROJECT in external issue tracker integration\nWebex Integration - allow multiple Hooks\nAdd user-agent to JIRA API calls\nConsider adding\nlfs_enabled\nand\npackages_enabled\nto Project Export/Import\nImprovement: Add description texts and status logs to Webhooks\n(follow-up issue) Small refactor of\nZentao::Client#ping\n(follow-up issue) Add error messages to errors thrown by\nZentao::Client\nGitLab Migration - Make it possible to parallelize pipelines\nPermit special characters (#, / and ?) in credentials provided in import_url when creating/updating a project via the API\nProjects > Visibility Settings > CVE ID Requests > Move setting location\nProjects > Visibility Settings > Forks > Move setting location\nProjects > Visibility Settings > Git Large File Storage > Move setting location\nMigrate\napp/views/layouts/nav/breadcrumbs/_breadcrumbs.html.haml\nto\nGlBreadcrumb\nJIRA integration: Avoid commit lookup in create_cross_reference_note\nSpec failure in\nspec/features/groups/import_export/import_file_spec.rb\n| Import/Export - Group Import when the user uploads an invalid export file displays an error\nReceive notification in Slack when a pipeline fails\nReceive notification in Slack when a job fails\nAdd ability to retry a failed pipeline or job from Slack\nAdd ability to subscribe/unsubscribe to Slack notifications about an MR\nUpdate Large Repo Import Workaround for LFS\nMake Integration/Webhook Triggers More Finely Grained\nMake recipient emails fields in integrations consistent\nAdmin manage Jira Connect installations\nProvide integration tests for Import/Export Members Mapper\nRemove fields from Import/Export excluded_attributes if included_attributes is already provided for given field\nProject > Visibility Settings > Issues > Allow users to disable Issue list individually\nProject > Visibility Settings > Issues > Allow users to disable Boards individually\nProject > Visibility Settings > Issues > Allow users to disable Service Desk individually\nProject > Visibility Settings > Issues > Allow users to disable Milestones individually\nProject > Visibility Settings > Issues > Allow users to disable Iterations individually\nProject > Visibility Settings > CI/CD > Allow users to disable Pipelines individually\nProject > Visibility Settings > CI/CD > Allow users to disable Test Cases individually\nProject > Visibility Settings > Security & Compliance > Allow users to disable Security Dashboard individually\nProject > Visibility Settings > Security & Compliance > Allow users to disable Vulnerability Report individually\nProject > Visibility Settings > Security & Compliance > Allow users to disable On-demand Scans individually\nProject > Visibility Settings > Security & Compliance > Allow users to disable Dependency List individually\nProject > Visibility Settings > Security & Compliance > Allow users to disable License Compliance individually\nProject > Visibility Settings > Security & Compliance > Allow users to disable Threat Monitoring individually\nProject > Visibility Settings > Security & Compliance > Allow users to disable Policies individually\nProject > Visibility Settings > Security & Compliance > Allow users to disable Audit Events individually\nProject > Visibility Settings > Security & Compliance > Allow users to disable Configuation individually\nProject > Visibility Settings > Deployments > Allow users to disable section\nProject > Visibility Settings > Deployments > Allow users to disable Feature Flags individually\nProject > Visibility Settings > Deployments > Allow users to disable Environments individually\nProject > Visibility Settings > Deployments > Allow users to disable Releases individually\nProject > Visibility Settings > Monitor > Allow users to disable Metrics individually\nProject > Visibility Settings > Monitor > Allow users to disable Logs individually\nProject > Visibility Settings > Infra > Allow users to disable Terraform individually\nProject > Visibility Settings > Packages & Registries > Allow users to disable section\nProject > Visibility Settings > Packages & Registries > Split up Package and Infra Registry into two settings\nProject > Visibility Settings > Analytics > Allow users to disable CI/CD analytics individually\nProject > Visibility Settings > Analytics > Allow users to disable Code Review analytics individually\nProject > Visibility Settings > Analytics > Allow users to disable Insights analytics individually\nProject > Visibility Settings > Analytics > Allow users to disable Issues analytics individually\nProject > Visibility Settings > Analytics > Allow users to disable Merge Request analytics individually\nProject > Visibility Settings > Analytics > Allow users to disable Repository analytics individually\nProject > Visibility Settings > Analytics > Allow users to disable Value Stream analytics individually\nProject > Visibility Settings > CI/CD > Allow users to disable Editor individually\nProject > Visibility Settings > CI/CD > Allow users to disable Jobs individually\nValue of \"Squash commits when merging\" not preserved across export and import\nFix/prevent unhandled promise rejections in Vue components\nMultiple Slack notifications for a single pipeline event\nMake scrollable tabs work with gl_tabs_nav helper\nGitLab Slack Actions - Create Issue\nAdd basic validation for project import from Bitbucket Cloud\nFeature request: Make integration with Microsoft Teams notifications (done via, e.g., Webhook) more granular\nFeature request: Integration with Microsoft Teams Threads conversations\nAdd static linter to validate Bulk Import's EE stage files\nRemove usage of\nlabels_select_vue\nin\njira_issues_sidebar_root\nRemove usage of\nlabels_select_vue\nin\nzentao_issues_sidebar_root\nExport/Import from .com to self-managed is missing issues.\nAdd merge request reviewers to Jira dev panel\nRespond to notification email with emoji\nRemove unneeded link conversions in chat integrations\nProvide instance- and group-level settings to toggle sidebar items based on role\nFollow-up from \"Add Container Expiration Policy & Service Desk Setting to GitLab Migration\"\nImprove UX of status message when group migration is complete\nGraphQL Reference page should be split into sections\nUpdate push events webhook schema\nAdd deprecated components to danger file\nFire Webhooks Upon CI Report Data Ingestion\nUltimate\nConsider moving to explicit state machine for webhook disabled states\nAdd Rubocop to check for SSL verification setting on integrations\nCreate API to Import one GitHub Org into a GitLab Group\nImport all GitHub Projects when importing a GitHub Org\nImport Avatar for GitHub Organizations\nUnify shared examples for chat notification integrations.\nFlexible export permissions for extremely large GitLab instances\nAllow obtaining security token of a web hook through API\nJira shows so many Commit Merge in History from Gitlab\nDon't match project name in settings search\nPUT /application/settings doesn't accept same elasticsearch_url datatype as GET output\nGET /application/settings outputs repository_size_limit in bytes, causing RangeError when PUT-ing for large limits\nSAML Group Link not compatible with some IdPs integrated with Cloudflare Access such as Google Workspace and Okta OIDC\nAllow settings to revert back to their \"null\" state\nGitLab Migration - Allow the user to migrate a subgroup via the UI\nMock TCP server for tests\nGroup import fails validation due to shared runner settings\nFollow-up from \"Block recursive web hooks\"\nAdvanced Search: Optimize Group-level Searches for Commits\nAdvanced Search: Optimize Group-level Searches for Notes\nJira \"GitLab for Jira\" app (self-hosted & cloud) fails to link namespace with \"The Jira user is not a site administrator.\" error\nAdd polling for new webhook events\nGoogle Chat notification for when all issues in the MR are resolved\nRemove\nowner_name\nand\nowner_email\nfrom project webhook data\nProject import can be used to mass probe emails\nMake Rack::Attack::Request more reslient to upstream changes\nProject import/creation behavior is not consistent for administrators when creating a project from home screen and from group screen\nTrigger GitLab Pipeline on GitHub PR Title Change\nActiveRecord::RecordNotUnique: PG::UniqueViolation: ERROR: duplicate key value violates unique constraint \"index_issues_on_project_id_and_iid\nGraphQL API rate limit responses do not include rate limit headers\nGitLab.com for Jira Cloud app sometimes doesn't sync builds\n[Frontend] Suggest available Jira issues when editing a Merge Request title or description\nUltimate\n[Backend] Suggest available Jira issues when editing a Merge Request title or description\nUltimate\nAuto-generated GraphQL docs indent sections beyond h6\nNotification for Releases when using the Microsoft Teams Integration Plugin\nAdd WARNING headers to API responses that have deprecated features\nIntegrations: Add UI component for ENV-like key-values\nDataDog Integration: display computed URI\nCreate Harbor GraphQL type\nIgnore certain authors from slack notifications\nPlugins\nImprove UX of project import page\nAdd webhook metadata\nWrite a rails generator for integrations\nRemove usage of bootstrap \"collapse\" within mirror helper scripts\nIntegration Improvement Request: Granularly control Merge Request notifications\nGoogle Cloud Platform Error Reporting Integration\nConsider refactoring\napi_field_names\nto API entity\nAdd API schema for integrations\nGitLab Migration - Better handle missing users\nGitLab Migration - Rearrange groups and projects during migration\nGitHub Importer - Map GitHub Teams to GitLab during import\nForbid raising errors in GraphQL object types and resolvers\nValidation to enforce one-external-issue-tracker is not applied consistently\nHTTP 524 timeout error during project import to GitLab.com\nReduce Gitaly N+1 requests in Atlassian::JiraConnect serializers by making files optional\nGroup Migration - 'Epic added/removed as child' event missing\nGroup Migration - 'Epic label(s) added/removed' events missing\nBitBucket import should use URL slug for project path\nBitBucket Importer should import friendly name for project\nBitbucket Cloud Importer - Import images saved in markdown\nInvestigate if all classes that include\nHasIssueTrackerFields\nshould validate\nnew_issues_url\nImprove how we control availability of integrations (through feature flags etc.)\nUse WARN logging level for rejected Jira issue keys\nAdd API for Jira custom transitions\nSpecify web-hook retry policies\nVerify connection settings before enabling an integration\nTrack webhook metrics\nAdd custom notifications for webhooks\nConfluence group level integration does not show up in sidebar\nScope third_party_wikis by category\nEvaluate permissions required to access import_url project information\nValidate boolean attributes on integrations\nUpdate a list of included parameters for Group Import/Export to use AttributesPermitter & allow-list approach\nJira Integration seems to ignore password provided via API call.\nImprove webhook log loading\nAddition of more existing events with System Hooks\nSlack notifications not working for pipeline jobs - Handle rate limit events\nSupport schema.org one-click and go-to actions on e-mails\nGroup setting \"Allow projects within this group to use Git LFS\" confusing copy\nFix realtime_changes import endpoints ETag behavior\nProvide integration with AWS EventBridge\nFeature rollout - remove_legacy_github_client\nBackend: Support unfurling private and confidential links\nBulkImports::Entity db records have\njid\nmissing\nUnclear whether Group Hooks triggers on same projects events as System Hooks\nClean up dirty tracking for integration fields\nDocument the definition of a \"Comment\" when it comes to the Importers\nFollow up to \"Manage Jira Connect subscriptions in Vuex\"\nUpdate Jira DVCS documentation to take real time sync into account\nGitLab Jira Integration - Users don't exist in GitLab but they do in JIRA\nPremium\nUltimate\nImprove tanuki animation\nOptimize «Account and limit» settings\nOptimize «Diff limits» settings\nCommit link leads to jira instead of the commit\nChange existing Slack slash commands endpoint route to match new events endpoint route\nServer Hook Plugin Management\nCreate GitLab branch from Jira issue (for Jira Data Center) | DVCS Integration\nDraft: Official Support of\ngo-gitlab\nClient Library\nRe-publish the GitLab Slack app in the Slack marketplace to release link unfurls\nSlack: Error if user reinstalls GitLab Slack Application integration to different Slack workspace\nGitHub detailed status UI — Screen reader considerations (Accessibility)\nGitHub detailed status UI — Use of space\nGitHub detailed status UI — Detailed information returned from the importer\nGitLab for Jira Cloud app should default to .com during installation\nAdd Slack Notification Service Trigger for Vulnerability Dismissals\nGitLab Splunk Integration\nJira Connect: replace reloadPage with fetchSubscriptions action\nSeparate database for web hook logs\nHarbor integration passwords are not protected from users with Developer privelage\nBroadcast message does not match design specs\nMattermost integration - allow for more than one slash command per project\nID feature request, webhook trigger\nClean up async condition logic in integrations controllers\nremove\nGraphqlHelpers#resolve\nConsider consolidating GlModal events\nSend special payload when webhook becomes rate-limited, or disabled\nMaintain project and group file-based import/export as a workaround for migrations over air-gapped networks and to serve other use cases\nCreate or refine Test cases icon: archived & open state 🧦\nFollow-up from \"Improve error display for Zentao issue page\"\nUpdating references to Jira issues on GitLab should update the previously created backlink\nPoC wrap GraphQL with restful endpoints\nImport from Github wizard should still allow you to paste in a Git[hub] URL\nGitHub importer fails when duplicate file entries are present in the source but local cloning works\nAdd OpenAPI 3.1 support to Interactive API docs\nDelete imported projects after user canceled import\nCustom webhook shows \"missing_text_or_fallback_or_attachments\" when testing\nThe missing behavioral API documentation regarding delays, background tasks and caching\nRemove\ncolor\nparameter in Broadcast Message API documentation\nImported Issue should contain Linked Items associated with it\nEco-Design Third Party Integration\nUltimate\nGitLab Mattermost incorrectly displays bot previews when link unfurling is disabled\nEmail notifications for merge requests not consistently grouped in same conversation thread\nMake it easier for users to learn about and find help resources for Advanced Search\nAdd more detail when importing projects from GitHub with error duplicateEntries\nRepository import by URL throws \"There is not a valid Git repository at this URL\" on valid Git URL\nIntegration with Azure Boards\nUltimate\nAdd integration logo: Asana\nAdd integration logo: Assembla\nAdd integration logo: Webex Teams\nAdd integration logo: Unify Circuit\nAdd integration logo: Slack app & notifications\nAdd integration logo: Redmine\nAdd integration logo: Prometheus\nAdd integration logo: Packagist\nAdd integration logo: Microsoft Teams notifications\nAdd integration logo: Jenkins\nAdd integration logo: Irker\nAdd integration logo: Google Chat\nAdd integration logo: EWM\nAdd integration logo: Discord Notifications\nAdd integration logo: Datadog\nGraphQL 500: no policy for GraphQL::Pagination::Connection::Edge\nNon-html views being annotated with html comments\nUpdate GitLab Postman Collection / OpenAPI Spec & publish to Postman API Network\nCapture and log entire error message for\ndev_info\nrequest in Jira integration\nImprove and expand existing OpenAPI 2 / Swagger Documentation for REST API v4\nProject with huge merge requests fails to import with the unclear error: Incorrect JSON format\nAttach multiple vulnerabilities to an existing Jira issue\nAdd GitLab Pages to Advanced Search\nDisplaying multiple import errors\nMake import errors more specific\nFeature Request - BroadCast Message: Restore Ability to customize Font color and Background color using Hex Color Codes\nRetried jobs are not included in Pipeline Hook for Datadog integration\nSettings search should search all settings\nReplace user_select in app/assets/javascripts/pages/dashboard/todos/index/todos.js\nSetting up slash commands with external Mattermost server\nImprove copy Slack application integration\nWhen de-conflicting new destination is the change clear enough?\nMask webhook URLs in UI: pre-fill values (MVC follow-up)\nWebhook Masking/Encryption - Feature Tracking Metrics\nZenTao EE features are mixed into FOSS and not documented as needing a license\nWarn user that some records were not exported\nGroup Test Webhook - Determine Project based on hook type's requirement\nThe Integrations Project Selector used to enable Slack, Jira, or other integrations should have a filter\nDisable GitLab issues when Jira integration is enabled by default\nDesign: how might we make users more aware of what an integration's capabilities are?\nDesign: make it more clear which integrations are active\nFollow-up from \"Add frontend alert for webhook disabled alert\"\nUpdate copy on Slack product selector page\nMigrate legacy Slack Notifications integration settings to Slack App integration\nMigrateUserSelect component in\n~/vue_shared/components/user_select/user_select.vue\nto use GlListbox\nImprove slow tests in ./spec/services/notification_service_spec.rb\nConsistent positioning for status icon/text between nav bar and the pop up dialog\nAdd a skeleton loader to the Contributors page\nHide searchbar for settings pages where it is not useful\nVerify receiving server with certificate pinning\nReflect most recent hook event's status code on /hooks page\nWeb-hooks: Flush the callout cache when web-hooks are fixed\nInvestigation - allow user to re-import failed relations and relations created after previous import\nAllow feature flags to be disabled on an actor-by-actor basis\nAdd custom color option to broadcast messages\nHelp users of the GitLab for Jira (self-managed) workaround move to the marketplace version\nAutomate manual set up steps in Jira for GitLab integration\nCreate\ngitlab_for_jira_app_saas_active\nand\ngitlab_for_jira_app_self_managed_active\nmetrics to track usage of GitLab for Jira App - Part 2\nAdd hover text to status-paused icons on insights chart\nMake our Slack app enterprise grid compatible\nMove Project#execute_hooks and #execute_integrations to WebHooks::QueueHooksForProjectWorker\nUse lazy evaluation when building data for Group hooks\nUse lazy evaluation when building data for System hooks\nMove Project#has_active_hooks? and #has_active_integrations? to trigger class\nConsider caching has_active_integrations? and has_active_hooks? data\nGitHub Importer: enable bulk import of GitHub personal gists to GitLab personal snippets in UI - BE\nGitHub Importer: enable bulk import of GitHub personal gists to GitLab personal snippets in UI - FE\nUtilise new test helpers\nexpect_webhook_executed\nand\nexpect_no_webhook_executed\nwithin the codebase\nReview preloading of hook payloads\nMake GitDock look more like an official GitLab project\nE2E test: Validate import of gists\nE2E test: Validate GitHub org import\nOnly send valid git URLs to webhook consumers\nGracefully handle MVC mismatches when they occur\nInform MR authors and reviewers of MVC mismatches\nUpdate GitLab Migration UI to show all groups available to migrate instead of top-level only\nBuild a dedicated settings context\nIntegrations documentation needs updating\nAdjust Vulnerabilties Slack integration to send only one message per pipeline\nDocs feedback: Specify needed scopes for GitLab integration application\nRate limits consumtion summary\nUpdate Ecosystem metrics paths\nTesting is not available for certain kinds of webhooks\nGitLab Migration - export relations compressed with zip\nGitLab Migration - import relations compressed with zip\nGitLab Migration - export file metadata when exporting relations\nAfter supporting compression with zip: read individual exported files directly from ObjectStorage\nAdd deprecation metadata for our REST API to its OpenAPI data\nWebhook masked tokens: allow user to rename masked items (MVC follow-up)\nIntroduce a project's settings to reset integrations and webhooks\nCreate an OpenAPI contribution guide\nGitLab Migration - migrate Merge Request approval rules\nAdd TriggerableHooks module to ServiceHook model\nOrphaned Elasticsearch migrations for disabled integrations\nAlternative webhook delivery mechanisms\nEnable URL masking for system hooks\nRuboCop: Create rule that requires to place\nBulkInsertSafe\nafter any other concerns\nInclude the global Help menu links as exposed links on the Help page\nBetter support for Gatsby integration\nReplace GraphQL extractor for BulkImports::Common::Pipelines::MembersPipeline with file-based extractor\nReplace REST extractor for BulkImports::Common::Pipelines::BadgesPipeline with file-based extractor\nReplace GraphQL extractor for BulkImports::Groups::Pipelines::GroupPipeline with file-based extractor\nReplace GraphQL extractor for BulkImports::Groups::Pipelines::ProjectEntitiesPipeline with file-based extractor\nReplace GraphQL extractor for BulkImports::Groups::Pipelines::IterationsPipeline with file-based extractor\nReplace GraphQL extractor for BulkImports::Projects::Pipelines::ProjectPipeline with file-based extractor\nReplace GraphQL extractor for BulkImports::Projects::Pipelines::RepositoryPipeline with file-based extractor\nReplace GraphQL extractor for BulkImports::Projects::Pipelines::SnippetsRepositoryPipeline with file-based extractor\nRefactor the architecture of the integration_form component\nIntegration hooks loading more frequently than necessary\nAdd Support for Stackrox CI Integration\nHandle issues with Advanced Search settings differently\nConvert/promote Jira issue to GitLab issue\nGroups::HooksController#test seems to only test Project-related hooks\nDraft: Migrate shared groups and projects\nDraft: Migrate Webhooks (without tokens)\nDraft: Migrate fork relationship\nDraft: Migrate container registry\nTesting group hooks doesn't lookup projects within nested subgroups\nWebHooks - Cannot create Group member event via the API\nPremium\nPresent GraphQL schema variants that match the API feature lifecycle (pre-release, released, future-breaking)\nGitLab Migration pipeline status page\nGitLab for Slack app notifications: UX for private Slack channels\nApply automatic disabling of failed web hooks to integration web hooks\nValidate types of the fetched GitHub repository entities data\nGitLab for Slack App error messages should recommend solutions\nCreate to-dos when someone replies to a thread\nRemove the backwards compatibility patch from web hook logs\nAtlassian GitLab for Jira app (for GitLab Self-managed) gaps and support\nMigrate user mentions in comments to correct user name on target instance\nShow disabled_until value if present in WebHook page\nCreate shared specs for File-based import/export and GitLab Migration\nRelated merge request do not appear on issues if a project is imported\nGitLab for Jira app: Add tutorial video to setup instructions\nWebhooks limit configuration per project on Gitlab SaaS\nRemove Test button for integrations that have broken tests (have not defined a configuration test)\nDocs tutorial: Configure webhooks\nDocs tutorial: Get started with REST API\nAdd 'Cancel all imports' button and confirmation dialog when importing projects from GitHub\nReview and provide more description around Jira metrics\nCreate automations to guide users (internal/external) in building integrations\nDesign exploration: Ideal GitLab for Slack install flow\nJira Story ID Hyperlinks not returned with API results\nFeature Request - YouTrack create issue\nUpdate GitLab Project Migration handbook page\nMake Jet Brains ligatures an opt-in user setting\nSlash commands should identify project by full path, even with there is an alias\nSkip extra work during BulkImports if source and destination instances are the same\nPull Mirror disabled after project import\nProvide a link to correspondig documentation about how to disable internal issue tracker\nAdd ability to retry failed request in the groups selector\nUpdate migration pipelines that use GraphQL API to extract data to use REST API or download ndjson files\nSubgroup should only receive notification for their group only\nGitlab for Jira Cloud App returns 503 for gitlab.com for non-logged-in users\nAdd cancel functionality to Import history and project view pages\nAdd metric for cancelling project imports\nAligning REST to GitLab version instead\nDraft: Migrate packages\nDocument GitLab for Jira cloud app self-managed FAQ\nLabels to be notified in Slack notifications integration not working\nvue_shared > group_select > Revisit form group's accessible label\nGitLab for Slack app Token rotation\nJira automation create branch on GitLab\nAdd user preference for monospace font\nSlack: Allow granular user authorizations\nPurge all relevant Slack data when Slack app is uninstalled\nRe-apply for the Atlassian Marketplace Security Self-Assessment\nFollow-up from \"Fix GitLab Migration groups & projects visibility levels to be preserved\"\nAllow self-managed to configure auto-disabling hooks\nDocs tutorial: Migrate to GitLab\nDraft: Migrate Work Items\nGitlab.com, Bitbucket, Repository by URL, and Manifest, not importing merge requests and issues\nReorganize Integrations documentation\nWeb Hooks - honor Retry-After header when handling 429 Too Many Requests\n[Feature flag] Rollout of\nremove_legacy_diff_note_on_github_import\nNotification emails from GitLab can contain user generated content which could reveal sensitive information\nDisplay a clear security warning after import\nShow progress indicator for running import\nJiraConnect: feature flag integration links to documentation\nReset GitLab for Jira app instance_url when selecting \"change GitLab version\"\nAllow user to toggle between case sensitive and insensitive in Zoekt\nImplement filter by language in Zoekt\nImplement programming language aggregations in Zoekt\nIntroduce a new design for\nProject.integrations\nGraphQL field\nStandardise 'Learn more' links\nMinimized functional collapsed state for navigation redesign (dependent on feedback)\nSupport indexing all new namespaces with Zoekt for SM and GitLab.com\nCreate FIPS compliant Zoekt container images\nAdd Zoekt to reference architectures\nRemove flag to switch between Elastic and Zoekt\nDelete code search indexes from Elasticsearch\nAllow filtering of information in Discord Integration\nWebhook Development Engagement with Secure stage\nIntegrations Static DSL Tutorial Video\nMigrate all breadcrumbs to GlBreadcrumb\nUpdate URL path to match page names\nMerge request drop down in the top bar and MR section of\nYour Work\nshould also have an\nAuthored\noption\nMove users index to segmented indices\nzoekt-webserver ignores TotalMaxMatchCount\nShow webhook failure labels whenever last webhook failed\nAdd detailed messaging about in-progress GitLab direct transfer\nRemove «limit-container-width»\nElasticCommitIndexerWorker break indexing into smaller incremental steps\nProposal: use consistent hashing and assign specific index to Advanced Search namespaces and projects\nUse file-loader by default to import SVG images, allow to\n?raw\nfor legacy imports\nIncorporate\nLocked Files\ninto the Repository Page\nReports for MicrosoftTeams Integrations events returning 400 (Summary or Text is required.)\nMigrate hook test dropdown to new GlDropdownDisclosure API\nSimplify form model updates for new environments form\nPrevent any new Slack Notifications integrations from being created on GitLab.com\nIncorrect slack notifications\nMigrate issue's link items\nAdd Release event to Slack notifications\nMerge Request Pipeline Status in MRs imported via Direct Transfer loading infinitely\nImport from GitHub allows to execute ReDoS with protected branch\nMove user status update modal to the super sideabar hierarchy\nCreate reusable upload dropzone field for integrations\nOwners lack visibility into the configuration of Jira connections\nCommunicate code search syntax change\nTeleport for Zoekt servers\nFeedback when a user wasn't mapped correctly during the migration\nGitLab should pass through feature flags to gitlab-elasticsearch-indexer to pass through to Gitaly\nImport from point-solution platforms to GitLab\nMigrate issue mentions in comments to correct project on target instance\nMigrate project/group memberships of project/groups\nImport GitHub repository Collaborators with custom role as GitLab project members\nUltimate\nFix some dropdown heights (settings and editing issues) to match pajamas standards\nAdd JWT to webhook requests\nRestrict number of allowed project exports in a period\nWhen editing broadcast messages dates and/or times are forgotten, both in FireFox, just hours and minutes in Chrome\nCreate a new button group on the Merge Request page to toggle between \"Assigned\" and \"Review requests\" (with counts).\nAutomate the process for self-managed to update their GitLab for Slack app manifest\nPrevent any new Slack Notifications integrations from being created on self-managed\nPipeline status emails should support selection of users and groups as recipients\nBrinqa Integration Support\n[V2] => Extend YAML parsing to allow raw ruby objects\nAllow Zoekt to index/search non-default branches\nAdjust the feature visibility toggles under project settings\nImprove Slack app development experience by leveraging self-managed support\nConsider creating the placeholder for the draggable pinned item to have better UX\nAdd shortcuts into tooltips\nConsistent in-line user shortcuts\nDiscussion: Revamp your work\nAdd blocked status to pipeline email notifications\nRestrict upload filename to 255 characters\nReview Jira DVCS documentation\nFeature Request - Configurable GraphQL limits for self hosted instances\nDiscuss: Are abstractions always necessary?\nUnable to create a new project from a template when using a group access token\nImprove code organization in object_storage.rb\nAbility to attach artifacts to a Jira issue\nConsider using stronger glyph disambiguation in user handle font\nFonts better suited to programmers\nAllow Customization of Code Font Size\nExtending Datadog integration with REST API access\nFollow-up from \"Super sidebar expanded on load for group setting pages\"\nBackoff Advanced Search migrations if cluster is saturated\nAddress code complexity, and Rubocop for global_slack_handler.rb\nSupport import/export for cadence and iteration related data in dashboards\nRemove jira_connect/subscriptions_controller#create action\nRestructure the Admin Area to isolate collections from single pages\nImprove\nBatchLoader\ndocumentation\nFeature Request: support pre-commit hooks to validate Jira Issue IDs included in commit messages\n✂️ UX Paper Cuts → Labels and Lists, part 2\nMigrate\napp/assets/javascripts/notes/components/discussion_filter.vue\ndisclosure to the listbox component\nGitHub Import: Switch from LegacyDiffNote to DiffNote usage\nAdd ability to rollout broadcast messages on a percentage basis\nPossibility of adding a comment in Jira while the build completes\nShow error(s) that caused import to fail\nForm a process for ensuring alpha API schema is made GA\nDocs - product feedback: Integrations settings page\nAllow weblinks to be disabled in Jira integration\nInvestigate and update the broadcast message api\nProvide parity in the rake tasks for projects using Zoekt-based code search\nShow Zoekt-based project index status in the Admin UI\nMove Full stop out of \"Learn More.\" Link in \"app/assets/javascripts/admin/application_settings/runner_token_expiration/components/expiration_interval_description.vue\"\nMove Full stop out of \"Learn More.\" Link in \"app/views/admin/application_settings/_help_page.html.haml\"\nMove Full stop out of \"Learn More.\" Link in \"app/assets/javascripts/ci/runner/components/runner_form_fields.vue\"\nMove Full stop out of \"Learn More.\" Link in \"app/views/admin/application_settings/_pages.html.haml\"\nMove Full stop out of \"Learn More.\" Link in \"app/assets/javascripts/token_access/components/inbound_token_access.vue\"\nFailure in api/1_manage/migration/gitlab_migration_mr_spec.rb | Manage Gitlab migration with merge request successfully imports merge request\nKeep users in context when going to help\nDon't log errors for Gitlab::ExclusiveLeaseHelpers::FailedToObtainLockError in Elasticsearch/Zoekt indexer workers\nRecurring broadcast messages\nEnable the use of the\nReview Requests\npage as the startpage\nCreate a vue shared component or make changes to the current modal_copy_button for \"copy to clipboard\" that works in modals as well\nDocs: Update screenshots for new left nav\nIf users set prefers-reduced-motion, Gitlab shouldn't fire animation. In any case, new Gitlab should include discoverable options to close the sidebar.\nMake GitLab for Slack app support \"socket mode\" to allow air-gapped instances to use slash commands / chatops\nAddress the naming of the your work context\nCommand palette functional improvements\nReduce time required to run permissions checks for the navigation.\nConsider bringing back the Recent issues search in command palette\nImprove error messages when masking Webhook URL\nAllow the navigation sidebar to be resized\ngroup_path does not have the fully qualified group path for user add / remove member events\nGraphQL docs: List all fields together in single table\nUpdate button spacing in app/views/projects/_new_project_fields.html.haml\nAlternative settings implementation\nReplace bootstrap dropdown in in app/views/projects/merge_requests/_code_dropdown.html.haml\nMake it easier to change your GitHub access token on the import page\nAllow self-managed instances to rename the GitLab for Slack app /gitlab slash command (to support multiple GitLab instances in one Slack workspace)\nImproved labels selection: Migrate to use GlListbox\nMigrate\nbutton-class-vue\nin\napp/assets/javascripts/awards_handler.js\nObserve FLoC changes: \"interest-cohort\" to \"browsing-topics\" header\nResponsive tables inside of GlCard\nTimezone preference for committed dates\n🎨 Design: Moving from Admin Area to Organization for self-managed users\nFollow-up from \"Refactor all Zoekt HTTP calls to Zoekt::Client\"\nGitlab for Jira app improve initial sync: Sync more merge requests instead of just last 400\nGitLab for Jira app improve initial sync: Sync commits\nCustom instance-level project templates requires role even the template project is Public\nAllow rails console node to authenticate with Zoekt\n[DRAFT] 📣 Feedback issue: Page URL changes due to navigation\nZoekt Code Search Feedback Issue\nClicking Merge requests assigned to me option in the search bar leading to 404 error when merge requests are disabled\nMove stop impersonating button out of the top row\nNeed capability to set default instance-wide link preview image\nAdd webhook trigger timestamp to webhook event payloads\nAdmin API to truncate Zoekt index\nRemove data-testid in FE from production builds\nCache Zoekt::IndexedNamespace\nenabled\nlookups\nAdd\ncmd+k\nas a shortcut to open command palette in command mode\n[JIRA Development Panel] Jira unable to detect new branch created by terminal if branch name does not start with Jira issue\nClarify provide\\inject guidelines for Vue development\nWhen creating and MR rule, improve searching for MR reviewers\nUse item id instead of title for all data-qa-submenu-item elements\nDocs feedback - feature proposal: Slack notification for review request\nConsolidate security considerations for the GitLab for Jira Cloud app\nFeature request: Allow for bulk removal of custom integration settings\nImport video attachments from GitHub\nRefactor indexDir\nRefactor ZoektClient\nRefactor zoekt package\nPass all default search modal view links from backend\nImport project by URL where source repository maximum repository limit using LFS files should fail\nUltimate\nSettings: Design system review\nImport image markdown for Github Enterprise Self-Managed\nEnhancing project import efficiency\nRefactor is_logged_out conditions in super sidebar user-bar\nHelp text changes for New API token or Password when setting up Jira integration is confusing\nMap BitBicket Issue status to GitLab labels\nFollow-up from \"Update Zoekt index when default branch change\"\nFeature Request: Add MR approval settings change as a webhook event\nUI Polish: Branch selector hard to see when filtered\nDelete old Jira development panel data\nAdd support for AWS OpenSearch Serverless domains\n[Feature flag] Enable :notifications_todos_buttons\nGitHub Importer - Notify user when rate limit is reached\nAdd Internal API documentation for zoekt tasks api\nMigrate from using Gitlab-Shell-Api-Request in gitlab-zoekt-indexer\nNav eval > Reorder pinned via keyboard\nAPI endpoints to change an integration to use \"Default Settings\"\nFeature Request: allow using project exports API with read-only permissions\nInvestigate a possibility of using BulkImports framework in GitHub Archive File Importer\nAdd an ability to initiate a migration using GitHub Archive File Importer\nAdd an ability to export an organization using GitHub Archive File Importer\nAdd GitHub Archive File Importer API\nAdd an ability to import a relation using GitHub Archive File Importer\nAdd regular expression attribute to project hook API\nPOC: import only data created after previous import from GitHub\nGroup Export doesn't include uploads directory\nGovSlack Gitlab for Slack App\nImproved Asana Integration\nAdd validation before API import from BitBucket Server\nSearch modal shows \"All GitLab\" option for anonmyous users even when it's not allowed\nRefactor GitHub protected branches stage to resume work from where it left off when restarted\nZoekt should support submodules in search results\nUpdate sidebar navigation counts consistently in response to page actions\nSlack app breaks after changing channel name\nCreate exceptions for global notification settings\nMark relevant Direct Transfer workers as\ndeferred\non database healthy - Direct Transfer\n✂️ UX Paper Cuts → Mobile enhancements\nSuccessfully scheduled project exports over 5 GB are missing from S3 bucket - multipart upload support required\nAdd snowplow tracking for all selections in global search modal\nRe-import chosen relation between between source and destination project when migrating by direct transfer\n[Feature flag] Enable bulk_import_deferred_workers\nImprove discoverability of import results\nShow current time in time format preference labels\nMap Jira status to a scoped label\nJira importer - MR links\nMake Group#first_non_empty_project descend into subgroups to find a project\nAdd webide as a sidebar menu\nJira Deployment Pipelines should be \"grouped\"\nChange stage execution order in GitHub Import\nImplement API/GraphQL endpoint for \"Require an associated issue from Jira\"\nPremium\nUltimate\nAdd 302 error handling to group imports\nProject search has a high number of database calls\nMerge request search has a high number of database calls\nComments search has a high number of database calls\nWiki search has a high number of database calls\nCode search has a high number of database calls\nDirect Transfer - merge request pipeline widget not loading when last MR pipeline was in pending status\nGitHub import: alternative to\nsingle_endpoint_notes_import\nfor very large projects\nUnable to import project into nested group using just `path' field via API\nAllow users of the Direct Transfer API to skip certain relations\nLog every time an import is stopped before finishing\nGitHub import: pull project statistics from GitHub API\nMissing MRs Linked in the Project Issues Imported to SaaS by using migration tool\ncongregate\nfor the Customer Engagement\nGitHub importer: Add defer_on_database_health_signal support to avoid DB-related incidents\nsuggestion(intergration): Allow people to customise the colour of the Discord Embed from Discord Notifications\nAdvanced Search Filters: Comments\nImport open MR and issues first to reduce migration downtime - GitHub Import\nMigrate\ntable-tag-vue\nin\napp/assets/javascripts/import_entities/import_projects/components/import_projects_table.vue\nJira Toolchain - Cannot add existing GitLab repos to Jira project\nJira Toolchain - Adding a GitLab repo to a Jira project does not list all Gitlab workspaces in the dropdown\nJira Toolchain - add GitLab repo to Jira has a very narrow dropdown for the namespace\nCannot use project scope search for less than 3 chars\nImport GitLab security policies with direct transfer - check feasibility\nSupport multiple Slack integration for the same repository\nInvestigate usage of toggleContainerClass in epic utils\nInvestigate whether instance_review_permitted? can be removed\nSimplify new_dropdown_view_model helper\nSecondary text color contrast\nGitHub DiffNote importer error: Fails to import when there is no\nline\nAllow new Direct Transfer batch limit setting to be set via admin UI\nPipeline status email notifications truncate\ngitlab_email_reply_to\nsetting to first email address\nAudit the static pages on GitLab\nRefactor to remove\napp/assets/javascripts/whats_new/index.js\nUse GraphQL in GitHub Import\nUpdate Jira importer documentation\nZoekt Indexer creates too many index files\nRefactor super sidebar initialisation to use presenter\nprovide a bypass for the 10,000 API kaminari limit - self managed customers\nAllow CSV file to be used to map users when importing from GitHub to GitLab, rather than requiring public GitHub email\nExport gets stuck for large projects\nEnable internal API by default in GDK\nRefactor how zoekt_nodes are determined for zoekt_searchable_scope\nIterate on new Admin Mode navigation location\n✂️ UX Paper Cuts → Accessibility Pt. 2\nOriginal discussion/planning issue: Ability to disable project integrations for high compliance requirement customers\nUltimate\nImporting from a GitHub Enterprise instance to GitLab.com may not be possible.\nAllow Bitbucket Server migration to be easily canceled by Admin\nAllow BB Cloud migration to be easily stopped by Admin\nZoekt - Plan and implement indexing SLI\nSystem hook to signal Application Settings change\nIn advanced search, instead of empty scopes, show recently updated and created items\nFeature Request - Group email notification in GITLAB CI\nInvalid content-type when importing a repository from SCM Manager\nUpdate Zoekt Grafana Dashboard\nZoekt - enable for trials\nZoekt document troubleshooting API changes\nInvestigate if both integration propagation services can use upsert_all\n404 when importing a personal project\nSystem hook should fire project_update event when push access levels changed\nRemember collection state in navigation sidebar\nGitLab for Jira app: Internal/developer technical docs\nAsciidoc too much vertical spacing in lists and table\nRemove Gitlab::GithubImport::RefreshImportJidWorker\nRun stages in parallel - GitHub Import\nCreate ToDo on Notification-worthy events\nMake import results filterable and searchable\nProvide comprehensive, filterable and searchable report of migration process\nProvide clear and actionable steps when showing import failures to users\nRe-import project chosen relation from UI\nMigrate\nvm-access\nin\nee/spec/frontend/diffs/components/inline_findings_gutter_icon_dropdown_spec.js\nZoekt search fails for anonymous user in public group with private projects\nAdd Zoekt to Self Compiled\nTesting webhooks in the edit form does not use updated data\nDirect transfer - Update bulk import actions UI when only \"Import without projects\" option is available\nImprove groups list UX in \"GitLab for Jira Cloud App\"\nSearch results inconsistent for camel case text\nDatabase migrate theme_id and color_mode_id to user_preferences table\nNew API endpoint\nimport/gitea\nAllow configuration of custom issue tracker ID patterns\nZoekt: Add search button to code view\nTooltips and popovers frequently stick\nAllow the installation of the Slack APP in projects via the API\nGitLab for Slack - Action buttons are disabled when inheriting from group / instance level settings\nAllow the configuration of Slack slash commands for the GitLab for Slack integration on GitLab SaaS\nFailures in spec/requests/search_controller_spec.rb:124\nnon-code scope search should always show syntax options link\nRestrict form-action CSP directive\nFailures in spec/requests/search_controller_spec.rb:20\nSurface BitBucket Server Import Errors to users\nInclude full Gitaly error message in the UI when repository import fails\nClarify when to prefer REST over GraphQL\nGitHub Import attachments issue\nFollow-up from \"Zoekt: Return tasks in internal API\"\nIncorrect MR status in JIRA after potential network failure\nAdd a license check in the Scheduling worker itself\nCatalog system notes in merge requests\nDirect transfer should be more visible and easy to find from UI\nImprove consistency of alert UX on \"update password\" page\nDocs: \"Manage your code\" needs organization\nGoogle chat integration: Thread Support for comments in Issues and Merge Requests\nFollow-up from \"Draft: Zoekt: Add cross-namespace search\"\nGitLab unexpectedly reports pending obsolete elastic migrations\nPremium\nUltimate\nImporters: create standard API response entities\nImporters: standardise file logging\nZoekt pods should have anti affinity rules defined\nConsider adding a table of Duo Chat's many functionalities to the documentation\nImporters: create reusable progress tracker\nIntegration page does not reflect API output\nImporters: create reusable issue saver and integrate with BitBucket\nImporters: create reusable database logger\nZoekt support for movement between cells\nImporters: create reusable merge request saver and integrate with BitBucket\nEnsure Commits deleted on GitLab are also deleted in Jira\nEnsure MRs deleted in GitLab are also deleted in Jira\nZoekt tuning max file size and trigrams\nEnsure Commits SHAs changed from a rebase or squash on GitLab are synced/updated/deleted on Jira\n[HAML] Remove show_icon=false usage of Pajamas::AlertComponent\n[Vue] Remove :show-icon=\"false\" usage of GlAlert\nRemove show_icon argument of Pajamas::AlertComponent\nAdd subdirectory support to zoekt-webserver\nDirect Transfer: Merge Request: undefined method `b' for nil:NilClass\\n\\n revision: ref.b ^^\nPOC for importing chosen relation between two GitLab projects\nOn-demand enablement of export_reduce_relation_batch_size feature flag\nZoekt Indexer: Add (semi) automatic releases\nDetermine routing approach for REST API\nBackpressure mechanism for Zoekt indexing\nForward slash (/) searches files and symbols (code) at the same time\nPOC Jira Server importer\nintegration/phorge: Check for extra (unnecessary) T in URL and strip it\nExploration: Navigation sidebar refresh\nAtlassian (Jira) smart links may not work when SAML SSO is enforced and no existing OAuth app is configured\nBasic search wiki not found when multiple spaces in filename\nFollow-up from \"Draft: Replace zoekt feature_flags with application_settings\"\nShow important labels on TODO view\nAdd Trello integration\nInvestigate flaky integrations\nspec/lib/api/helpers/integrations_helpers_spec.rb\ntest\nDisable auto-complete for users in advanced search\nAdd error handling and logging to MentionsConverter\nZoekt chart integration tests stopped working in CI\nMissing item from navigation documentation: dependency proxy\nInclude default pinned navigation items when logged out\nCreate to-dos when someone comments on an issue you watch\n\"Repository by URL\" project import page sends incomplete credentials while typing\nImprove relevance on command palette users search\nIgnore 'imported' column on Epic model\nUse new default vertical resizing in GlFormTextareas\nWild card search count needs to be triggered on the backend\nSPIKE Proposal: Code Suggestion to use Zoekt as RAG\nAbility to disable GraphQL Explorer endpoint\nAbility to disable GraphQL introspection\nWikis: Search query builder refactor\nCommits: Search query builder refactor\nNotes: Search query builder refactor\nCode: Search query builder refactor\nSlow the ramp up of time webhooks are temporarily disabled for, allowing quicker self-healing\nBackend merge requests milestone facet: implement search\nEnable filtering direct transfer results by statuses available now in FE\nWebhook array attributes cannot be included in custom templates\nRefactor remaining integrations API endpoints to use\n.api_arguments\nConfluence integration should be included in Outbound Request filtering\nAdvanced Search: Add an option of using\nupdated_at\ninstead of callbacks\nJIRA integration API improvements\nUltimate\nCreate to-dos for newly-mentioned users in edited notes\nRemove $spacing-scale SCSS variables\nRemove $size-scale SCSS variables\nRemove $purple and $purple-light SCSS variables\nRemove $well-expand-item SCSS variables\nRemove $gl-grayish-blue SCSS variable\nRemove $type-scale SCSS variables\nRemove $list-border SCSS variable\nRemove $code-color SCSS variable\nRemove $green-500-focus SCSS variable\nRemove $gl-btn-active-background SCSS variable\nCleanup $dropdown SCSS variables\nRemove $filtered-search-term-shadow-color SCSS variables\nCleanup button SCSS variables\nRemove $badge-bg SCSS variables\nRemove $note-disabled-comment-color SCSS variable\nRemove $calendar-user-contrib-text SCSS variable\nRemove $issue-boards-card-shadow SCSS variable\nCleanup $blame SCSS variables\nCleanup $commit SCSS variables\nRemove $logs- SCSS variables\nCleanup $input SCSS variables\nCleanup $label SCSS variables\nRemove $login-brand-holder-color SCSS variable\nRemove $body-text-shadow SCSS variable\nCleanup $perf-bar SCSS variables\nRemove $popup-box-shadow-color SCSS variable\nCleanup $popover-box-shadow SCSS variable\nBackend merge request assignee facet: backfill new document field\nBackend merge request assignee facet: implement search for advanced search\nUNMERGEABLE todo copy is unspecific\nEnhance API Consistency and Flexibility\nMeasure inbound traffic volume from email notifications\nAdmin settings to enable/disable file-based Group export/import\nImprove Zoekt Zonal DR\nJira integration: Password cannot be blank error when switching to default settings\nPremium\nFull-text search for notifications\nfeature proposal: Jira issues visible from the group level\nPremium\nUltimate\nExperiment with regex-generated zoekt queries\nAdvanced search global search for projects in cells architecture\nEmbeddings for all issues for Duo Customers\nEvaluate using AI to evaluate search responses\nAdd a preflight check to reindex_cluster elastic rake task\nCleanup code in\napp/services/issues/base_service.rb\nAllow Jira issue integration to customize required fields.\nAdd support for using reference classes in rake_task_executor_service\nFix user namespaces without routes\nFix namespaces where namespaces.path is not equal to users.namespace\nDiscrepancy between repository API and UI\nClean up expired Direct Transfer exports\nGitLab for Slack app integration not working with Cells 1.0\nGitLab for Jira Cloud app integration not working with Cells 1.0\ncluster reindexing service could set a default scroll setting\nGitLab for Slack app - Re-enabling for groups does not reenabling for projects\nZoekt should be used to index wiki_blobs\nManage \"Time Settings\" and \"Time Preferences\" from a single place\nZoekt syntax not behaving as expected\nCode search count is wrong in Advanced(Elastic) and basic search\nGitLab Slack App - Notifications for vulnerabilities only works for the default branch\nChange font size of inputs to 1rem on mobile\nImplement backend multimatch for Advanced search\nBasic search: Implement backend multimatch code search\nStart using Advanced Search in merge request list\nAdd \"read\" state for notifications\nSpike: create prototype for grouping notifications\nTo-Do List showing To-Dos remaining when all are resolved\nAdd role attribute to Groups API to filter by role of user\nCreate follow-up task from notification\nAdvanced search - N+1 exist for issues results\nCreate generic Elasticsearch delete worker\nA zoekt_search_with_replica FF test path to blob_search_spec.rb work\nElasticsearch errors from search service should be caught\nImprove in-project code search\nInvestigate if Search::Filter be used to build payload_metadata\nUse semantic token in bootstrap_migration_components.scss\nInclude deployments created via the Deployments API in Jira\nNew project creation fails if project name has an underscore followed by a dash or vice versa\nUser mapping - Handle group transfers to another parent group\nUse semantic tokens in app/assets/stylesheets/bootstrap_migration_variables.scss\nUse semantic tokens in app/assets/stylesheets/components/collapsible_card.scss\nUse semantic tokens in app/assets/stylesheets/components/content_editor.scss\nUse semantic tokens in app/assets/stylesheets/components/deployment_instance.scss\nUse semantic tokens in app/assets/stylesheets/components/related_items_list.scss\nUse semantic tokens in app/assets/stylesheets/components/severity/icons.scss\nUser mapping - implement custom placeholder user limit\nAdd a validation and db constraint for the presence of reserved_storage_bytes\nRename\ncrud_component.vue\nsystem hooks: missing events for group/project members (group in group, group in project)\nTodo \"hidden\" field\nUse semantic tokens in app/assets/stylesheets/components/upload_dropzone/upload_dropzone.scss\nUse semantic tokens in app/assets/stylesheets/framework/awards.scss\nUse semantic tokens in app/assets/stylesheets/framework/buttons.scss\nUse semantic tokens in app/assets/stylesheets/framework/common.scss\nConfigurable RAG contexts\nPersonalized Remote Code Context\nUse semantic tokens in app/assets/javascripts/vue_shared/components/crud_component.vue\nCreate end-to-end test for Zoekt code search\nAdd precedence option for Custom Issue Tracker and GitLab Issue Tracker\nCreate System Note for imported resource events - BitBucket Coud\nCreate System Note for imported resource events - Bitbucket Server\nMove default color mode from gitlab.yml to application_settings\nNoMethodError in Search::Zoekt::CallbackService\nDo not subscribe to issue when impacting related MR\nZoekt-indexer tasks API doesn't respect graceful shutdown logic\nMigrate element with 'btn-link' class in in app/helpers/stat_anchors_helper.rb to Pajamas compliant component\nFollow-up from \"Allow default color mode to be set\"\nBackend merge requests milestone facet: introduce new document field\nBackend merge requests milestone facet: backfill data\nUse by_type Filter in ::Search::Elastic::Queries methods\nAllow user to revoke their user mapping approval\nDesign: Changes to organization navigation\nZoekt tasks monitoring\nAllow zoekt scheduling worker to do maintenance tasks even when indexing is paused\nAdd prometheus metric global_search_zoekt_index_creep_size_bytes\nSupport force_reindex in the model Zoekt index methods for IndexingTaskWorker\nAdd reassignment confirmation modal\nRemove btn-danger from submit buttons in forms\nGitHub import should rewrite #xxx links for MRs to !xxx format\nAdd comment to merge requests that touch a Jest spec which is known not to pass under Vue 3\nSeparate event workers into separate Sidekiq shard\nUser mapping - Review if we can map pipeline schedule owners\nCopy topics to new organization\nMigrate element with 'btn-link' class in in app/views/help/index.html.haml to Pajamas compliant component\nReacting to a comment in a thread doesn't always resolve todos for the thread\n\"Mark as done\" button doesn't clear all todos\nAdd docstring to EventStore events\nGitlab Email Notifications When Storage Size Exceeds a Threshold\nExpire user approval for mapping contributions to them after a month\n(Size L) Cells 1.5: Advanced search deployment strategy\nAdd pipeline status email changes to audit events\nPremium\nUltimate\nAllow zoekt to be used for project search if the repository is indexed\nAdd possibility to configure event_name in the System hook\nUser user_contributions relation\nAnnounce snippet search deprecation\nRemove snippet search\nFollow-up: Add validation to integrations to enforce project, group, or instance level availability\nIdentify banners that co-occur on a single page\nFeature: Placeholder user profiles should be private\nIn admin, prevent ability to create impersonation token for internal user\nUser Contribution Mapping - Prevent same user from being mapped to multiple placeholders in the UI\nGitLab Slack App - ability to post notification based on source commit author instead of user that triggered pipeline\nIncrease granularity for microsoft teams integration notifications. - allow a notification only when an MR is created\nUse ELI5 for code search results evaluation\nSearch::Zoekt::SchedulingService prevent the same task from being run concurrently\nLook into action error handling\nReview Summaries (AI?)\nUpdate ToDo action translations\nDeep Link into Project and Group Settings\nCascading settings: all cascading setting should update children on update\nFollow-up from \"Add webhook events for access requests\"\nIntegrations REST API requires different arguments when setting\nuse_inherited_setting\nto true\nPremium\nDeprecate non-nullable target field on Todo in favor of nullable target_entity\nDetermine a better bounded context for UserMentionBehaviour concern.\nCopy updates to-do list empty state\nRemove/rewrite misleading documentation for accessible tooltips\nExpose both pipeline_ref and source_ref for pipelines webhook events\nMake zoekt index pending_deletion state transition event driven\nZoekt search should implement the\nrepo:\noption\nPremium\nUse new auth filter in notes\nSupport index_id argument in the Zoekt::IndexingTaskService\nAllow users to disable \"Member added\" notifications\nZoekt search API should handle fork/archived filters\nZoekt indices should have low watermark removed when storage goes under low watermark threshold\nAdd user actor for Zoekt API\nTurn block_anonymous_global_searches into application setting\nMake allow_anonymous_searches feature flag available in Admin UI\n[Feature Request] Add group_id in the blobs search API\n\"GitLab for Jira Cloud\" app OAuth broken if relative URL path coincides with a system executable\nAdd state column in Search::Zoekt::Node\nImprove query performance by adding new index in zoekt_enabled_namespaces\nUpdate GitLab for Jira Cloud app video showcasing all functionality\nMigrate \"quarantined-deprecated-btn\" to be Pajamas Compliant in app/assets/javascripts/environments/components/deploy_board.vue\nMigrate \"quarantined-deprecated-btn\" to be Pajamas Compliant in app/assets/javascripts/environments/components/environments_table.vue\nMigrate \"quarantined-deprecated-btn\" to be Pajamas Compliant in app/assets/javascripts/set_status_modal/set_status_form.vue\nMigrate \"quarantined-deprecated-btn\" to be Pajamas Compliant in app/assets/javascripts/sidebar/components/assignees/assignee_title.vue\nMigrate \"quarantined-deprecated-btn\" to be Pajamas Compliant in app/assets/javascripts/vue_shared/components/content_viewer/viewers/download_viewer.vue\nMigrate \"quarantined-deprecated-btn\" to be Pajamas Compliant in app/assets/stylesheets/framework/buttons.scss app/controllers/concerns/wiki_actions.rb\nMigrate \"quarantined-deprecated-btn\" to be Pajamas Compliant in app/views/admin/application_settings/appearances/_form.html.haml\nMigrate \"quarantined-deprecated-btn\" to be Pajamas Compliant in ee/app/assets/javascripts/environments_dashboard/components/dashboard/environment_header.vue\nMigrate \"quarantined-deprecated-btn\" to be Pajamas Compliant in ee/app/assets/javascripts/sidebar/components/cve_id_request/cve_id_request.vue\nProvide basic guidelines for Zoekt on SM instances\nGitLab for Slack notification: Include pipeline creation failure\nUpdate gitlab storybook for components in app/assets/javascripts/vue_shared/alert_details/components\nUpdate gitlab storybook for components in app/assets/javascripts/vue_shared/alert_details/components/sidebar\nUpdate gitlab storybook for components in app/assets/javascripts/vue_shared/components/crud_component.stories.js\nUpdate gitlab storybook for components in app/assets/javascripts/vue_shared/components/settings\nUpdate gitlab storybook for components in app/assets/javascripts/vue_shared/components/alert_details_table.vue\nUpdate gitlab storybook for components in app/assets/javascripts/vue_shared/components/dropdown_keyboard_navigation.vue\nUpdate gitlab storybook for components in app/assets/javascripts/vue_shared/alert_details/components/system_notes/system_note.vue\nTo-Dos filters > Make group and project filters mutually aware\nCreate table for tracking zoekt repository assignments.\nZoekt event workers should validate the scope of what they are working on.\nInvestigate usages of\noutline: 0;\nfor accessibility violations\nEnforce permissions check in ApplicationSetting::UpdateService\nMove ApplicationSetting::Term to AppConfig::Term\nAdd migration to remove the issues index\nAdd migration to remove the epics index\nRemove epic_class_proxy\nRemove issue_class_proxy\nRemove Code from Places Issue or Epic class are used directly with search code or specs\nImprove transition of settings block component\nMake storybook entries for Vue Shared Components Alert Details Sidebar components\nUpdate GraphQL to allow filtering users by type\nGitLab for Jira Cloud app does not work with Jira custom domains via the Atlassian Marketplace\n500 error when following unsubscribe link in epic \"new comment\" notification email\nEvaluate and Improve Vue Transition Style Management\nCreate a design document for the concurrency limit middleware\nAuthor filter fails to populate when user has a large volume of todos\n[Feature flag] Rollout of\nelasticsearch_work_item_embedding\nBlocked users do not appear in Author filter\nAllow users to change the default search mode\nImport releases from Gitea\nAdvanced search: remove reliance on limit_project_ids in group and global search\nAdd search argument to Resolvers::Organizations::OrganizationsResolver\nUpdate UsageData to report usage of instance integrations\nUpdate \"jest vue3 mr\" jobs to not ignore quarantined files that have been changed\nFollow-up from \"Add query for hybrid_similarity\"\n\"Reviewer assigned\" emails do not respect subscription toggle\nFix Gitlab::Database::PostgresSequence to include shared sequences\nZoekt nodes with high watermark should destroy replicas when it has unclaimed storage below 0\nSanitize email notifications option\nAdd timeout state to BulkImport::ExportBatch and create a cron job to convert old started jobs.\nPython rendering in commit interface\nAn application setting to update timeout for zoekt indexing\nUser mapping - Throttle placeholder user creation\nUpdate DT and File-based importers to use the included_attributes only\nUse Advanced search in Projects API with search param\nHide Integrations from sidenav when no integrations have been allowed\nUltimate\nAllow group owners to allow-list integrations\nUltimate\nAdd note to top of integrations settings pages if some integrations are not available\nUltimate\nModal warning when integrations of that type are active and are being disabled by admin\nUltimate\nUpdate\nWatch\nevents to include all events\nError when adding an Epic to a todo list from a non-member group\nBackend - GraphQL implement search count\nFollowup: split integration_spec.rb to instance/non-instance/shared specs\nDisplay done todos count in the empty state\nApply import rate limits consistently to all importers and endpoints\nMark an issue as dirty whenever a repository is changed\nRemove legacy Elastic reference\nDocs: Add version history for the GitLab for Slack app\nDocs: Add version history for the GitLab for Jira Cloud app\nProject import adds members with same and lower access level than parent group\nImprove the performance of zoekt scheduling service index_over_watermark_check\nFollow-up from \"Add optimization for groups autocomplete\"\nEs indexer: Remove Icu4c dependency\nShow discussion thread for todo in a preview drawer\nReact to comments from preview drawer\nMove through todos from the preview drawer\nInvestigate why there are multiple thousands of pending zoekt tasks\nChecking a checkbox in an issue description resends todos to mentioned users\nMigrate badge styles for system notes stored in DB\nMigrate $white -> @apply gl-bg-default or @apply gl-bg-overlap or @apply gl-bg-section\nMigrate gl-text-gray-300 -> gl-text-disabled or gl-text-subtle\nMigrate $gray-900 -> @apply gl-text-default or @apply gl-text-strong or @apply gl-text-heading\nMigrate $gray-950 ->\nMigrate $green-500 -> @apply gl-text-success\nMigrate gl-text-blue-400 -> ???\nMigrate $blue-400 -> ???\nMigrate gl-text-blue-500 -> ???\nMigrate $blue-500 -> ???\nMigrate gl-text-blue-600 -> ???\nMigrate $blue-600 -> ???\nMigrate $black -> @apply gl-text-strong or var(–gl-text-color-strong) or var(–gl-color-neutral-1000)\nCreate E2E test for User membership mapping feature of Direct transfer\nAdd API endpoint that delivers all indexed source branch names\nChange api endpoint for source branch filter dropdown\nTo-Do List Shortcuts\nMigrate Jira Connect application settings to \"integrations\" JSON column\nZoekt index assignments should factor in index claimed storage\nSystem hooks missing features like URL masking, Custom Template, Custom Headers\nConsolidate the single zoekt_index and multiple zoekt_indices assignment logic\nAdd rake task to resize an index's shards using Zero-downtime reindexing\nAdd rake task to enable the elasticsearch slow log\n[backend] Add an application setting for enabling the slowlog\nAdd a cron worker to enable the slowlog\nAdd a cron worker to detect and resize shards using zero downtime reindexing\nRemove deprecated global search prometheus metrics\n[frontend] Add an application setting for enabling the slowlog\nUser mapping - Standardize the general style for testing UCM in the 3rd party importers\nMigrate gl-shadow-inner- usage to design tokens\nPG statement timeout when getting old events on very busy webhooks\nDesign: Define scope of work for renaming to-dos to notifications\nDesign: Investigate grouping options for the notification list\nJira Connect New Branch form: Automatically select GitLab project based on Jira project\nDocs: Refactor Elasticsearch docs\nLong-term support for snippet search\nDisable email notifications for group/project access level changed at top level group\nBan use of\ncurrent_application_settings\nwhen reading settings\nFix in-memory representation of ApplicationSetting\nRename\nGitlab::CurrentSettings\nto\nAppConfig::Settings\nInconsistent date time formats across the webhooks when testing them\nRefactor index_over_watermark_check in zoekt scheduling service\nAdvanced Search should use point in time + search_after parameter\nSetting abstraction layer\nRemove .dropdown-menu a, class from ../gitlab-development-kit/gitlab/app/assets/stylesheets/framework/animations.scss\nRemove .dropdown-menu button class from ../gitlab-development-kit/gitlab/app/assets/stylesheets/framework/animations.scss\nRemove .awards class from ../gitlab-development-kit/gitlab/app/assets/stylesheets/framework/awards.scss\nRemove .emoji-icon class from ../gitlab-development-kit/gitlab/app/assets/stylesheets/framework/awards.scss\nRemove .gl-button.selected class from ../gitlab-development-kit/gitlab/app/assets/stylesheets/framework/awards.scss\nRemove .emoji-menu class from ../gitlab-development-kit/gitlab/app/assets/stylesheets/framework/awards.scss\nRemove .emoji-menu-content class from ../gitlab-development-kit/gitlab/app/assets/stylesheets/framework/awards.scss\nRemove .disabled class from ../gitlab-development-kit/gitlab/app/assets/stylesheets/framework/awards.scss\nRemove .emoji-search class from ../gitlab-development-kit/gitlab/app/assets/stylesheets/framework/awards.scss\nRemove .emoji-menu-list class from ../gitlab-development-kit/gitlab/app/assets/stylesheets/framework/awards.scss\nRemove .emoji-menu-list-item class from ../gitlab-development-kit/gitlab/app/assets/stylesheets/framework/awards.scss\nRemove .emoji-menu-btn class from ../gitlab-development-kit/gitlab/app/assets/stylesheets/framework/awards.scss\nRemove .award-menu-holder class from ../gitlab-development-kit/gitlab/app/assets/stylesheets/framework/awards.scss\nRemove .tooltip class from ../gitlab-development-kit/gitlab/app/assets/stylesheets/framework/awards.scss\nRemove .gl-button.btn.award-control class from ../gitlab-development-kit/gitlab/app/assets/stylesheets/framework/awards.scss\nRemove .award-control-icon-neutral class from ../gitlab-development-kit/gitlab/app/assets/stylesheets/framework/awards.scss\nRemove .award-control-icon-positive class from ../gitlab-development-kit/gitlab/app/assets/stylesheets/framework/awards.scss\nRemove .award-control-icon-super-positive class from ../gitlab-development-kit/gitlab/app/assets/stylesheets/framework/awards.scss\nRemove .award-control-icon-loading class from ../gitlab-development-kit/gitlab/app/assets/stylesheets/framework/awards.scss\nRemove .icon, class from ../gitlab-development-kit/gitlab/app/assets/stylesheets/framework/awards.scss\nRemove .award-control-icon class from ../gitlab-development-kit/gitlab/app/assets/stylesheets/framework/awards.scss\nRemove .award-control-icon-positive, class from ../gitlab-development-kit/gitlab/app/assets/stylesheets/framework/awards.scss\nRemove .award-control-text class from ../gitlab-development-kit/gitlab/app/assets/stylesheets/framework/awards.scss\nRemove .gl-button .award-emoji-block class from ../gitlab-development-kit/gitlab/app/assets/stylesheets/framework/awards.scss\nRemove .add-reaction-button class from ../gitlab-development-kit/gitlab/app/assets/stylesheets/framework/awards.scss\nRemove .reaction-control-icon class from ../gitlab-development-kit/gitlab/app/assets/stylesheets/framework/awards.scss\nRemove .gl-icon class from ../gitlab-development-kit/gitlab/app/assets/stylesheets/framework/awards.scss\nRemove .reaction-control-icon-neutral class from ../gitlab-development-kit/gitlab/app/assets/stylesheets/framework/awards.scss\nRemove .reaction-control-icon-positive, class from ../gitlab-development-kit/gitlab/app/assets/stylesheets/framework/awards.scss\nRemove .reaction-control-icon-super-positive class from ../gitlab-development-kit/gitlab/app/assets/stylesheets/framework/awards.scss\nRemove .reaction-control-icon-positive class from ../gitlab-development-kit/gitlab/app/assets/stylesheets/framework/awards.scss\nRemove .reaction-control-icon .gl-icon class from ../gitlab-development-kit/gitlab/app/assets/stylesheets/framework/awards.scss\nRemove .add-reaction-search class from ../gitlab-development-kit/gitlab/app/assets/stylesheets/framework/awards.scss\nRemove .design-note.note-form .emoji-picker .gl-new-dropdown-panel class from ../gitlab-development-kit/gitlab/app/assets/stylesheets/framework/awards.scss\nRemove .click-to-expand class from ../gitlab-development-kit/gitlab/app/assets/stylesheets/framework/blocks.scss\nRemove .row-content-block class from ../gitlab-development-kit/gitlab/app/assets/stylesheets/framework/blocks.scss\nRemove .container-fluid class from ../gitlab-development-kit/gitlab/app/assets/stylesheets/framework/blocks.scss\nRemove .title class from ../gitlab-development-kit/gitlab/app/assets/stylesheets/framework/blocks.scss\nRemove .content-block class from ../gitlab-development-kit/gitlab/app/assets/stylesheets/framework/blocks.scss\nRemove .landing class from ../gitlab-development-kit/gitlab/app/assets/stylesheets/framework/blocks.scss\nRemove .empty-state class from ../gitlab-development-kit/gitlab/app/assets/stylesheets/framework/blocks.scss\nRemove .code-block class from ../gitlab-development-kit/gitlab/app/assets/stylesheets/framework/blocks.scss\nRemove @mixin btn-default class from ../gitlab-development-kit/gitlab/app/assets/stylesheets/framework/buttons.scss\nRemove @mixin btn-outline($background, class from ../gitlab-development-kit/gitlab/app/assets/stylesheets/framework/buttons.scss\nRemove @mixin btn-with-margin class from ../gitlab-development-kit/gitlab/app/assets/stylesheets/framework/buttons.scss\nRoot Level Control on Personal Notification Settings\nPremium\nUltimate\nFix gl-icon variant in ee/app/assets/javascripts/packages_and_registries/container_registry/explorer/components/list_page/container_scanning_counts.vue\nFix gl-icon in ee/app/assets/javascripts/users/identity_verification/components/credit_card_verification.vue\nFix gl-icon in ee/app/assets/javascripts/users/identity_verification/components/international_phone_input.vue\nFix icon in ee/app/assets/javascripts/users/identity_verification/components/verify_phone_verification_code.vue\nFix gl-icon in ee/app/assets/javascripts/vue_shared/dashboards/components/alerts.vue\nFix gl-icon in ee/app/assets/javascripts/vue_shared/dashboards/components/alerts.vue\nTrack errors from LoadPlaceholderReferencesWorker in PostgreSQL\nFix size on gl-icon in app/assets/javascripts/error_tracking/components/error_details_info.vue\nFeedback issue: updated To-Do List experience\nJira issues are still visible after disabling \"View Jira issues\"\nAssign service user contributions from Bitbucket Server to GitLab service user\nFill in missing system events for imported Bitbucket Server MRs\nShow that issue search result matched on a note\nAllow issues scope search to query by type of epics\nInvestigate colors in app/assets/stylesheets/color_modes/_dark.scss\nReduce the size of the TODOs table\nConvert NOTES_MAXIMUM_BYTES to application setting\nMonitoring for zoekt nodes and reservation capacity\nMonitoring for zoekt indices\nMonitoring for zoekt repositories\nDon't import contributions of users banned on source\nglobal search level - applying label filter is causing 500 error\nResearch VectorChord\nExisting benchmarks for vector databases\nCustom Notification Settings Ignored for Pipeline Events\nProvide a hint that we're only showing results in the default branch for commits\nSupport Validation of Jira Ticket Status\nZoekt: Evaluate query performance\nRemove unnecessary\nwebkit-prefix\nfrom SCSS files\nRemove ImportUsers Worker class in BitBucket Server importer\nAdd wiki comments to Advanced search\nStandardize Text Color for Inputs in Dropdowns\nReview and Update\nspinner-deprecated\nMixin\nMigrate Assigned users to use design tokens\nReduce duplication of todo meta data in frontend\nTo-Do counts might be off due to the inclusion of banned users\nAdd Geo Support for Zoekt\nDirect Transfer - ERROR: duplicate key index_vuln_findings_on_uuid_including_vuln_id_1\nRequire associated Jira issue for merge requests to be merged at group level or using policies\nUltimate\nOptimize query from \"Zoekt: Fix negative unclaimed storage bytes\"\nAdd a migrations specific queue for indexing\nFix duplicate id issue with settings_block.vue\n[Settings > Merge requests] Use design token for in-page settings search result\nRename Search::Zoekt.enabled? to .search_enabled?\nDirect-transfer: migrate group item: Iteration cadence settings\nBenchmark different batch sizes in InitialIndexingEventWorker\nFilter out a group and its subgroups/projects in advanced search\nVue todos app > Properly style focused to-do item\nAdd\nonly one notification per review\noption to Matrix Integration\nAllow Groups to be Searchable Via GitLab Search API\nReplace all instances of MOCK_NAVIGATION in tests with fixture\n\"Exact search\" under syntax options can be confusing to users without zoekt\nNotify MR assignee when merge conflicts arise\nzoekt workers review defer on database settings\nProject Import/Export - Display UI warning when export is interrupted because of missing disk space\nAdd global_search setting for notes scope\nAdd global search setting for projects scope\n[Test] ee/spec/features/dashboards/todos_spec.rb | Dashboard todos behaves like dashboard ultimate trial callout .com shows dismissable promotion callout if default dashboard for an owner\nDirect Transfer - Import Vulnerability statuses\nActivity related to design management should count towards user contributions\nRe-evaluate issue.description analyzer\nUse Pajamas::AvatarComponent in avatars_helper.rb\nWrite feature specs for \"hidden by SAML\" todos in the new Vue To-Do Dashboard\nAfter upgrading to 17.6.3 search returns 500 when zoekt is enabled\nInclude Elasticsearch into GitLab delivery packages\nTo-Do counts might be off due to missing targets\nRepositories to be deleted potentially can be moved to pending\ncommand palette ctrl+n doesn't work properly on window and possibly linux\nIncorrect fonts can be used in email notifications when issues are updated\nProject Export fails with\nExhausted number of retries to export: ci_pipelines\nand\nExhausted number of retries to export: merge_requests\nZoekt code search should support multiple replicas for redundancy\nSetting up and maintaining Elasticsearch clusters for larger data is a challenge\nZoekt timings in performance bar is missing for group level search\nMigrate Severity icon colors to design tokens\nActiveContext reset method\nAvoid adding headless column to the end of a table for action buttons\nRemove project_id_from and project_id_to from zoekt_indices\nAllow for direct transfer when source instance is in maintenance mode or show appropriate error message\nSplit TodoService into smaller specialized services\nSupport for hybrid search\nAdd preloading logic for serialising Elasticsearch documents\nBlock a zoekt node and reassign namespaces when there are consistent failures\nZoekt: Refactor stale used_storage_bytes_updated_at logic\nRemove\npick_from_old_menus\nand\ntransform_old_menus\nlogic\nEasily clear to-do items for merged MRs and closed issues\nAllow group owner to delete Placeholder Users that are Awaiting Reassignment via CSV\nIssues created while a project being imported break issue creation after\nInvestigate use of Object.freeze causing OOM/blocking under Vue 3\nAdvanced Search: Explore Siphon for tracking updates\nDirect Transfer - burnup/burndown charts are incorrect\nAllow creating a branch from a Jira issue from a tag\nAlert notification mail subject should contain group\nSearch results - return the list of files instead of file contents\nIndividual Stage wise notifications through Emails for custom users within the Project.\nImprove UX regarding the input character length limit in command palette\nAdd default deduplication strategy to Search::Zoekt::EventWorker\nAllow Searching for Issues from Multiple Child Groups from Parent Group\nErroneus warning \"Elasticsearch version not compatible\"\nAllow instance admin to configure Direct Transfer temp file location\nZoekt search returns 400 http status code for some searches\nDelete todos OWNED by bot users\nZoekt multi match sometimes returns no results\nGitLab status emails for a particular outage should use the same email thread\nExplore utilizing the homepage for onboarding\n[Ban user - Cloud] Could not retrieve banned user status in Project/Group level Restful API\nAdd migration to backfill data\nMenu items should be sentence case\nDocs: GraphQL explorer vs GraphiQL\nWrong usage statistics link in compute minutes usage email for personal namespaces\nImprove the logging of zoekt_scheduling_worker\nStyling of code block in email notifications can result in extra small text\nTrack placeholder user reassignment system failures\nModify Advanced Search/Zoekt error page\nCreate script and document how to create a Project Exports using Direct Transfer\nTurn the\nactivity\nfield into a resolver class in\napp/graphql/types/current_user_type.rb\nShow import history to instance Admins\nFix dropshadow on popover arrows\nMake zoekt indexer testing in the monolith easier\nZoekt: Potential race condition on usable_storage_bytes between planning and provisioning\nAdd user docs for the AI Abstraction Layer\nWorkItem filter comparison for GLQL and Advanced search\nMerge request approval notifications are not sent to non-participants with custom notification settings\nAdvanced Search: Consider indexing all work items\nImporters Documentation Revamp\nAdd gitlab:zoekt:info to GitLab SOS\nRemove index_notes_on_noteable_id_noteable_type_and_id index async\nRemove index_notes_on_noteable_id_noteable_type_and_id index sync\nConvert fork param from boolean to text\nIncorrect To-Do counter\nAutomate Zoekt Release Process\nFeedback : Search bar back in the top nav\nGroup and Project search endpoints are inconsistent and show\nNothing found…\nZoekt: Shrink indices when needed\nSupport Docker installation method for Zoekt\nZoekt: Show a warning if there are no nodes connected\nZoekt: Send restart metrics\nZoekt: Add reindexing feature\nRolloutWorker error \"No node can accommodate project … with size …\"\nEnhance Merge Request Email Notifications\nEnable Per-Branch or Per-Pipeline Pipeline Notification Configuration\nAdvanced project search sort by stars\nDocs: Jira DVCS real time update uses Webhook which requires Maintainer and above role\nBroadcast Message should show for all push and pull operations on all interfaces.\nPremium\n[Feature flag] Rollout of\nreassignment_throttling_table_check\nImport all CI Pipelines\nZoekt support on GitLab Dedicated instance\n[Test] spec/features/dashboard/todos/todos_spec.rb | Dashboard Todos behaves like page with product usage data collection banner shows dismissable product usage data collection callout if not dismissed yet\nZoekt: Resource usage/cost optimizations\nZoekt: Webserver mode - start enforcing JWT if\n-secret_path\nis set\nZoekt: Add OOM graph to Zoekt dashboard\nSMTPUnknownError encountered when sending with QQ Mail\nDocs: Exact Code Search implementation steps with Omnibus GitLab\nExtend GitLab imports to migrate project CI/CD settings\nOffline transfer - outline export source architecture\nType ahead search for project within group\nLook into proper support for GitHub organizations pagination\nAdd ability to delete placeholder users in UI\nInvestigate if msearch is a possibility instead of doing two queries\nAdvanced search elastic_index_dependant_association in milestone model should use work items\nFix Import/Export new attributes detection spec\nMigrate merge request dependencies\nNotification For Job Failure including runner failure\nImport/Export Improve new relation detection spec\nRecord skipped MR import and make available via API\nShow skipped MRs in project import statistics\nError when importing \"instance admin\" push rule from SM to dotcom\nAdvanced search: Add planner role support to comments\nAdvanced search: Add planner role support to merge requests\nAdvanced search: Add planner role support to milestones\nAdd planner role to all visibility specs\nBanner documentation follow-up\nAdvanced search: verify planner role is supported for issue search\nCreate new offline transfer endpoint to initate offline export\nFinalise structure for data exported to object storage\nSearching Issues by Issue ID does not find the Issue\nInherited OWNERS of a subgroup do not receive Request to join mail of project in subgroup\nAdd custom roles to visibility and permissions tests\nDocument placeholder reassignment to blocked users not possible when SSO is enforced\nSupport JSM Deployment Gating for GitLab Self-Managed and Dedicated\nUpdate Jira Service Management section\nAdvanced search - add iteration to work item index\nAdvanced search - add cadence to work item index\nAdvanced search - allow queries for iteration and cadence in work item index\nSupport integration with self-hosted Confluence instances on atlassian.net\nAdvanced Search: Add participant filter\nChange Elastic::ProcessBookkeepingService queue_size to use redis pipeline\nCreate documentation with all events we are using to handle todos/notifications\nAdd database column (or columns) to differentiate between email notifications and web-based notifications\nAdd graphql endpoint to present notifications\nAdd api endpoint to present notifications\nAdd graphql endpoint for notifications actions: marking as read/unread, saving\nAdd api endpoints for notifications actions: marking as read/unread, saving\nAdd sorting for graphql endpoint\nAdd ordering for graphql endpoint\nAdd sorting for api endpoint\nAdd ordering for api endpoint\nInvestigate how to improve Import & Export performance of CI pipelines\nAdd controller/route for a new view\nCreate a worker to periodically delete notifications\nAllow Admins and Users to Mute Bot-Generated Email Notifications at Project/Group/Instance Level\nAdd views and frontend handling\nAdd new fields in work_items index\n[Backend] Allow filtering work_items by status_name\nTreat developers experience as a first class citizen\nManifest import page: Personal Namespace warning shows even when group namespace was selected\nSearch should not show code tab if no zoekt nodes are available & advanced search is off\n[Frontend] Allow filtering issues search by status_name\nBackfill custom_status in work_items index\n[Backend] Add aggregations for work items by status_name\nDocs - product feedback: document storage class change\nWebhook test events have different time formats than actual events\nAdd API support for admin setting to 'bypass placeholder confirmation'\nGitlab tries to send E-Mail notifications via IPv6 when IPv6 is unavailable\nEntering whitespace into\nsearch?search=\ncauses the 0-result error to not appear when 0 results are returned.\nShow selection of N priority to-do items\n\"Project scheduled for deletion\" notification mails are sent to BOT-accounts\nSpike: Test field mappings with expected queries and aggregations\nNotification emails get lost/are not delivered for MRs and Issues, getting unsubscribed from Issues.\nConsolidate token expiration emails\nExternal Email Participants Not Receiving Comment Notifications on Public Projects (v18.0.2-ee)\nDocs: Improve docs around custom notifications\nGoogle Chat Integration\nCombine issue close status change and comment in one email\nSend email for label changes on issues\nInclude the set labels in the email for newly created issues\nSend email on changed descriptions\nShow context of comments in issues and merge requests\nEstablish triage process for newly created MRs via automatic FF removal tool\nFollowup explore possiblity to integrate FF removal tool with duo workflows\nFollow-up from \"Improve work items widget loading state and error handling\"\nMake gitlab log directories mode configurable\nGitLab Kubernetes deployment does not work on isolated network\nDon't add zoekt config to gitlab.yml when secrets not mounted\nLast Updated: 2024-01-03\nEdit this page\nView source",
  "html_file": "91302f35c3ed73e4.html"
}