{
  "url": "https://about.gitlab.com/topics/single-application",
  "title": "Why a single application for DevOps?",
  "headings": [
    "Why a single application for DevOps?",
    "The DevOps toolchain tax",
    "Single application architecture",
    "Benefits of a single application",
    "Start shipping better software faster"
  ],
  "text": "Why a single application for DevOps?\nPlatform\nThe most comprehensive AI-powered DevSecOps Platform\nExplore our Platform\nBuild software faster with AI at every stage of development\nMeet GitLab Duo\n10 reasons why Enterprises choose GitLab\nLearn more\nPlatform Engineering\nDeveloper Experience\nMLOps\nProduct\nCI/CD\nAI-Assisted Development\nSource Code Management\nAutomated Software Delivery\nSecurity & Compliance\nSoftware Supply Chain Security\nCompliance & Governance\nVisibility & Measurement\nValue Stream Management\nAnalytics & Insights\nView all Solutions\nEnterprise\nSmall Business\nPublic Sector\nPricing\nResources\nInstall\nQuick start guides\nLearn\nProduct documentation\nBest practice videos\nIntegrations\nCustomer success stories\nBlog\nRemote\nTeamOps\nGitLab Services\nCommunity\nForum\nEvents\nPartners\nView all resources\nInsights for the future of software development\nRead the latest\nCompany\nAbout\nJobs\nEvents\nLeadership\nTeam\nHandbook\nInvestor relations\nTrust Center\nAI Transparency Center\nNewsletter\nPress\nContact us\nTalk to sales\nGet help\nCustomer portal\nTalk to sales\nGet free trial\nSign in\nClose\nTo search repositories and projects, login to\ngitlab.com\n.\nSuggestions\nGitLab Duo (AI)\nCode Suggestions (AI)\nCI/CD\nGitLab on AWS\nGitLab on Google Cloud\nWhy GitLab?\nTalk to sales\nGet free trial\nGet free trial\nTopics\nSingle application\nWhy a single application for DevOps?\nLearn how simplifying your toolchain using a single application can increase your speed while reducing cost and risk.\nTry GitLab for free\nThe DevOps toolchain tax\nTraditional DevOps solutions require cobbling together multiple tools that were never designed to work together in order to build an DevOps toolchain.\nThis leads to having to pay a “tax” on your toolchain made up hidden costs.\nTime and cost to acquire point tools\nTime and cost to integrate all of these tools\nTime and cost to train users on many tools\nUser context switching between all of these tools\nTime and cost to administer all of these tools\nSingle application architecture\nGitLab is a complete DevOps platform designed from the ground up as a single application. From project planning and source code management, to CI/CD, security, and monitoring GitLab’s capabilities are built-in as part of the app so you don’t have to integrate multiple tools.\nBenefits of a single application\nReduce risk with a single set of permissions\nRather than having to manage authentication and authorization across many tools. GitLab has a single login and one place to set permissions so everyone has the correct access.\nReduce costs with less administrative overhead\nWith a single application to install, configure, and maintain there’s less administrative overhead. Since fewer staff needed to administer a single application verse a complex toolchain more of your engineering resources can be allocated towards development of features for your users.\nIncrease speed with a lower time to resolution\nWhen a build pipeline fails how do you troubleshoot? Is it a problem with the infrastructure or did new code fail a test? Perhaps there is state in the original specification that needed to help debug. With traditional toolchains the issue tracker, code repository, and CI/CD pipeline are all separate tools. When teams need to troubleshoot they have to pass state back and forth in a ticket because they likely don’t all have access to the same applications.\nWith GitLab, everyone who needs to help troubleshoot a failure has access to all of the data. Pipeline, code, comments, issues, and test results all appear on the merge request so there’s a single view. With everyone on the same page troubleshooting is much simpler and things get up and running faster.\nSee more benefits of a single application\nOn this page\nThe DevOps toolchain tax\nSingle application architecture\nBenefits of a single application\n50%+ of the Fortune 100 trust GitLab\nStart shipping better software faster\nSee what your team can do with the intelligent\nDevSecOps platform.\nGet free trial\nTalk to sales",
  "html_file": "aae32982b20b6c71.html"
}