{
  "url": "https://about.gitlab.com/direction/monitor",
  "title": "Stage Direction - Monitor\n|\nGitLab",
  "headings": [
    "Stage Direction - Monitor",
    "What we do",
    "Vision",
    "Composition",
    "Cross-stage vision for GitLab usage analytics",
    "How we do it",
    "Right to Win",
    "Product Principles",
    "Where we're going",
    "Deployment approaches",
    "Handbook Pages"
  ],
  "text": "Stage Direction - Monitor\n|\nGitLab\nStage Direction - Monitor\nMaintained by\n:\nContribute to this page\nEdit this page\nYou are here:\nGitLab Direction\nStage Direction - Monitor\nThe following page may contain information related to upcoming products, features and functionality. It is important to note that the information presented is for informational purposes only, so please do not rely on the information for purchasing or planning purposes. Just like with all projects, the items mentioned on the page are subject to change or delay, and the development, release, and timing of any products, features or functionality remain at the sole discretion of GitLab Inc.\nWhat we do\nVision\nComposition\nThe Analytics section DOES NOT INCLUDE all analytics in GitLab\nCross-stage vision for GitLab usage analytics\nHow we do it\nPersonas\nRight to Win\nProduct Principles\nWhere we're going\n1 Year Plan\nDeployment approaches\nHandbook Pages\nWhat we do\nVision\nOur vision is to continue to extend DevOps across its most painful gap - measuring user value. The Analytics Section closes the DevOps loop. It is not enough to deploy an app and hope for the best. It is critical to understand and explore the data and signals that GitLab provides to make the best, insight-based decisions. We will do this by providing a comprehensive solution to gather and interact with data for both our users and internal teams.\nThis will increase the value of GitLab as a platform since users will have a unified experience. They will know where to find definitive locations for the data they are interested in and have a single place to interact with it. It will also make our organization more efficient since teams can focus on building lovable features rather than re-building how we collect, store, and present data. We will create new product experiences where we can combine data from different features for user use cases that we uncover that would have previously been difficult to serve.\nWe heard a collection of common questions when talking with users that helped us create this vision.\nSome of these were:\nHow can I understand and connect all the different features that GitLab gives me?\nHow are my teams using GitLab?\nHow can I create reports and visualizations to answer business questions I have?\nWhat sort of data do you collect about usage and how can I view it as well?\nHow do I interpret multiple GitLab reports together?\nWhere should I focus my efforts on improving my product in future releases?\nWe previously were primarily focused on helping customers measure the usage and performance of their deployed apps. This was done with our Product Analytics and Observability offerings. What we learned is that many customers either did not prioritize this highly or had solutions in place. What they do not have, and where our opportunity lies, is understanding how their teams are using GitLab or how to combine all the different data signals we provide today. We will use the technology we built for those use cases and adapt it to focus on our GitLab platform use cases instead. We will continue to listen to customers and engage with those that are interested in measuring their deployed apps and consider if and when to re-focus on deployed apps.\nComposition\nThe Analytics Section is comprised of a single Stage: the Monitor stage. This stage has two groups:\nPlatform Insights\nCustom Dashboards Foundation category\nObservability category\nProduct Analytics category\nThe Platform Insights group focuses on allowing users to analyze product data to uncover insights about how their teams are using GitLab and their apps are being used. This is done through preconfigured dashboard and reports as well as enabling users to build their own dashboards and reports.\nAnalytics Instrumentation\nService Ping category\nApplication Instrumentation category\nThe Analytics Instrumentation group focuses on empowering both internal and external users to send usage data to GitLab by providing SDKs and a stable reporting platform. Internally, this means tools like Service Ping and Snowplow as well as providing support to the groups that use them. External users will use the SDK that this group publishes to instrument their own apps. This group focuses on data unification efforts across the platform as part of the\nproduct usage data\nefforts.\nThe Analytics section DOES NOT INCLUDE all analytics in GitLab\nDespite the name, the Analytics section doesn't encompass all analytics capabilities in GitLab. Categories like\nValue Stream Analytics\nand capabilities like\nIssue Analytics\n,\nRelease Metrics\n, or\nCI/CD analytics\nanalytics those are not within the scope of the Analytics section.\nCross-stage vision for GitLab usage analytics\nWe know that many groups and teams within GitLab as well as users rely on data to understand how they are using GitLab. There are multiple approaches to produce and consume data currently, which introduces confusion and friction. Our long-term vision is to unify these so that there is a Single Source of Truth for both how to record data about how GitLab is being used as well as how to consume it. There are additional details on this vision at our\ncross-stage directional vision\npage.\nHow we do it\nPersonas\nThe primary personas we address, in priority order, are:\nSasha - Software Developer\nParker - Product Manager\nSome nuance can be added to our personas and how we approach them. Nearly all analytics questions, workflows, funnels, or any metrics gathering will require technical work to add instrumentation, test, and deploy it. This is the reason we are focusing on Sasha as our primary persona before Parker. We are addressing Sasha in the context that they are supporting Analytics efforts for their team. This means they are interested in how to do tasks related to adding instrumentation code, deploying it, and debugging it in support of analytics-related questions and projects. This is a more focused version of the Sasha overall persona.\nBoth of these personas exist on our users' teams and they also exist on our own GitLab team. Our internal members share many of the same use cases and pain points as our external users. We keep this in mind when developing features and capabilities and try to dogfood as much as possible. We also need to remain mindful that while we share many use cases, we will not have\nall\nuse cases our external users have, so we should not build only for ourselves and not validate with external users. This aligns with our\nyou're not the customer\nproduct principle.\nRight to Win\nWe have the right to win in this Section because:\nThe value stream delivery process is integrating\n- Gartner’s market definition of Value Stream Delivery Platforms ends at Deployment today. We expect it to extend to Monitor and then the outer-loop. If we don’t capture this market as part of our platform - someone else will.\nDeveloper experience is key\n- The current market is broken by poor developer experience. Capturing User Engagement insights in digital products requires developers. We already capture developer workflow, and we know how to delight developers.\nOur distribution models are disruptive\n- Our bottom’s up distribution model allows for adoption without displacement. Developers in larger organizations can instrument and utilize GitLab’s outer-loop categories alongside existing tools. In smaller organizations, they can utilize outer-loop tools as an alternative to using no tool.\nWe are trusted\n- User data, like code - is sensitive data. The focus against third-party ownership of user data, and our availability as a SaaS and self-managed platform allow us to leverage the trust we’ve built as an open-source and transparent company. We are able to develop open-standards for data-storage, and enable contribution to how we handle data to ensure our users can trust it is safe.\nThe single DevOps Platform unlocks unique technical possibilities\n- GitLab stores our users source code, issues, vulnerability records, and other project info. This gives us the opportunity to do associations and correlations that will not be possible to do (or at least not easily) on a standalone analytics product.\nProduct Principles\nWe will pursue this opportunity with the following principles:\nFocus on Developers\n- We have established relationships with them, and they are key to building an onramp to the product and a\ndual flywheel\nto our strategy.\nWorks by Default\n- The way we can establish bottom-up disruption is by making outer-loop categories available, on-by-default in every GitLab instance.\nFocus on Next Generation Adopters\n- Every company is becoming a software company, there are many more software experiences to be written than our written today. The market of tools spanning the outer-loop is segmenting and consolidating, there are many organizations who will be new to it. Focusing on them will allow us to concentrate our R&D effort on future platform growth rather than integration with existing vendors.\nIntegrate Open Source Standards\n- We will stand on the shoulders of giants and use open-source standards, particularly when considering product analytics instrumentation.\nDogfood\n- We should be our own first customer, utilizing our outer-loop capabilities to drive GitLab’s Product Led Growth amongst developers in order to accelerate our learning cycles.\nStart with the problem, not the solution.\n- We will focus on what is impactful for our users and solves real problems for them. There will be temptations to record more data or create more views but we will not do so unless we can first identify who would want to use that and what they would use it for.\nWhere we're going\nThematically, our direction centers around:\nData Completeness\n- Adding the data that users need but are missing from the GitLab platform so that they can get the whole picture.\nExperience Completeness\n- Adding experiences to allow customers to find what they need and consume data from GitLab in they ways they want so they don't need to leverage other tools.\nExperience Usability\n- Providing a consistent experience across GitLab as it relates to consuming and creating data visualizations, and reporting so that users can easily complete their tasks and other GitLab teams have a solid foundation to build on top of.\n1 Year Plan\nOur 1 year plan is to:\nBuild the platform which internal teams use for visualizing and reporting data within the GitLab product.\n- We will focus on providing a single method for creating visualizations, dashboards, and reporting within GitLab so teams can spend more time on addressing use cases and less time on rebuilding visualizations and so that customers will have consistent experiences across the product. We will allow teams to leverage data that they already have, not just from Product Analytics or Observability, to do this.\nUnify the architecture used for product usage data\n- Right now there are multiple approaches within the product with respect to how data is stored and managed for different features. We will work to support the work being done in the\nproduct usage data\nsteering committe to provide a single way that product usage data is stored and managed.\nEnhance our unified instrumentation approach\n- We recently introduced a unified instrumentation method for Product Analytics, called\ninternal event tracking\n, which allows seamless data tracking within GitLab, eliminating the need to delve into the intricacies of Snowplow, Redis, or Redis HLL. Our ongoing commitment is to iterate and improve on this, with the ultimate objective of encouraging more internal teams to effortlessly and promptly instrument their features.\nProvide customer access to usage data\n- In pursuit of our overarching goal to achieve the\ncross-stage data vision\n, we will work towards enhancing accessibility of usage data for our SAAS and self-managed customers\nDogfood everything we build\n- Dogfooding allows us to experience what our users experience - for better or worse. By using our own product, we can identify what needs to be fixed and better understand our users. Dogfooding Product Analytics in the\nInternal Handbook\nand starting to use our\nnew instrumentation approaches\nwill give us valuable feedback to iterate on.\nSupport the ongoing needs of GitLab in understanding our own users\n- GitLab relies on our existing instrumentation and metrics frameworks, such as Service Ping, Redis, and Snowplow, to make data-driven decisions. We will remain focused on ensuring these are robust, scalable, and address any issues that arise.\nDeployment approaches\nThere is a discussion on the different deployment options related to our Product Analytics and Observability technology on our\ndeployments page\n. This was particularly important for when we were asking customers to deploy ClickHouse and related services but since we will now focus on internal teams, it will be less work that we ask external users to do. It will also be updated over time as the\ndata unification efforts\nmake progress and decisions on how to best bundle these services with GitLab.\nHandbook Pages\nAnalytics Instrumentation Group Engineering\nObservability Group Engineering\nEdit this page\nView source",
  "html_file": "e4f2ea210fc0a52a.html"
}