{
  "url": "https://about.gitlab.com/direction/fulfillment",
  "title": "Product Section Direction - Fulfillment\n|\nGitLab",
  "headings": [
    "Product Section Direction - Fulfillment",
    "On this page",
    "Fulfillment Section Overview",
    "Get Involved",
    "Mission",
    "Future Outlook",
    "Recent Accomplishments",
    "Customer Feedback",
    "FY26 goals and alignment with company objectives",
    "Challenges and Opportunities",
    "Roadmap",
    "Key Metrics",
    "Recent Accomplishments and Learnings",
    "Key Links"
  ],
  "text": "Product Section Direction - Fulfillment\n|\nGitLab\nProduct Section Direction - Fulfillment\nMaintained by\n:\nCourtney Meddaugh\n@courtmeddaugh\nContribute to this page\nEdit this page\nYou are here:\nGitLab Direction\nProduct Section Direction - Fulfillment\nThe following page may contain information related to upcoming products, features and functionality. It is important to note that the information presented is for informational purposes only, so please do not rely on the information for purchasing or planning purposes. Just like with all projects, the items mentioned on the page are subject to change or delay, and the development, release, and timing of any products, features or functionality remain at the sole discretion of GitLab Inc.\nOn this page\nFulfillment Section Overview\nGroups\nGet Involved\nMission\nOperating Principles\n1. Provide an Excellent Customer Experience\n2. Drive Strategic Focus\n3. Drive Results Through Collaboration\n4. Balance Innovation with System Health\nFuture Outlook\nImpact on GitLab's addressable market\nRecent Accomplishments\nRecent Pricing & Packaging Highlights\nRecent Customer Experience Improvements\nCustomer Feedback\nFY26 goals and alignment with company objectives\nObjective 1: Support First Order Growth\nKey Initiatives:\nObjective 2: Accelerate Customer Value\nKey Initiatives:\nObjective 3: Enable Customer-Focused Innovation\nKey Initiatives:\nChallenges and Opportunities\nRoadmap\nRoadmap Prioritization\nKey Metrics\nRecent Accomplishments and Learnings\nKey Links\nLast reviewed: 2025-06\nFulfillment Section Overview\nFulfillment at GitLab aims to provide a seamless buying experience for customers. We invest in\nquote-to-cash\nsystems to make purchasing, activating, and managing GitLab subscriptions as easy as possible. This improves customer satisfaction and streamlines our go-to-market (GTM) processes, helping accelerate revenue growth for the company. As GitLab expands its AI offerings and marketplace integrations, the Fulfillment team plays a vital role in enabling these new capabilities for customers while supporting the company's ambitious growth objectives.\nGroups\nThe Fulfillment team consists of five groups:\nFulfillment Platform\n- Provides the architecture and foundational systems that power all fulfillment systems and integrations.\nSubscription Management\n- Enables customers to purchase GitLab products, manage subscriptions, and handle billing through self-service tools.\nProvision\n- Facilitates subscription provisioning after purchase by creating licenses for self-managed instances and updating GitLab.com groups with entitlements.\nSeat Management\n- Handles user assignment of purchased seats and add-ons and provides visibility into seat usage across namespaces.\nUtilization\n- Helps customers view and manage usage for consumable products to optimize their GitLab investments.\nGet Involved\nWe welcome feedback and contributions to help improve our fulfillment processes:\nFor customers and community members: Share your experiences and suggestions through our\npublic issue tracker\nor by contacting your GitLab representative.\nFor everyone: Create a merge request to this page and assign it to\n@courtmeddaugh\nfor review, or\nopen a Fulfillment Meta issue\nwith your ideas.\nYour insights help us continually improve and align our efforts with user needs.\nMission\nEnable customer success through frictionless purchasing and subscription management experiences across the entire GitLab platform. Empower customers to easily acquire, provision, and optimize their GitLab investments through intuitive self-service experiences and flexible monetization models that scale with their needs.\nGitLab paid plans offer rich feature sets that enable customers to build software faster and more securely. For the Fulfillment section, success is to make it as easy as we can for a customer to transact with GitLab and unlock the value of these rich feature sets in our paid offerings.\nWe champion a \"self-service first\" approach while also supporting sales-assisted transactions. Our goal is to enable flexible monetization models including both seat-based subscriptions and usage-based add-ons. We're continuously working to simplify subscription management and support customers' preferred purchasing channels and payment methods. Given the diversity of customers we serve across various countries, organization sizes, and industries, we strive to excel at both direct transactions and sales through\nchannels and alliances\n.\nOperating Principles\nIn our team, we operate based off the below principles.\n1. Provide an Excellent Customer Experience\nDesign purchasing, management and provisioning experiences that are intuitive and self-service first\nEnsure consistent reliability and performance across all customer touchpoints\nSupport customer growth with clear upgrade paths and flexible subscription management options\nFocus on automation to reduce manual intervention and improve accuracy\n2. Drive Strategic Focus\nMaintain rigorous alignment with company strategy and objectives\nValidate decisions through quantitative and qualitative data (customer research and feedback)\nPush back on work that doesn't clearly align with key priorities\nBalance team capacity with strategic initiatives to maintain quality & avoid burnout\n3. Drive Results Through Collaboration\nPartner closely with cross-functional teams to align on customer solutions\nDrive early alignment on quarterly OKRs and key project milestones\nShare visibility into progress and blockers through clear communication\nMaintain focus on revenue impact and business outcomes\n4. Balance Innovation with System Health\nThoughtfully prioritize technical debt alongside new feature development\nInvest in system maintenance to ensure long-term scalability\nFocus on foundational improvements that enable future capabilities\nBuild scalable, maintainable systems that grow with our customer base\nFuture Outlook\nLooking beyond our FY26, the Fulfillment section looks for opportunities to:\nAchieve near-complete automation of standard subscription management processes\nExpand our global payment and billing capabilities to support GitLab's growth in new segments and markets\nDevelop more flexible subscription and payment models to meet the diverse needs of our expanding customer base\nSupport the exploration of new tier structures and product offerings to make our platform accessible to more customers\nIntegrate advanced analytics and AI to provide predictive insights for customer renewal and expansion opportunities\nImpact on GitLab's addressable market\nWe expand our addressable market by launching new product offerings and improving operational efficiency by providing a seamless end-to-end subscription management experience. This enables our Sales teams to spend more of their time on strategic discussions with customers. It also allows our Support and Finance teams to be more efficient.\nRecent accomplishments that have expanded our addressable market include:\nThe introduction of GitLab Duo Enterprise and Duo Pro add-ons, which open up new revenue streams and address evolving customer needs in AI-assisted development.\nEnabling Ultimate trials on existing GitLab.com Premium namespaces, which has facilitated upgrades and increased adoption of our most comprehensive offering.\nImprovements in self-service capabilities, which have made GitLab more accessible to a broader range of customers, particularly in the SMB segment.\nRecent Accomplishments\nWe continue to balance delivering new business opportunities while improving our technical systems foundations.\nRecent Pricing & Packaging Highlights\n2025-05\nGitLab Duo functionality within Premium and Ultimate subscriptions at no extra cost\n2025-04\nGitLab Duo with Amazon Q add-on\n2024-08\nGitLab Duo Enterprise add-on\n2024-01\nGitLab Duo Pro add-on\nRecent Customer Experience Improvements\nFY26-Q1 Introduced\nautomatic removal of dormant users on GitLab.com\nFY26-Q1 Enabled customers to\npay for invoice with a credit card\nFY25-Q4 Launched block seat overages feature in beta\nFY25-Q3 Launched GitLab Duo Enterprise trials\nFY25-Q3 Improved Duo seat assignment with sorting, filtering, and expanded bulk UI assignments for up to 100 users at a time\nFY25-Q3 Launched\nManage Non-billable to Billable Promotions feature\nFY25-Q3 Expanded self-service renewal and auto-renewal for subscriptions with multiple rate plans\nFY25-Q3 Enabled self-service Ultimate trials on exisitng gitlab.com Premium namespaces (previously required internal GitLab team member intervention)\nFY25-Q3 Rolled out\nBeta GitLab.com Opt-in Block Seat Overages\nFY25-Q3 Completed Duo Offline Licensing for Offline customers running Custom Models\nCustomer Feedback\nWe've seen improvements in customer satisfaction and reductions in customers needing assistance, which we can attribute to improvements such as:\nThe introduction of Block Seat Overages and Manage Non-billable to billable promotions helping customers looking for more predictable billing\nOur enhanced Duo seat assignment features improving the user management experience for larger organizations\nThe ability to self-service renew subscriptions with multiple rate plans has reduced friction in the renewal process for many customers\nWe continuously incorporate this feedback into our product development process to ensure we're meeting our customers' evolving needs.\nFY26 goals and alignment with company objectives\nThe Fulfillment team is committed to aligning our priorities with GitLab's strategic objectives. See below some of our focus areas this year. Please note the below list is not all-inclusive due to the SAFE nature of some of our work.\nObjective 1: Support First Order Growth\nTarget Contribution:\nEnable seamless paths to first purchase through modernized licensing, enhanced self-service experiences, and strategic new product offerings\nKey Initiatives:\nEnable migration of Self-managed Ultimate trials to cloud licensing\nEnable Ultimate + Duo Enterprise trials for free Self-managed customers\nImplement temporary extension capabilities using cloud licensing\nBuild a scalable discount promo functionality for self-service purchases via the Customers Portal\nEnhance self-service purchasing and subscription management capabilities by enabling credit card payments for invoices and introducing a streamlined, unified purchase flow to support the self-service purchase of any product\nIncrease renewal rate for subscriptions on auto-renew and auto-renewal eligibility for subscriptions not yet on auto-renew.\nStreamline pre-authorized support contact management\nPartner with Growth team to streamline trial-to-paid conversion processes\nSupport bundled pricing and provisioning of new\nDuo with Amazon Q\noffering\nObjective 2: Accelerate Customer Value\nTarget Contribution:\nImprove the quote-to-cash experience and enhance Premium tier value through streamlined processes and flexible upgrade paths\nKey Initiatives:\nPartner with EntApps to implement centralized data model for Salesforce integration\nImprove monitoring and visibility of transaction data flow through a CDot error monitoring system\nIncrease data accuracy and reliability in the integration between CustomersDot and Salesforce through short-term error improvements\nBuild scalable foundation for future QTC improvements through participation in the newly founded QTC Steering committee\nSupport flexible upgrade paths between Premium and Ultimate\nEnable Duo Enterprise purchase availability for Premium customers\nPartner with Cloud Connector to ensure accurate feature mapping changes\nObjective 3: Enable Customer-Focused Innovation\nTarget Contribution:\nEnable flexible pricing models and streamlined user management to support evolving customer needs and purchasing preferences\nKey Initiatives:\nEvaluate introduction of alternative GitLab offerings\nSupport enhanced billing model for future flexibility\nEnhance Duo provisioning and licensing capabilities\nImplement new Seat Assignment Model and improve handling of seat overages\nEnhance Duo seat provisioning with additional UI and backend customization options\nChallenges and Opportunities\nAs we continue to evolve our fulfillment processes and offerings, we face several challenges and opportunities:\nChallenges:\nBalancing the needs of diverse customer segments, from SMBs to large enterprises\nMaintaining system performance and reliability as we scale and add new features\nEnsuring seamless subscription management for an increasing number of products and add-ons\nOpportunities:\nLeveraging automation to further streamline fulfillment processes\nExpanding our presence in cloud marketplaces to reach new customer segments\nDeveloping more flexible subscription models to meet evolving customer needs\nRoadmap\nDue to the\nnot public\nnature of most of our projects, our product roadmap is internal.\nWe have\nFulfillment FY26 Plans and Prioritization\n(also Not Public), that GitLab team members can reference to track all planned initiatives by theme.\nRoadmap Prioritization\nTo learn more about our roadmap prioritization principles and process, please see\nFulfillment Roadmap Prioritization\nKey Metrics\nWhile we don't publicly share specific numbers, we monitor key metrics across support, self-service adoption, and revenue impact to ensure alignment with GitLab’s growth objectives.\nSupport ticket reduction related to subscription management\nSelf-service subscription management adoption rates\nSeat utilization rates across different subscription types\nTrial conversion rates for new products and add-ons\nRevenue impact of new product offerings and pricing changes\nSystem uptime and performance metrics for critical fulfillment services\nRecent Accomplishments and Learnings\nSee\nFulfillment Recap issues\nfor recaps of other recent milestone accomplishments and learnings (internal when needed).\nKey Links\nFulfillment Guide\n: documentation around CustomersDot Admin tools and process documentation that is not part of the\ncore product documentation\n.\nDev - Fulfillment Sub Department\n: R&D team, priorities, prioritization processes, and more.\nInternal Handbook - Fulfillment\n: documentation that can't be in the public handbook. Minimize this to only\nNot Public\ninformation, such as revenue-based KPIs or sensitive project documentation.\nGitLab Docs Subscription Documentation\nEdit this page\nView source",
  "html_file": "f76dc143816b8ae7.html"
}