{
  "url": "https://about.gitlab.com/sales",
  "title": "Sales",
  "headings": [
    "Talk to sales",
    "Trusted by industry leaders",
    "FAQs",
    "FAQs"
  ],
  "text": "Sales\nPlatform\nThe most comprehensive AI-powered DevSecOps Platform\nExplore our Platform\nBuild software faster with AI at every stage of development\nMeet GitLab Duo\n10 reasons why Enterprises choose GitLab\nLearn more\nPlatform Engineering\nDeveloper Experience\nMLOps\nProduct\nCI/CD\nAI-Assisted Development\nSource Code Management\nAutomated Software Delivery\nSecurity & Compliance\nSoftware Supply Chain Security\nCompliance & Governance\nVisibility & Measurement\nValue Stream Management\nAnalytics & Insights\nView all Solutions\nEnterprise\nSmall Business\nPublic Sector\nPricing\nResources\nInstall\nQuick start guides\nLearn\nProduct documentation\nBest practice videos\nIntegrations\nCustomer success stories\nBlog\nRemote\nTeamOps\nGitLab Services\nCommunity\nForum\nEvents\nPartners\nView all resources\nInsights for the future of software development\nRead the latest\nCompany\nAbout\nJobs\nEvents\nLeadership\nTeam\nHandbook\nInvestor relations\nTrust Center\nAI Transparency Center\nNewsletter\nPress\nContact us\nTalk to sales\nGet help\nCustomer portal\nTalk to sales\nGet free trial\nSign in\nClose\nTo search repositories and projects, login to\ngitlab.com\n.\nSuggestions\nGitLab Duo (AI)\nCode Suggestions (AI)\nCI/CD\nGitLab on AWS\nGitLab on Google Cloud\nWhy GitLab?\nTalk to sales\nGet free trial\nGet free trial\nTalk to sales\nLet's connect you with the best person to help\nPlease complete all fields\nOur sales team can help you:\nGet pricing information\nSchedule a demo\nExplore solutions for your team\nFor technical help, please visit\nGitLab Support\nWhy GitLab?\n80%\nreduction in debugging time\nSource: 2024 commissioned Forrester Consulting Total Economic Impact\nWhy GitLab?\n75%\nfaster developer onboarding\nSource: 2024 commissioned Forrester Consulting Total Economic Impact\nWhy GitLab?\n13x\nfaster security scanning\nSource: CACI customer story\nslide-0\nslide-1\nslide-2\nTrusted by industry leaders\nFAQs\nFAQs\nLicense and Subscription\nShow all\nI already have an account, how do I upgrade?\nHead over to\nhttps://customers.gitlab.com\n, choose the plan that is right for you.\nCan I add more users to my subscription?\nYes. You have a few options. You can add users to your subscription any time during the subscription  period. You can log in to your account via the\nGitLab Customers Portal\nand add more seats or\ncontact sales\nfor a quote. In either case, the cost will be prorated from the date of  quote/purchase through the end of the subscription period. You may also pay for the additional  licenses per our true-up model.\nHow will I be charged for add-on users?\nIf you have\nquarterly subscription reconciliation\nenabled (default option for new and renewing  subscriptions after Aug 1, 2021), users added during a quarter will only be charged for the remaining  quarters of their subscription term as opposed to the full annual subscription fee(s) with annual  true-ups. For example, if you add 50 users to your subscription during the third quarter of your  subscription term, the 50 users will only be charged for the fourth quarter of your subscription term  as opposed to all four quarters as per annual true-ups.\nIf you do not have quarterly subscription reconciliation enabled, add-on users will be charged annual  true-ups for the full term during which they were added. For example, if you have 100 active users  today, you should purchase a 100 user subscription. Suppose that when you renew next year you have  300 active users (200 extra users). When you renew you pay for a 300 user subscription and you also  pay the full annual fee for the 200 users that you added during the year.\nWhat happens when my subscription is about to expire or has expired?\nYou will receive a new license that you will need to upload to your GitLab instance. This can be done  by following\nthese instructions\n.\nWhat happens if I decide not to renew my subscription?\n14 days after the end of your subscription, your key will no longer work and GitLab Enterprise  Edition will not be functional anymore. You will be able to downgrade to GitLab Community Edition,  which is free to use.\nCan I acquire a mix of licenses?\nNo, all users in the group need to be on the same plan.\nHow does the license key work?\nThe license key is a static file which, upon uploading, allows GitLab Enterprise Edition to run.  During license upload we check that the active users on your GitLab Enterprise Edition instance  doesn't exceed the new number of users. During the licensed period you may add as many users as you  want. The license key will expire after one year for GitLab subscribers.\nPayments and Pricing\nShow all\nWhat is a user?\nUser means each individual end-user (person or machine) of Customer and/or its Affiliates  (including, without limitation, employees, agents, and consultants thereof) with access to the  Licensed Materials hereunder.\nIs the listed pricing all inclusive?\nThe listed prices may be subject to applicable local and withholding taxes. Pricing may vary when  purchased through a partner or reseller.\nWhat features are included in GitLab self-managed and SaaS across the pricing plans?\nYou can find an up to date list on the\nfeatures page\n.\nCan I import my projects from another provider?\nYes. You can import your projects from most of the existing providers, including GitHub and  Bitbucket.\nSee our documentation\nfor all your import options.\nDo you have special pricing for open source projects, educational institutions, or startups?\nYes! We provide free Ultimate licenses, along with 50K compute minutes/month, to qualifying open  source projects, educational institutions, and startups. Find out more by visiting our\nGitLab for  Open Source\n,\nGitLab  for Education\n, and\nGitLab for Startups\nprogram pages.\nHow does GitLab determine what future features fall into given tiers?\nOn this page we represent our\ncapabilities\nand those are meant to be filters on our\nbuyer-based open  core\npricing model. You can learn more about how we make tiering decisions on  our\npricing handbook\npage.\nGitLab SaaS\nShow all\nWhere is SaaS hosted?\nCurrently we are hosted on the Google Cloud Platform in the USA\nWhat features are not available on GitLab SaaS?\nSome features are unique to self-managed and do not apply to SaaS. You can find an up to date list  on the\nfeatures page\n.\nStorage Limits\nShow all\nWhat are the current GitLab.com storage limits?\nProjects on GitLab.com have a\n10 GiB storage limit\non their Git repository and LFS storage.\nCompute minutes\nShow all\nWhat are compute minutes?\nCompute minutes are the execution time (in minutes) for your pipelines on our shared runners.  Execution on your own runners will not increase your compute minutes count and is unlimited.\nWhat happens if I reach my minutes limit?\nIf you reach your limits, you can\nmanage your compute usage\n,\npurchase additional compute minutes\n, or upgrade your account to Premium or Ultimate. Your own runners can still  be used even if you reach your limits.\nDoes the minute limit apply to all runners?\nNo. We will only restrict your minutes for our shared runners (SaaS only). If you have a\nspecific  runner setup for your projects\n, there is no limit to your build time on GitLab SaaS.\nDo plans increase the minutes limit depending on the number of users in that group?\nNo. The limit will be applied to a group, no matter the number of users in that group.\nWhy do I need to enter credit/debit card details for free compute minutes?\nThere has been a massive uptick in abuse of free compute minutes available on GitLab.com to mine  cryptocurrencies - which creates intermittent performance issues for GitLab.com users. To discourage  such abuse, credit/debit card details are required if you choose to use GitLab.com shared runners.  Credit/debit card details are not required if you bring your own runner or disable shared runners.  When you provide the card, it will be verified with a one-dollar authorization transaction. No charge  will be made and no money will transfer. Learn more\nhere\nIs there a different compute minutes limit for public projects?\nYes. Public projects created after 2021-07-17 will have an allocation of\ncompute  minutes\nas follows: Free tier - 50,000 minutes, Premium tier - 1,250,000 minutes,  Ultimate tier - 6,250,000.\nJust want to take GitLab for a spin?\nStart your free trial",
  "html_file": "9b6da323c5f2e24c.html"
}